{"celebrities_data": [{"name": "Gaspard Ulliel", "type": "Actor", "film": "Un long dimanche de fiançailles", "desc": "Gaspard Ulliel's dream had always been to direct a movie, and after completing his studies at the lycée (French high school), he majored in cinema at the University of Saint-Denis, and began his acting career. He was born in Paris, to Christine, a runway show producer, and Serge Ulliel, a stylist. ..."}, {"name": "Jennifer Holland", "type": "Actress", "film": "Peacemaker", "desc": "In 2022 Jennifer Holland can be seen starring as Emilia Harcourt in HBO Max's highly anticipated action series \"Peacemaker.\" Based on the DC Comics and executive produced and written by James Gunn, \"Peacemaker\" is the first DC Extended Universe television series, and follows Peacemaker (John Cena) ..."}, {"name": "Dina Shihabi", "type": "Actress", "film": "Jack Ryan", "desc": "Dina Shihabi is a Saudi Arabian actress working in the United States. Dina Shihabi was born in Riyadh, Saudi Arabia, and was raised in Saudi Arabia, Beirut, and Dubai. She had started dance classes at age 6, and at 13 she began taking dance lessons from Sharmilla Kamte, a renowned dance teacher at ..."}, {"name": "Freddie Stroma", "type": "Actor", "film": "Pitch Perfect", "desc": "Freddie Stroma was born on January 8, 1987 in London, England. Freddie is an actor, known for (2012), (2009) and (2010). Freddie has been married to since December 30, 2016."}, {"name": "Jessica Darrow", "type": "Actress", "film": "Encanto", "desc": "Jessica Darrow's a Cuban-American actress. She was born on January 7, 1995 in Miami, Florida. She studied theater at Shakespeare's Globe Theater in London for 5 months. Afterwards, she graduated from Rutgers University w/ a BFA in acting. She resides in New York City w/ her orange tabby cat Giles. ..."}, {"name": "Hunter Schafer", "type": "Actress", "film": "Euphoria", "desc": "Born in Raleigh, North Carolina in 1999, Hunter Schafer graduated from the University of NC School of the Arts and became known in the state for her role, along with her father Mac, in challenging a state House bill requiring people to use public bathrooms that matched the gender on their birth ..."}, {"name": "Gemma Chan", "type": "Actress", "film": "Eternals", "desc": "Gemma Chan (born 29 November 1982) is a British film, television, and theatre actress and former fashion model. She played Charlotte in season four of the Showtime and ITV2 series (2007); Ruth in Channel 4's (2011); Mia Bennett in ..."}, {"name": "Barry Keoghan", "type": "Actor", "film": "The Killing of a Sacred Deer", "desc": "Barry came to prominence in the 2017 film 'The Killing of a Sacred Deer' with his truly terrifying portrayal of Martin,an American teenager exacting a grisly revenge on drunken surgeon Colin Farrell, but he was not an American nor a teen-ager, born in Dublin on 17th October 1992 and has a brother ..."}, {"name": "Sydney Sweeney", "type": "Actress", "film": "Euphoria", "desc": "Sydney Sweeney (born September 12, 1997) is an American actress best known for her roles as Haley Caren on (2017) and Emaline Addario on the Netflix series (2018). Sweeney is set to star in recurring roles in the HBO miniseries (2018) starring ..."}, {"name": "Zendaya", "type": "Actress", "film": "Spider-Man: Homecoming", "desc": "Zendaya (which means \"to give thanks\" in the language of Shona) is an American actress and singer born in Oakland, California. She began her career appearing as a child model working for Macy's, Mervyns and Old Navy. She was a backup dancer before gaining prominence for her role as Rocky Blue on ..."}, {"name": "Jennifer Beals", "type": "Actress", "film": "Flashdance", "desc": "Jennifer Beals is an internationally renowned actress who has over 90 credits to her name, including critically acclaimed feature films and some of the highest rated television series to date. Beals is currently executive producing and returning as a lead cast member in the revival of her hit ..."}, {"name": "Melanie Lynskey", "type": "Actress", "film": "Togetherness", "desc": "At 16 years of age, Melanie Lynskey captivated audiences with her astonishing debut in 's (1994). Her portrayal of Pauline - an outcast teenager whose relationship with her best friend ( ) spirals dangerously out of control - was described as \"perfect\" by ..."}, {"name": "Julia Garner", "type": "Actress", "film": "Ozark", "desc": "Julia Garner is an American actress and model. She has appeared in the films (2011), (2012), (2014), and played leading roles in Electrick Children, We Are What We Are and (2015). She also plays Ruth ..."}, {"name": "Stephanie Beatriz", "type": "Actress", "film": "Encanto", "desc": "Stephanie Beatriz was born on February 10, 1981 in Neuquén, Neuquén Province, Argentina as Stephanie Beatriz Bischoff Alvizuri. She is an actress and producer, known for (2021), (2013) and (2013). She has been married to since October 6, 2018. They..."}, {"name": "Isabel May", "type": "Actress", "film": "1883", "desc": "Isabel May was born on November 21, 2000 in Santa Monica, California, USA. She is an actress, known for (2021), (2018) and (2022)."}, {"name": "Richard Madden", "type": "Actor", "film": "Game of Thrones", "desc": "Richard Madden, born 18 June 1986, is a Scottish stage, film, and television actor best known for portraying Robb Stark in the HBO series \"Game of Thrones\" and Prince Kit in Disney's \"Cinderella.\" Starring as David Budd in the BBC miniseries \"Bodyguard\" has also brought him more international ..."}, {"name": "Meat Loaf", "type": "Actor", "film": "The Rocky Horror Picture Show", "desc": "Meat Loaf was born Marvin Lee Aday in Dallas, Texas, to Wilma Artie (Hukel), a teacher and gospel singer, and Orvis Wesley Aday, a police officer. He moved to Los Angeles in 1967 to play in local bands. In 1970, he moved to New York and appeared in the Broadway musicals \"Hair\", \"Rockabye Hamlet\" ..."}, {"name": "Mckenna Grace", "type": "Actress", "film": "Gifted", "desc": "Mckenna Grace was born on June 25, 2006 in Grapevine, Texas, USA. She is known for her work on (2017), (2017) and (2017)."}, {"name": "Ming-Na Wen", "type": "Actress", "film": "Mulan", "desc": "Ming-Na (\"enlightenment\") was born on the island of Macau, forty miles from Hong Kong. Her mother, Lin Chan Wen, divorced her father when Ming-Na was only a toddler. She has an older brother named Jonathan. After the divorce, they moved to Hong Kong where her mother became a nurse. There her mother..."}, {"name": "Freya Allan", "type": "Actress", "film": "The Witcher", "desc": "Freya Allan (Oxfordshire, England, September 6, 2001) is a British actress known for being chosen to play Cirilla Fiona Elen Riannon in the Netflix adaptation of (2019). After a controversy over a text where, to interpret Ciri, an actress cataloged as BAME (Black, Asian or Minority ..."}, {"name": "Anya Chalotra", "type": "Actress", "film": "The Witcher", "desc": "Anya Chalotra (born in 1996) is an English actress known for playing Jennifer Ashman in the British TV show (2018) and for her role as Yennefer of Vengerberg in the Netflix series (2019). Chalotra was born in a British-Indian family. Her father is of Indian descent while her ..."}, {"name": "Cole Hauser", "type": "Actor", "film": "2 Fast 2 Furious", "desc": "Cole Hauser was born in Santa Barbara, California. He is the son of , who founded a film production company (Warner Sisters), and , an actor. His grandfathers were screenwriters and , and his maternal great-grandfather was film mogul ..."}, {"name": "Ella Purnell", "type": "Actress", "film": "Miss Peregrine's Home for Peculiar Children", "desc": "Ella Purnell was born in London, U.K. She is best known for her roles in Tim Burton's Miss Peregrine's Home For Peculiar Children (2016), in BBC One's Ordeal By Innocence (2017) and Starz' Sweetbitter (2017), in which she plays the series lead role of Tess in the adaptation of Stephanie Danler's ..."}, {"name": "Alyssa Milano", "type": "Actress", "film": "Commando", "desc": "Alyssa Milano comes from an Italian-American family; her mother is a fashion designer and father is a film music editor. Alyssa was born in a working-class neighborhood in Brooklyn and grew up in a modest house on Staten Island. One day her babysitter, who was an aspiring ..."}, {"name": "Matt McGorry", "type": "Actor", "film": "Orange Is the New Black", "desc": "Matt McGorry was born on April 12, 1986 in Manhattan, New York, USA as Matthew David McGorry. He is an actor and producer, known for (2013), (2014) and (2006)."}, {"name": "Lily James", "type": "Actress", "film": "Cinderella", "desc": "Lily James was born Lily Chloe Ninette Thomson in Esher, Surrey, to Ninette (Mantle), an actress, and Jamie Thomson, an actor and musician. Her grandmother, , was an American actress. She began her education at Arts Educational School in Tring and subsequently went on to study acting at..."}, {"name": "Henry Cavill", "type": "Actor", "film": "Man of Steel", "desc": "Henry William Dalgliesh Cavill was born on the Bailiwick of Jersey, a British Crown dependency in the Channel Islands. His mother, Marianne (Dalgliesh), a housewife, was also born on Jersey, and is of Irish, Scottish and English ancestry. Henry's father, Colin Richard Cavill, a stockbroker, is of ..."}, {"name": "Oscar Isaac", "type": "Actor", "film": "Ex Machina", "desc": "Oscar Isaac was born Óscar Isaac Hernández Estrada in Guatemala, to a Guatemalan mother, María Eugenia, and a Cuban father, Oscar Gonzalo Hernández-Cano, a pulmonologist. Oscar was raised in Miami, Florida. Before he became an actor, he played lead guitar and sang vocals in his band the Blinking ..."}, {"name": "Jodie Comer", "type": "Actress", "film": "The Last Duel", "desc": "Jodie Comer is a British actress from Liverpool, England. She is known for playing Rey's mother in Star Wars Episode IX: The Rise of Skywalker, Villanelle in Killing Eve, Marguerite de Carrouges in The Last Duel, Kate Parks from Doctor Foster, Millie Rusk in Free Guy and Chloe Gemell from My Mad ..."}, {"name": "Diane Guerrero", "type": "Actress", "film": "Orange Is the New Black", "desc": "Diane Guerrero (born July 21, 1986) is an American actress. She is best known for her roles as Maritza Ramos on the Netflix series Orange Is the New Black and Lina on Jane the Virgin. Among her other roles was a recurring role on Are We There Yet? Guerrero grew up in Boston and remained there after..."}, {"name": "Jenna Ortega", "type": "Actress", "film": "Scream", "desc": "Jenna Marie Ortega was born on September 27, 2002, in Coachella Valley, California. Jenna began acting at the age of nine and has portrayed the role of Harley, a creative engineering prodigy navigating life as the middle child in a family of seven children, in \"Stuck in the Middle,\" a Disney ..."}, {"name": "Louie Anderson", "type": "Actor", "film": "Life with Louie", "desc": "Iconic comedian Louie Anderson, the three-time Emmy®-Award winner, was one of the country's most recognized and adored comics; named by Comedy Central as \"One of 100 Greatest Stand-Up Comedians of All Time.\" His career spanned more than 30 years. He was a best-selling author, star of his own stand ..."}, {"name": "Tom Holland", "type": "Actor", "film": "Spider-Man: Homecoming", "desc": "Thomas Stanley Holland was born in Kingston-upon-Thames, Surrey, to Nicola Elizabeth (Frost), a photographer, and (Dominic Anthony Holland), who is a comedian and author. His paternal grandparents were from the Isle of Man and Ireland, respectively. He lives with his parents and ..."}, {"name": "Diane Morgan", "type": "Actress", "film": "Me Before You", "desc": "Diane Morgan was born on October 5, 1975 in Bolton, Greater Manchester, England. She is an actress and director, known for (2016), (2013) and (2019)."}, {"name": "Sam Page", "type": "Actor", "film": "Mad Men", "desc": "Born in Whitefish Bay, Wisconsin, as Sam Elliott, Sam Page attended Princeton University where he earned a BA in ecology and evolutionary biology. For his senior thesis, Page wrote about the mating habits of a female mosquitofish; the work was published in a science journal. After graduation, Page ..."}, {"name": "Neve Campbell", "type": "Actress", "film": "Scream", "desc": "Neve Campbell was born and raised in Guelph, Ontario, to Marnie (Neve), a Dutch-born psychologist and yoga instructor (from Amsterdam), and Gerry Campbell, a Scottish-born teacher (from Glasgow). Campbell first came to our TV screens in the hit Drama series (1994). Described as TV's ..."}, {"name": "Ma Dong-seok", "type": "Actor", "film": "Busanhaeng", "desc": "Ma Dong-seok (born Lee Dong-seok on March 1, 1971), also known as Don Lee is a South Korean-American actor best known for his supporting roles in The Neighbor, Nameless Gangster: Rules of the Time, and The Unjust. He also played leading roles in Norigae, Murderer and One on One. Under his ..."}, {"name": "Eric Nelsen", "type": "Actor", "film": "1883", "desc": "Eric Nelsen was born on June 26, 1991 in West Palm Beach, Florida, USA. Eric is an actor and producer, known for (2021), (2014) and (2014). Eric has been married to since November 29, 2013."}, {"name": "Kelly Reilly", "type": "Actress", "film": "Pride & Prejudice", "desc": "Jessica Kelly Siobhán Reilly (born 18 July 1977) is an English actress. Her performance in After Miss Julie at the Donmar Warehouse made her a star of the London stage and earned her a nomination for a Laurence Olivier Award for Best Actress of 2003. Reilly was born and brought up in Chessington, ..."}, {"name": "Hailee Steinfeld", "type": "Actress", "film": "True Grit", "desc": "Hailee Steinfeld was born on December 11, 1996 in Tarzana, California, to Cheri (Domasin), an interior designer, and , a personal fitness trainer. She has a brother, Griffin. Her uncle is , a fitness trainer, and her great-uncle is actor . Her father is of ..."}, {"name": "Andrew Garfield", "type": "Actor", "film": "Hacksaw Ridge", "desc": "Andrew Russell Garfield was born in Los Angeles, California, to a British mother, Lynn, and American father, Richard Garfield. When he was three, he moved to Surrey, U.K., with his parents and older brother. He is of English and Polish Jewish heritage. Andrew was raised in a middle class family, ..."}, {"name": "Temuera Morrison", "type": "Actor", "film": "Once Were Warriors", "desc": "Temuera Derek Morrison is a New Zealand actor. After training in drama under the New Zealand Special Performing Arts Training Scheme. One of his earliest starring roles was in the 1988 film Never Say Die, opposite Lisa Eilbacher. In 1994, he received attention for his role as the violent and abusive..."}, {"name": "Yvette Mimieux", "type": "Actress", "film": "The Time Machine", "desc": "An intelligent, slender leading lady of the 1960s and 70s, Yvette Carmen Mimieux was born in Hollywood, California, to Maria (Montemayor) and René Mimieux, an occasional movie extra. Her father was born in England, of French and German descent, and her mother was Mexican. While she was first ..."}, {"name": "Peyton List", "type": "Actress", "film": "Diary of a Wimpy Kid: Dog Days", "desc": "A media darling best known for her portrayal as Emma Ross on the fan favorite Disney's Jessie and Bunk'd. in 2019 List received positive praise from the media for her character portrayal of \"Tory\" in the Karate Kid spin-off series, Cobra Kai. She also appeared in the CBS series, Happy Together, ..."}, {"name": "Maude Apatow", "type": "Actress", "film": "This Is 40", "desc": "Maude Apatow is an American actress. She is the eldest daughter of director and actress , and is possibly best known for her very popular Twitter page. After minor roles in (2007) and (2009), as the daughter of 's characters, she had a ..."}, {"name": "Lauren Ridloff", "type": "Actress", "film": "Eternals", "desc": "Lauren Ridloff is an American actress and former teacher. She is known as a former Miss Deaf America (2000 - 2002), as Lauren Teruel. She's also known for her 2018 Tony-nominated Broadway performance as Sarah Norman in Children of a Lesser God, and as Connie in the AMC Television series The Walking..."}, {"name": "Cassidy Freeman", "type": "Actress", "film": "The Righteous Gemstones", "desc": "Cassidy Freeman (born April 22, 1982, in Chicago, IL) is an American actress and musician. She is known for her role as Tess Mercer in The CW's superhero drama \"Smallville\" (2001) and Cady Longmire in \"Longmire\" (2012). Her parents are prominent attorneys, who also own a cattle ranch in Montana. ..."}, {"name": "Kit Harington", "type": "Actor", "film": "Game of Thrones", "desc": "Kit Harington was born Christopher Catesby Harington in Acton, London, to Deborah Jane (Catesby), a former playwright, and David Richard Harington, a businessman. His mother named him after 16th-century British playwright and poet Christopher Marlowe, whose first name was shortened to Kit, a name ..."}, {"name": "Ana de Armas", "type": "Actress", "film": "Blade Runner 2049", "desc": "Ana de Armas was born in Cuba on April 30, 1988. At the age of 14, she began her studies at the National Theatre School of Havana, where she graduated after 4 years. At the age of 16, she made her first film, (2006), directed by . A few titles came after ..."}, {"name": "Alexa Demie", "type": "Actress", "film": "Euphoria", "desc": "Alexa Demie is a singer, songwriter and actress, known for her work in features including (2017), (2018) and (2019). She had recurring roles as Shairee in (2013), Marina in (2016) before landing her starring role as Maddy Perez in the 2019 series ..."}, {"name": "Cush Jumbo", "type": "Actress", "film": "The Good Wife", "desc": "Cush Jumbo is a British Actress and Writer best known for playing Lucca Quinn in The Good Wife. She was Olivier nominated for the role of Marc Anthony in Phyllida Lloyd's all female production of Julius Caesar (Donmar Warehouse/St Anns Warehouse NYC) and won an Evening Standard Award for writing ..."}, {"name": "Ariana DeBose", "type": "Actress", "film": "West Side Story", "desc": "Ariana DeBose was born on January 25, 1991 in Raleigh, North Carolina, USA as Ariana Nicole DeBose. She is an actress and director, known for (2021), (2020) and (2020)."}, {"name": "Richard Armitage", "type": "Actor", "film": "The Hobbit: An Unexpected Journey", "desc": "Richard Crispin Armitage was born and raised in Leicester, England, to Margaret (Hendey), a secretary, and John Armitage, an engineer. He attended Pattison College in Binley Road, Coventry, where he discovered his love for acting. He took part in many theatre productions all over the UK, from ..."}, {"name": "Florence Pugh", "type": "Actress", "film": "Midsommar", "desc": "Florence Pugh is an English actress. She is known for The Falling (2014), her film debut, Lady Macbeth (2016), Outlaw King (2018), Fighting with My Family (2019), and Midsommar (2019). Pugh also appear in the ITV detective series Marcella and starred in the AMC Mini-Series The Little Drummer Girl. In..."}, {"name": "Mikey Madison", "type": "Actress", "film": "Once Upon a Time in... Hollywood", "desc": "Mikey Madison was born on March 25, 1999 in Los Angeles, California, USA. She is an actress, known for (2019)."}, {"name": "Timothée Chalamet", "type": "Actor", "film": "Call Me by Your Name", "desc": "Timothée Hal Chalamet was born in Manhattan, to , a real estate broker and dancer, and Marc Chalamet, a UNICEF editor. His mother, who is from New York, is Jewish, of Russian Jewish and Austrian Jewish descent. His father, who is from Nîmes, France, is of French and English ancestry. ..."}, {"name": "Julia Chan", "type": "Actress", "film": "Saving Hope", "desc": "Julia Chan is a British actor who grew up between Hong Kong and the UK. She is a 2010 graduate of The New School for Drama in New York and has a BA degree in History of Art and Architecture from Harvard University. Julia played Dr. Maggie Lin on the long running hit Canadian medical drama \"Saving ..."}, {"name": "Sophie Nélisse", "type": "Actress", "film": "The Book Thief", "desc": "Sophie Nélisse was born in Windsor, Ontario, but moved to Montréal with her family when she was just age four. She began her career at the age of seven in commercials, then made her movie debut at age 10 in the 2012 French-Canadian film Monsieur Lazhar. For her performance in the film, she won a ..."}, {"name": "Christina Ricci", "type": "Actress", "film": "Buffalo '66", "desc": "Precocious, outspoken child-teen starlet of the 1990s, Christina Ricci was born on February 12, 1980 in Santa Monica, California, the youngest of four children of Sarah (Murdoch), a realtor, and Ralph Ricci, a lawyer and therapist. She is of Italian (from her paternal grandfather), Irish, and ..."}, {"name": "Kelly Rohrbach", "type": "Actress", "film": "Baywatch", "desc": "Kelly Rohrbach is a Connecticut-born actress. After graduating from Georgetown University in 2012, where she was recruited to play Division One Women's Golf, she moved to Los Angeles to pursue her passion for acting. Kelly majored in theater at Georgetown, as well as attending the London Academy of..."}, {"name": "Luke Grimes", "type": "Actor", "film": "Fifty Shades of Grey", "desc": "Luke Grimes was born on January 21, 1984 in Dayton, Ohio, USA as Luke Timothy Grimes. He is an actor, known for (2015), (2014) and (2006)."}, {"name": "Betty White", "type": "Actress", "film": "The Proposal", "desc": "Betty White was born in Oak Park, Illinois, to Christine Tess (Cachikis), a homemaker, and Horace Logan White, a lighting company executive for the Crouse-Hinds Electric Company. She is of Danish, Greek, English, and Welsh descent. Although best known as the devious Sue Ann Nivens on the classic ..."}, {"name": "Teresa Palmer", "type": "Actress", "film": "Warm Bodies", "desc": "Actress and model Teresa Palmer has gathered some impressive film credits. She was born in Adelaide, South Australia, to Kevin Palmer, an investor, and Paula Sanders, a former missionary and nurse. She completed high school at Mercedes College in 2003, where she was a popular student who was ..."}, {"name": "Francia Raisa", "type": "Actress", "film": "How I Met Your Father", "desc": "Francia Raisa is a bilingual first generation Mexican and Honduran actress, born and raised in Los Angeles. Francia began her acting career in 2005 at the fresh-faced age of 17 and has since made quite an impression in Hollywood. Upon making her debut, she's since become a powerhouse and catalyst ..."}, {"name": "Jodie Sweetin", "type": "Actress", "film": "Full House", "desc": "Jodie Sweetin was born on January 19, 1982 in Los Angeles, California, USA as Jodie Lee Ann Sweetin. She is an actress and producer, known for (1987), (2016) and (2015). She was previously married to , and Shaun Holguin."}, {"name": "Christopher Lowell", "type": "Actor", "film": "The Help", "desc": "Christopher Lowell was born on October 17, 1984 in Atlanta, Georgia, USA. He is an actor and director, known for (2011), (2020) and (2009)."}, {"name": "Leonardo DiCaprio", "type": "Actor", "film": "Inception", "desc": "Few actors in the world have had a career quite as diverse as Leonardo DiCaprio's. DiCaprio has gone from relatively humble beginnings, as a supporting cast member of the sitcom (1985) and low budget horror movies, such as (1991), to a major teenage heartthrob in the 1990s,..."}, {"name": "Alexandra Daddario", "type": "Actress", "film": "Baywatch", "desc": "Alexandra Anna Daddario was born on March 16, 1986 in New York City, New York, to Christina, a lawyer, and Richard Daddario, a prosecutor. Her brother is actor , her sister is actor , and her grandfather was congressman (Emilio Q. Daddario), of ..."}, {"name": "Angus Cloud", "type": "Actor", "film": "Euphoria", "desc": "Angus Cloud was born on July 10, 1998 in Oakland, California. He is an actor, known for (2019), and ."}, {"name": "Angelina Jolie", "type": "Actress", "film": "Girl, Interrupted", "desc": "Angelina Jolie is an Academy Award-winning actress who rose to fame after her role in (1999), playing the title role in the \"Lara Croft\" blockbuster movies, as well as (2005), (2008), (2010) and (2014). Off-screen, Jolie has become ..."}, {"name": "Salma Hayek", "type": "Actress", "film": "Frida", "desc": "Salma Hayek was born on September 2, 1966 in Coatzacoalcos, Mexico. Her father is of Lebanese descent and her mother is of Mexican/Spanish ancestry. After having seen (1971) in a local movie theater, she decided she wanted to become an actress. At age 12, she..."}, {"name": "Cate Blanchett", "type": "Actress", "film": "Carol", "desc": "Cate Blanchett was born on May 14, 1969 in Melbourne, Victoria, Australia, to June (Gamble), an Australian teacher and property developer, and Robert DeWitt Blanchett, Jr., an American advertising executive, originally from Texas. She has an older brother and a younger sister. When she was ten ..."}, {"name": "Matthew Goode", "type": "Actor", "film": "Stoker", "desc": "Matthew William Goode (born 3 April 1978) is an English actor. His films include Chasing Liberty (2004), Match Point (2005), Imagine Me and You (2006), Brideshead Revisited (2008), Watchmen (2009), A Single Man (2009), Leap Year (2010), Stoker (2013) and The Imitation Game (2014). Goode also ..."}, {"name": "Alexander Skarsgård", "type": "Actor", "film": "The Legend of Tarzan", "desc": "Alexander Johan Hjalmar Skarsgård was born in Stockholm, Sweden and is the eldest son of famed actor . Among his siblings are actors , , and . For most of his formative years, his father was an acclaimed actor in Europe but had not yet ..."}, {"name": "John Cena", "type": "Actor", "film": "The Suicide Squad", "desc": "John Felix Anthony Cena was born on April 23, 1977 in West Newbury, Massachusetts to and John Cena. He is of Italian (father) and French-Canadian and English (mother) descent, and is the grandson of baseball player Tony Lupien. When he was in college, he played football. He then ..."}, {"name": "Mackenzie Davis", "type": "Actress", "film": "Terminator: Dark Fate", "desc": "Mackenzie Davis was born and raised in Vancouver, British Columbia, Canada and went to McGill University in Montreal. She studied acting at the Neighborhood Playhouse in New York City. Shortly thereafter, she was discovered by , and made her acting debut in his feature film, ..."}, {"name": "Mark Rylance", "type": "Actor", "film": "Bridge of Spies", "desc": "Widely regarded as the greatest stage actor of his generation, Sir Mark Rylance has enjoyed an esteemed career on stage and on screen, and won the Academy Award for Best Supporting Actor and the BAFTA Award for Best Supporting Actor for his portrayal of Rudolf Abel in 's ..."}, {"name": "Jennifer Lawrence", "type": "Actress", "film": "The Hunger Games", "desc": "As the highest-paid actress in the world in 2015 and 2016, and with her films grossing over $5.5 billion worldwide, Jennifer Lawrence is often cited as the most successful actress of her generation. She is also thus far the only person born in the 1990s to have won an acting Oscar. Jennifer Shrader ..."}, {"name": "Jesse Plemons", "type": "Actor", "film": "The Irishman", "desc": "Jesse Plemons was born on April 2, 1988 in Dallas, Texas, USA as Jesse Lon Plemons. He is known for his work on (2019), (2018) and (2012)."}, {"name": "Keanu Reeves", "type": "Actor", "film": "The Matrix", "desc": "Keanu Charles Reeves, whose first name means \"cool breeze over the mountains\" in Hawaiian, was born September 2, 1964 in Beirut, Lebanon. He is the son of , a showgirl and costume designer, and Samuel Nowlin Reeves, a geologist. Keanu's father was born in Hawaii, of British, ..."}, {"name": "Carrie Coon", "type": "Actress", "film": "Gone Girl", "desc": "Originally from Copley, OH, Carrie Coon is a Chicago-based theatre, television and film actress. She received a BA in English and Spanish from the University of Mount Union, followed by her MFA in Acting at the University of Wisconsin, Madison. Coon was nominated for a Tony Award in the Best ..."}, {"name": "Benedict Cumberbatch", "type": "Actor", "film": "The Imitation Game", "desc": "Benedict Timothy Carlton Cumberbatch was born and raised in London, England. His parents, and (born Timothy Carlton Congdon Cumberbatch), are both actors. He is a grandson of submarine commander Henry Carlton Cumberbatch, and a great-grandson of diplomat Henry Arnold ..."}, {"name": "Jessica Henwick", "type": "Actress", "film": "The Matrix Resurrections", "desc": "Jessica Yu Li Henwick is an English actress. She is best known for her roles as Nymeria Sand in the HBO series (2011), X-wing pilot Jessika Pava in Star Wars: The Force Awakens, and Colleen Wing in the Marvel Cinematic Universe, making her debut in the Netflix television series Iron..."}, {"name": "Lily Collins", "type": "Actress", "film": "The Mortal Instruments: City of Bones", "desc": "Lily Jane Collins was born in Guildford, Surrey, England. Her father is English musician , while her mother, , who is from Los Angeles, California, was president of the Beverly Hills Women's Club for three terms. Lily moved with her mother to LA at the age of five, after ..."}, {"name": "Vincent D'Onofrio", "type": "Actor", "film": "Men in Black", "desc": "Vincent Phillip D'Onofrio was born on June 30, 1959 in Brooklyn, New York, to Phyllis, a restaurant manager and server, and Gene D'Onofrio, a theatre production assistant and interior designer. He is of Italian descent and has two older sisters. He studied at the Actors Studio and the American ..."}, {"name": "Kelsey Asbille", "type": "Actress", "film": "Fargo", "desc": "Kelsey Asbille Chow is the oldest of three siblings, a younger brother and younger sister. At a young age she studied dance, and grew to love performing. School plays led to community theater, then she was member of the Hammond Select Ensemble, which she has performed with in Italy and other places..."}, {"name": "Courtney Eaton", "type": "Actress", "film": "Mad Max: Fury Road", "desc": "Courtney Eaton is an Australian Actress and Model. She is known for her supporting roles as Cheedo the Fragile in the 2015 film Mad Max: Fury Road, and as Zaya in the 2016 film Gods of Egypt. Eaton was born in Bunbury, Western Australia. She studied at Bunbury Cathedral Grammar School. Her father, ..."}, {"name": "Melissa Barrera", "type": "Actress", "film": "In the Heights", "desc": "Melissa Barrera Martinez was born in Monterrey, Nuevo León México. The first of four daughters of Rosana Maria Martinez García and Tomás Gerardo Barrera Tames. She attended the American School Foundation of Monterrey from the ages of 4 to 18 when she graduated high school. It was during her middle ..."}, {"name": "Antje Traue", "type": "Actress", "film": "Man of Steel", "desc": "With a strong body of work in her native Germany, Antje broke out into the international marketplace in Zack Snyder's Superman retelling, \"Man of Steel\" as the villainess, \"Faora\". Other credits include Renny Harlin's \"5 Days of August\", Warner Brothers' \"The Seventh Son\", Simon Curtis's \"The Woman..."}, {"name": "Bill Skarsgård", "type": "Actor", "film": "It", "desc": "Bill Skarsgård was born on August 9, 1990 in Vällingby, Sweden as Bill Istvan Günther Skarsgård. He is an actor and producer, known for (2017), (2019) and (2018)."}, {"name": "Lucy Boynton", "type": "Actress", "film": "Sing Street", "desc": "Lucy Boynton (born 17 January 1994) is an American-English actress. She made her film debut with a leading role in (2006). Boynton starred in Copperhead (2013), (2016), Murder on the Orient Express (2017) and (2018). Boynton was born in New York City and ..."}, {"name": "Hilary Duff", "type": "Actress", "film": "A Cinderella Story", "desc": "Hilary Erhard Duff was born on September 28, 1987 in Houston, Texas, to (née Cobb) and Robert Erhard Duff, a partner in convenience store chain. When Hilary was six, she had been traveling in the Cechetti Ballet with her sister but decided she wanted to fulfill her dream of ..."}, {"name": "John Leguizamo", "type": "Actor", "film": "Moulin Rouge!", "desc": "Fast-talking and feisty-looking John Leguizamo has continued to impress movie audiences with his versatility: he can play sensitive and naive young men, such as Johnny in (1991); cold-blooded killers like Benny Blanco in (1993); a heroic Army Green Beret, ..."}, {"name": "Chloe Cherry", "type": "Actress", "film": "Model Time 8", "desc": "Very cute and slim 5'7\" blonde Chloe Couture was born on August 23, 1997 in Lancaster, Pennsylvania. Chloe grew up in the Philadelphia area and lost her virginity at age sixteen. Moreover, Couture was involved in the yearbook, morning announcements, and musical productions while in grade school. ..."}, {"name": "Anna Chlumsky", "type": "Actress", "film": "My Girl", "desc": "Anna Maria Chlumsky is an American actress. She began her career as a child actress, best known playing the lead role of Vada Sultenfuss in My Girl (1991) and its 1994 sequel. Between 1999 and 2005, Chlumsky's career entered a hiatus while she attended college. She returned to acting with roles in ..."}, {"name": "Zooey Deschanel", "type": "Actress", "film": "New Girl", "desc": "Zooey Deschanel was born in 1980 into a showbiz family. Her father, , is an Academy Award-nominated cinematographer (perhaps most notably for (2004)) and her mother, (née Weir), is an actress who appeared in (1990). Her paternal ..."}, {"name": "Samantha Hanratty", "type": "Actress", "film": "Shameless", "desc": "Sammi Hanratty has been acting for more than half her life. She's had the pleasure of working with some of Hollywood's biggest names including Academy Award winning director Robert Zemeckis, Simon West, Barry Sonnenfeld, Jim Carrey, Robin Wright, Gary Oldman, Cary Elwes, Ray Liotta, Cuba Gooding Jr..."}, {"name": "Courtney Henggeler", "type": "Actress", "film": "Cobra Kai", "desc": "Courtney Henggeler is an actress, model and singer. As a child she was definitely theatrical. She took acting lessons in LA. Her first audition was for her high school's production of 'Carousel' when she was in 9th grade. She pretended to eat an apple while singing about clams. Her debut was as ..."}, {"name": "Kaya Scodelario", "type": "Actress", "film": "Pirates of the Caribbean: Dead Men Tell No Tales", "desc": "Kaya Rose Scodelario was born in Haywards Heath, Sussex, England, to Katia (Scodelario) and Roger Humphrey. Her father was English and her mother is Brazilian, of Italian and Portuguese descent. Her surname comes from her mother's Italian grandfather. Thanks to her mother, Kaya grew up fluent in ..."}, {"name": "Thomas Ian Griffith", "type": "Actor", "film": "The Karate Kid Part III", "desc": "Thomas Ian Griffith was born on March 18, 1962 in Hartford, Connecticut. His father was a college professor, his mother a dance teacher. Griffith trained as an opera singer in New York City with Metropolitan Opera star Delia Rigal. He attended the College of the Holy Cross in Worcester, ..."}, {"name": "Juliette Lewis", "type": "Actress", "film": "Natural Born Killers", "desc": "Juliette Lewis has been recognized as one of Hollywood's most talented and versatile actors of her generation since she first stunned audiences and critics alike with her Oscar-nominated performance as \"Danielle Bowden\" in (1991). To date, she has worked with some of the most revered ..."}, {"name": "Sara Ramirez", "type": "Actress", "film": "Grey's Anatomy", "desc": "Sara Ramirez was born on August 31, 1975 in Mazatlan, Sinaloa, Mexico. She is an actress and producer, known for (2005), (1998) and (2002). She has been married to since July 4, 2012."}, {"name": "Stacey Dash", "type": "Actress", "film": "Clueless", "desc": "Stacey Dash was born in the Bronx, New York. Stacy knew that she wanted to act, and from an early age began to act professionally. She made regular appearances on (1984), (1990), and also (1982). At 21 she made her feature film debut in ..."}, {"name": "Jack Quaid", "type": "Actor", "film": "The Hunger Games", "desc": "Jack Quaid was born on April 24, 1992 in Los Angeles, California, USA as Jack Henry Quaid. He is an actor and writer, known for (2012), (2022) and (2013)."}, {"name": "Julie Ann Emery", "type": "Actress", "film": "Better Call Saul", "desc": "Actress Julie Ann Emery is best known for her breakout recurring role in \"Better Call Saul,\" AMC's highly buzzed-about prequel to \"Breaking Bad.\" She can be seen as a series regular in AMC's fan favorite, \"Preacher.\" Julie Ann takes on the important role of Lara Featherstone, one of the Grail's ..."}, {"name": "Tom Hardy", "type": "Actor", "film": "Inception", "desc": "With his breakthrough performance as Eames in 's sci-fi thriller (2010), English actor Tom Hardy has been brought to the attention of mainstream audiences worldwide. However, the versatile actor has been steadily working on both stage and screen since his television debut..."}, {"name": "Rebecca Ferguson", "type": "Actress", "film": "The Greatest Showman", "desc": "Rebecca Ferguson was born Rebecca Louisa Ferguson Sundström in Stockholm, Sweden, and grew up in its Vasastaden district. Her father is Swedish. Her mother, Rosemary Ferguson, is British, of Scottish and Northern Irish descent, and moved to Sweden at the age of 25. Rebecca attended an ..."}, {"name": "Anya Taylor-Joy", "type": "Actress", "film": "The Queen's Gambit", "desc": "Anya-Josephine Marie Taylor-Joy (born 16 April 1996) is a British-American actress. She is best known for her roles as Beth Harmon in (2020), Thomasin in the period horror film (2015), as Casey Cooke in the horror-thriller (2016), and as ..."}, {"name": "Bob Saget", "type": "Actor", "film": "Full House", "desc": "Bob Saget was born on May 17, 1956 in Philadelphia, Pennsylvania, USA as Robert Lane Saget. He was an actor and writer, known for (1987), (2015) and (2003). He was married to and . He died on January 9, 2022..."}, {"name": "Denzel Washington", "type": "Actor", "film": "Fences", "desc": "Denzel Hayes Washington, Jr. was born on December 28, 1954 in Mount Vernon, New York. He is the middle of three children of a beautician mother, Lennis, from Georgia, and a Pentecostal minister father, Denzel Washington, Sr., from Virginia. After graduating from high school, Denzel enrolled at ..."}, {"name": "Juno Temple", "type": "Actress", "film": "Atonement", "desc": "Juno Violet Temple was born in London, England, into a showbiz family, the daughter of producer and film director . She was named 'Juno' after her parents took a visit to the Grand Canyon during pregnancy and found they were standing on a butte of Cape Final known as Juno..."}, {"name": "Adam Sandler", "type": "Actor", "film": "The Waterboy", "desc": "Adam Richard Sandler was born September 9, 1966 in Brooklyn, New York, to Judith (Levine), a teacher at a nursery school, and Stanley Alan Sandler, an electrical engineer. He is of Russian Jewish descent. At 17, he took his first step towards becoming a stand-up comedian when he spontaneously took ..."}, {"name": "Léa Seydoux", "type": "Actress", "film": "La vie d'Adèle", "desc": "French actress Léa Seydoux was born in 1985 in Paris, France, to , a philanthropist, and , a businessman. Her grandfather, , is chairman of Pathé, and her father is a great-grandson of businessman and inventor Marcel Schlumberger (her mother also ..."}, {"name": "Tom Pelphrey", "type": "Actor", "film": "Mank", "desc": "Tom was born and raised in New Jersey. He grew up in the town of Howell and attended the Fine and Performing Arts Center at Howell High school. He received a BFA in Acting from Mason Gross School of the Arts at Rutgers University where he also had the opportunity to study Shakespeare at the Globe ..."}, {"name": "Tom Cruise", "type": "Actor", "film": "Top Gun", "desc": "In 1976, if you had told fourteen-year-old Franciscan seminary student Thomas Cruise Mapother IV that one day in the not too distant future he would be Tom Cruise, one of the top 100 movie stars of all time, he would have probably grinned and told you that his ambition was to join the priesthood. ..."}, {"name": "Ben Affleck", "type": "Producer", "film": "Argo", "desc": "American actor and filmmaker Benjamin Géza Affleck-Boldt was born on August 15, 1972 in Berkeley, California, and was raised in Cambridge, Massachusetts. His mother, Chris Anne (née Boldt), is a school teacher, and his father, Timothy Byers Affleck, is a social worker; the two are divorced. Ben has..."}, {"name": "Jessy Schram", "type": "Actress", "film": "Unstoppable", "desc": "Jessy Schram has been a natural performer since early childhood. At the age of 10, her \"intangible star quality\" was recognized by the Stewart Talent Agency in Chicago, which signed her as both an actress and fashion model. She immediately established herself as one of Chicago's most successful ..."}, {"name": "Dove Cameron", "type": "Actress", "film": "Liv and Maddie", "desc": "Dove Olivia Cameron was born Chloe Celeste Hosterman on January 15, 1996 in Bainbridge Island, Washington to , an acting coach & Philip Alan Hosterman, a chief executive officer/founder of Kandahar Trading Company. She's known for playing a dual role as the eponymous characters in ..."}, {"name": "Chloë Grace Moretz", "type": "Actress", "film": "Kick-Ass", "desc": "Chloë Grace Moretz was born in Atlanta, Georgia, to Teri (Duke), a nurse, and McCoy Lee Moretz, a plastic surgeon. She has four brothers, all older, including actor . Her ancestry is mostly German and English. Chloë's first two appearances were as Violet in two episodes of the ..."}, {"name": "Jessie Buckley", "type": "Actress", "film": "I'm Thinking of Ending Things", "desc": "Jessie Buckley is an Irish singer and actress, who came in second place in the BBC talent show-themed television series I'd Do Anything, and subsequently played Anne Egermann in the West End revival of Stephen Sondheim's A Little Night Music. Most recently, Buckley played Lyudmilla Ignatenko in the..."}, {"name": "Kevin Costner", "type": "Actor", "film": "The Postman", "desc": "Kevin Michael Costner was born on January 18, 1955 in Lynwood, California, the third child of , a ditch digger and ultimately an electric line servicer for Southern California Edison, and (née Tedrick), a welfare worker. His older brother, Dan, was born in 1950. A middle ..."}, {"name": "Caroline Munro", "type": "Actress", "film": "The Spy Who Loved Me", "desc": "Leggy, brunette-maned pin-up actress Caroline Munro was born in 1949 in Windsor, Berkshire, England, and lived in Rottingdean near Brighton where she attended a Roman Catholic convent school. By chance, her mother and a photographer entered her picture in a \"Face of the Year\" competition for the ..."}, {"name": "Daniel Radcliffe", "type": "Actor", "film": "Harry Potter and the Deathly Hallows: Part 2", "desc": "Daniel Jacob Radcliffe was born on July 23, 1989 in Fulham, London, England, to casting agent (née Jacobson) and literary agent . His father is from a Northern Irish Protestant background, while his mother was born in South Africa, to a Jewish family (from Lithuania, ..."}, {"name": "Sarah Parish", "type": "Actress", "film": "The Wedding Date", "desc": "Sarah Parish was born on June 7, 1968 in Yeovil, Somerset, England. She is an actress and director, known for (2005), (2006) and (2004). She has been married to since December 15, 2007. They have two children."}, {"name": "Brendan Fraser", "type": "Actor", "film": "The Mummy", "desc": "Brendan James Fraser was born in Indianapolis, Indiana, to Canadian parents Carol Mary (Genereux), a sales counselor, and Peter Fraser, a journalist and travel executive. He is of Irish, Scottish, German, Czech, and French-Canadian ancestry. As his parents frequently moved, Brendan can claim ..."}, {"name": "Harry Styles", "type": "Actor", "film": "Dunkirk", "desc": "Harry Edward Styles was born on February 1, 1994 in Bromsgrove, Worcestershire, England, the son of Anne Twist (née Selley) and Desmond \"Des\" Styles, who worked in finance. Harry made his acting debut in \"Dunkirk.\" The critically acclaimed film topped the US box office in its first weekend and was ..."}, {"name": "Kirsten Dunst", "type": "Actress", "film": "Spider-Man", "desc": "Kirsten Caroline Dunst is an American actress, who also holds German citizenship. She was born on April 30, 1982 in Point Pleasant, New Jersey, to parents Inez (née Rupprecht), who owned an art gallery, and Klaus Dunst, a medical services executive. She has a younger brother named , ..."}, {"name": "Josie Davis", "type": "Actress", "film": "Black Balsam", "desc": "A Hollywood, California native, Josie Davis is an actress, producer and writer. Davis began her career at the age of three years old, starring in numerous television commercials. She was cast as a series regular when she was just a child on the hit television show, Charles In Charge. The show was ..."}, {"name": "Tobey Maguire", "type": "Actor", "film": "Brothers", "desc": "Tobias Vincent Maguire was born in Santa Monica, California. His parents were 18 and 20, and not yet married, when he was born. His mother, Wendy (Brown), did advertising, publicity, and acting in Hollywood for years as she coached and managed Tobey. His father, Vincent Maguire, was a cook and ..."}, {"name": "Elizabeth Tulloch", "type": "Actress", "film": "The Artist", "desc": "Elizabeth \"Bitsie\" Tulloch is an American actress. She is known for her role as Juliette Silverton/Eve in the NBC television series Grimm. Tulloch was born in San Diego, California, but grew up in Spain, Uruguay, and Argentina. \"Bitsie\" is not a contraction of Tulloch's given name, Elizabeth, but an..."}, {"name": "Halsey", "type": "Soundtrack", "film": "The Huntsman: Winter's War", "desc": "Halsey was born Ashley Nicolette Frangipane on September 29, 1994 in Edison, New Jersey to Nicolette \"Nicole\" Frangipane (née Jacobs), an emergency medical technician & Christopher Michael \"Chris\" Frangipane, a car dealer. She is of Italian, Hungarian, and Irish descent on her mother's side and ..."}, {"name": "Taika Waititi", "type": "Writer", "film": "What We Do in the Shadows", "desc": "Taika Waititi, also known as Taika Cohen, hails from the Raukokore region of the East Coast of New Zealand, and is the son of Robin (Cohen), a teacher, and Taika Waititi, an artist and farmer. His father is Maori (Te-Whanau-a-Apanui), and his mother is of Ashkenazi Jewish, Irish, Scottish, and ..."}, {"name": "Brian Cox", "type": "Actor", "film": "Succession", "desc": "Brian Cox is an Emmy Award-winning Scottish actor. He was born on June 1, 1946 in Dundee, Scotland, to Mary Ann Guillerline Cox, maiden surname McCann, a spinner, and Charles McArdle Campbell Cox, a shopkeeper and butcher. His father was of Irish ancestry and his mother was of Irish and Scottish ..."}, {"name": "Kate Mara", "type": "Actress", "film": "Fantastic Four", "desc": "Kate Mara is an American actress. She starred in the Netflix political drama (2013) as Zoe Barnes and appeared in the Fox TV series (2001) as computer analyst Shari Rothenberg. She appeared in (2005), (2006), (2007), (2008), ..."}, {"name": "Katheryn Winnick", "type": "Actress", "film": "Vikings", "desc": "Canadian actress, director and producer Katheryn Winnick starred in the critically acclaimed, Emmy award-winning television series Vikings, produced by MGM and The History Channel. In addition to her lead role on Vikings, an episode directed by Winnick debuted in 2020. Entertainment Weekly declared..."}, {"name": "Jacob Elordi", "type": "Actor", "film": "The Kissing Booth", "desc": "Jacob Elordi was born on June 26, 1997 in Brisbane, Australia as Jacob Nathaniel Elordi. He is an actor known for the breakout Netflix Hit The Kissing Booth (2018), Swinging Safari (2017) and is anticipated in HBO/A24 drama series Euphoria (2019). Other titles include 2-Hearts (2019). He grew up ..."}, {"name": "Brad Pitt", "type": "Producer", "film": "Ad Astra", "desc": "An actor and producer known as much for his versatility as he is for his handsome face, Golden Globe-winner Brad Pitt's most widely recognized role may be Tyler Durden in (1999). However, his portrayals of Billy Beane in (2011), and Rusty Ryan in the remake of (..."}, {"name": "Sofia Black-D'Elia", "type": "Actress", "film": "Project Almanac", "desc": "Sofia Black-D'Elia grew up in northern New Jersey with her parents and older brother, Kyle. Her mother is of Russian Jewish descent and her father is of Italian ancestry. Prior to graduating Clifton High School, Sofia booked her first role in All My Children and discovered an affinity for acting. ..."}, {"name": "Carrie-Anne Moss", "type": "Actress", "film": "The Matrix", "desc": "Carrie-Anne Moss was born and raised in Vancouver, Canada. At age 20, after studying at the American Academy of Dramatic Arts, she moved to Europe to pursue a career in modeling. While in Spain she was cast in the TV show Dark Justice which was produced in Barcelona for its first season and Los ..."}, {"name": "Skeet Ulrich", "type": "Actor", "film": "Scream", "desc": "Skeet Ulrich was born on January 20, 1970 in Lynchburg, Virginia, USA as Bryan Ray Trout. He is an actor and director, known for (1996), (1996) and (2005). He was previously married to and ."}, {"name": "MyAnna Buring", "type": "Actress", "film": "Kill List", "desc": "MyAnna Buring was born 22 September 1979, in Sundsvall, Sweden, as MyAnna Margaretha Buring Rantapää, but grew up in the Middle East. When she turned 16, she moved to Great Britain. She attended secondary school at the American British Academy in Muscat, Oman, and graduated from the London Academy ..."}, {"name": "Ricky Gervais", "type": "Writer", "film": "The Office", "desc": "Ricky Dene Gervais was born in a suburb of Reading, Berkshire, to Eva Sophia (House) and Lawrence Raymond Gervais, who was a hod carrier and labourer. His father was born in Ontario, Canada, of French-Canadian descent, and his mother was English. He was educated at Ashmead Comprehensive School and ..."}, {"name": "Tim McGraw", "type": "Soundtrack", "film": "The Blind Side", "desc": "Three-time Grammy Award winner Tim McGraw, the son of former major league reliever , is a country music superstar who has sold over 40 million albums. Eleven of his album have debuted at No. 1 on the Billboard country album chart and he has had 21 hit No. 1 singles on the Billboard Hot ..."}, {"name": "Megan Fox", "type": "Actress", "film": "Transformers", "desc": "Megan Denise Fox was born on May 16, 1986 in Oak Ridge, Tennessee and raised in Rockwood, Tennessee to Gloria Darlene Tonachio (née Cisson), a real estate manager and Franklin Thomas Fox, a parole officer. She began her drama and dance training at age 5 and at age 10, she moved to Port St. Lucie, ..."}, {"name": "Lin-Manuel Miranda", "type": "Soundtrack", "film": "Hamilton", "desc": "Lin-Manuel Miranda wrote the first incarnation of \"In the Heights\" his sophomore year at Wesleyan University in Connecticut. Off-Broadway, \"In The Heights\" received nine Drama Desk nominations, including best music, best lyrics, and it won the award for outstanding ensemble performance; received ..."}, {"name": "Minka Kelly", "type": "Actress", "film": "The Roommate", "desc": "Minka Kelly was born in Los Angeles, California and she is the only child of former guitarist, , and , an exotic dancer and single mother, who often moved with her daughter to different communities before settling in Albuquerque, New Mexico, by the time Minka was in..."}, {"name": "Jim Carrey", "type": "Actor", "film": "Ace Ventura: Pet Detective", "desc": "Jim Carrey, Canadian-born and a U.S. citizen since 2004, is an actor and producer famous for his rubbery body movements and flexible facial expressions. The two-time Golden Globe-winner rose to fame as a cast member of the Fox sketch comedy (1990) but leading roles in ..."}, {"name": "Kenneth Branagh", "type": "Actor", "film": "Henry V", "desc": "Kenneth Charles Branagh was born on December 10, 1960, in Belfast, Northern Ireland, to parents William Branagh, a plumber and carpenter, and Frances (Harper), both born in 1930. He has two siblings, William Branagh, Jr. (born 1955) and (born 1970). When he was nine, his family ..."}, {"name": "Olivia Wilde", "type": "Actress", "film": "Tron", "desc": "Actress and activist Olivia Wilde is a modern day renaissance woman, starring in many acclaimed film productions, while simultaneously giving back to the community. She was born on March 10, 1984 in New York City. Her parents are (née Leslie Corkill Redlich) and . Her ..."}, {"name": "Emma Watson", "type": "Actress", "film": "The Perks of Being a Wallflower", "desc": "Emma Charlotte Duerre Watson was born in Paris, France, to British parents, Jacqueline Luesby and Chris Watson, both lawyers. She moved to Oxfordshire when she was five, where she attended the Dragon School. From the age of six, Emma knew that she wanted to be an actress and, for a number of years,..."}, {"name": "Margot Robbie", "type": "Actress", "film": "Suicide Squad", "desc": "Margot Elise Robbie was born on July 2, 1990 in Dalby, Queensland, Australia to Scottish parents. Her mother, , is a physiotherapist, and her father, is Doug Robbie. She comes from a family of four children, having two brothers and one sister. She graduated from Somerset College in ..."}, {"name": "Ryan Reynolds", "type": "Actor", "film": "Deadpool 2", "desc": "Ryan Rodney Reynolds was born on October 23, 1976 in Vancouver, British Columbia, Canada, the youngest of four children. His father, James Chester Reynolds, was a food wholesaler, and his mother, Tamara Lee \"Tammy\" (Stewart), worked as a retail-store saleswoman. He has Irish and Scottish ancestry. ..."}, {"name": "Sarah Snook", "type": "Actress", "film": "Predestination", "desc": "Sarah Snook was born and raised in Adelaide, South Australia. Showing promise in performing arts at a young age, Sarah was awarded a scholarship to study drama at Scotch College, Adelaide. After high school, she was accepted in to the prestigious National Institute of Dramatic Arts (NIDA) and ..."}, {"name": "Izabella Miko", "type": "Actress", "film": "Coyote Ugly", "desc": "Born in what was then Communist Poland in January 1981 to accomplished thespian parents, and , Izabella Miko could dance before she could walk. She began to pursue her dream career as a ballerina as soon as the opportunity was available to her at the age of 10. ..."}, {"name": "Geena Davis", "type": "Actress", "film": "Thelma & Louise", "desc": "As a child, Geena dreamed of being an actress. While in high school, she felt left out and had low self-esteem because, at 6 feet, she was the tallest girl in school. After high school graduation, Geena entered New England College in New Hampshire and then transferred the next year to Boston ..."}, {"name": "Cynthia Addai-Robinson", "type": "Actress", "film": "The Accountant", "desc": "Cynthia Addai-Robinson is an English-born actress. She was born in London; her mother is from Ghana and her father is an United States citizen. She moved to US when she was four, and was raised by her mother in a suburb of Washington, DC. She is a graduate of Montgomery Blair High School in Silver ..."}, {"name": "Emma Stone", "type": "Actress", "film": "La La Land", "desc": "Emily Jean \"Emma\" Stone was born on November 6, 1988 in Scottsdale, Arizona to Krista Jean Stone (née Yeager), a homemaker & Jeffrey Charles \"Jeff\" Stone, a contracting company founder and CEO. She is of Swedish, German & British Isles descent. Stone began acting as a child as a member of the ..."}, {"name": "Harold Ramis", "type": "Writer", "film": "Ghostbusters", "desc": "Born on November 21, 1944 in Chicago, Illinois, Harold Allen Ramis got his start in comedy as Playboy magazine's joke editor and reviewer. In 1969, he joined Chicago's Second City's Improvisational Theatre Troupe before moving to New York to help write and perform in \"The National Lampoon Show\" ..."}, {"name": "Gal Gadot", "type": "Actress", "film": "Wonder Woman 1984", "desc": "Gal Gadot is an Israeli actress, singer, martial artist, and model. She was born in Rosh Ha'ayin, Israel. Her parents are Irit, a teacher, and Michael, an engineer. She served in the IDF for two years, and won the Miss Israel title in 2004. Gal made her film debut in the fourth film of the Fast and ..."}, {"name": "Dakota Johnson", "type": "Actress", "film": "Fifty Shades of Grey", "desc": "Dakota Mayi Johnson is an American actress and fashion model. She was born in Austin, Texas, and is the daughter of actors and . Her maternal grandmother is actress . In 1999, she made her film debut in (1999), where she and her half-sister, ..."}, {"name": "Tanner Buchanan", "type": "Actor", "film": "Designated Survivor", "desc": "Tanner Buchanan was born on December 8, 1998 in Lima, Ohio, USA. He is an actor, known for (2016), (2019) and (2013)."}, {"name": "Robert Patrick", "type": "Actor", "film": "Terminator 2: Judgment Day", "desc": "Robert Hammond Patrick was born on November 5, 1958 in Marietta, Georgia, raised there and Boston, Mass., Dayton, Ohio, Detroit, Michigan, and Cleveland, Ohio. The eldest of five children. He attended the Bowling Green State University in Ohio, but dropped out after he took a drama course and ..."}, {"name": "Mahershala Ali", "type": "Actor", "film": "House of Cards", "desc": "Mahershala Ali is fast becoming one of the freshest and most in-demand faces in Hollywood with his extraordinarily diverse skill set and wide-ranging background in film, television, and theater. He can be seen in the independent feature film, Moonlight, as well as reprising his role in The Hunger ..."}, {"name": "Courteney Cox", "type": "Actress", "film": "Friends", "desc": "Courteney Cox was born on June 15th, 1964 in Birmingham, Alabama, into an affluent Southern family. She is the daughter of Courteney (Bass) and Richard Lewis Cox (1930-2001), a businessman. She was the baby of the family with two older sisters (Virginia and Dottie) and an older brother, Richard, Jr..."}, {"name": "Sandra Bullock", "type": "Producer", "film": "The Proposal", "desc": "Sandra Annette Bullock was born in Arlington, a Virginia suburb of Washington, D.C. Her mother, (née Helga Mathilde Meyer), was a German opera singer. Her father, John W. Bullock, was an American voice teacher, who was born in Alabama, of German descent. Sandra grew up on the road ..."}, {"name": "Julia Jones", "type": "Actress", "film": "The Twilight Saga: Eclipse", "desc": "Julia Jones was born on January 23, 1981 in Boston, Massachusetts, USA. She is an actress, known for (2010), (2016) and (2017)."}, {"name": "Marisa Tomei", "type": "Actress", "film": "My Cousin Vinny", "desc": "Marisa Tomei was born on December 4, 1964, in Brooklyn, New York, to Patricia \"Addie\" (Bianchi), a teacher of English, and Gary Tomei, a lawyer, both of Italian descent. Marisa has a brother, actor . As a child, Marisa's mother frequently corrected her speech as to eliminate her heavy ..."}, {"name": "Scarlett Johansson", "type": "Actress", "film": "Her", "desc": "Scarlett Ingrid Johansson was born on November 22, 1984 in Manhattan, New York City, New York. Her mother, is from a Jewish family from the Bronx and her father, is a Danish-born architect from Copenhagen. She has a sister, , who is also an actress, ..."}, {"name": "Rose Leslie", "type": "Actress", "film": "Honeymoon", "desc": "Rose Leslie is a Scottish actress. Her leading on screen debut was at age 21 in the television film New Town (2009). She is famous for playing Ygritte in the HBO fantasy series (2011). Leslie also appeared in the films (2012) and (2015). Leslie was ..."}, {"name": "Karen Gillan", "type": "Actress", "film": "Selfie", "desc": "Karen Sheila Gillan was born and raised in Inverness, Scotland, as the only child of Marie Paterson and husband John Gillan, who is a singer and recording artist. She developed a love for acting very early on, attending several youth theatre groups and taking part in a wide range of productions at ..."}, {"name": "Stephen Root", "type": "Actor", "film": "Office Space", "desc": "Stephen Root, one of today's most prolific character actors, is currently starring in HBO's hit series Barry, for which he received a Best Supporting Actor Emmy Nomination. Barry has been nominated for multiple Emmy's and Golden Globes, and has been renewed through season four. Stephen recently ..."}, {"name": "Mary Mouser", "type": "Actress", "film": "Alexander and the Terrible, Horrible, No Good, Very Bad Day", "desc": "Mary Mouser was born on May 9, 1996 in Pine Bluff, Arkansas, USA as Mary Matilyn Mouser. She is known for her work on (2014), (2005) and (2005)."}, {"name": "Isla Fisher", "type": "Actress", "film": "Wedding Crashers", "desc": "Isla Lang Fisher was born on February 3, 1976 in Muscat, Oman, to Scottish parents Elspeth Reid and Brian Fisher, who worked as a banker for the U.N. She spent her early childhood in Bathgate, Scotland, before moving to Perth, Australia with her family in the early 1980s. From a young age, Isla ..."}, {"name": "Jennifer Connelly", "type": "Actress", "film": "A Beautiful Mind", "desc": "Jennifer Connelly was born in the Catskill Mountains, New York, to Ilene (Schuman), a dealer of antiques, and Gerard Connelly, a clothing manufacturer. Her father had Irish and Norwegian ancestry, and her mother was from a Jewish immigrant family. Jennifer grew up in Brooklyn Heights, just across ..."}, {"name": "Jen Landon", "type": "Actress", "film": "Yellowstone", "desc": "Jen Landon was born on August 29, 1983 in Malibu, California, USA as Jennifer Rachel Landon. She is an actress, known for (2018), (2016) and (2013)."}, {"name": "Faith Hill", "type": "Actress", "film": "The Stepford Wives", "desc": "Faith Hill was born on September 21, 1967 in Jackson, Mississippi, USA as Audrey Faith Perry. She is a producer and actress, known for (2004), (2001) and (1998). She has been married to since October 6, 1996. They have three children. She ..."}, {"name": "James Nesbitt", "type": "Actor", "film": "The Hobbit: An Unexpected Journey", "desc": "James Nesbitt was born in Ballymena, County Antrim, Northern Ireland, to May, a civil servant, and James Nesbitt, a primary school headmaster. He was educated at Coleraine Academical Institution (also the school of & Brian McAlister). He originally planned to be a French teacher. It ..."}, {"name": "Tom Hanks", "type": "Producer", "film": "Cast Away", "desc": "Thomas Jeffrey Hanks was born in Concord, California, to Janet Marylyn (Frager), a hospital worker, and Amos Mefford Hanks, an itinerant cook. His mother's family, originally surnamed \"Fraga\", was entirely Portuguese, while his father was of mostly English ancestry. Tom grew up in what he has ..."}, {"name": "Ashley Jensen", "type": "Actress", "film": "Arthur Christmas", "desc": "Ashley Jensen (born on 11 August 1969) is a Scottish actress and narrator. She was nominated for an Emmy for her role on the television series (2005), on which she appeared from 2005-2007. She was also a cast member on the ABC show (2006) and the brief-lived CBS sitcom ..."}, {"name": "Jason Momoa", "type": "Actor", "film": "Aquaman", "desc": "Joseph Jason Namakaeha Momoa was born on August 1, 1979, in Honolulu, Hawaii. He is the son of Coni (Lemke), a photographer, and Joseph Momoa, a painter. His father is of Native Hawaiian and Samoan descent; and his mother, who is from Iowa, is of German, Irish, and Native American ancestry. Jason ..."}, {"name": "Lochlyn Munro", "type": "Actor", "film": "Riverdale", "desc": "Lochlyn Munro started his acting career after a serious sports injury ended his dream of playing professional hockey. A talented musician, Lochlyn turned his attention to the performing arts. While playing music in various clubs around Vancouver, British Columbia, Lochlyn studied drama and ..."}, {"name": "Taron Egerton", "type": "Actor", "film": "Kingsman: The Secret Service", "desc": "Taron Egerton is a British actor and singer, known for his roles in the British television series The Smoke, the 2014 action comedy film Kingsman: The Secret Service, and the film (2019). He has also played Edward Brittain in the 2014 drama film Testament of Youth, appeared in the 2015 ..."}, {"name": "Monica Bellucci", "type": "Actress", "film": "Malèna", "desc": "Monica Anna Maria Bellucci was born on September 30, 1964 in the Italian village of Città di Castello, Umbria, the only child of Brunella Briganti and Pasquale Bellucci. She originally pursued a career in the legal profession. While attending the University of Perugia, she modeled on the side to ..."}, {"name": "Hannah Waddingham", "type": "Actress", "film": "Ted Lasso", "desc": "Hannah Waddingham was born on 1974, in Wandsworth, London. Her family was involved in performing arts as her mother, Melodie Kelly, and both her maternal grandparents were opera singers. She is best known for her contribution to West End musical theatre, particularly her performances in the original..."}, {"name": "Nicolas Cage", "type": "Actor", "film": "Face/Off", "desc": "Nicolas Cage was born Nicolas Kim Coppola in Long Beach, California, the son of comparative literature professor (whose brother is director ) and dancer/choreographer Joy Vogelsang. He is of Italian (father) and Polish and German (mother) descent. Cage changed his..."}, {"name": "Michael C. Hall", "type": "Actor", "film": "Dexter", "desc": "Michael C. Hall was born in Raleigh, North Carolina, to Janice (Styons), a guidance counselor, and William Carlyle Hall, who worked for IBM. Michael is a graduate of NYU's Master of Fine Arts program in acting. He is known for the titular character \"Dexter\" in (2006) and as mortician \"David ..."}, {"name": "William Zabka", "type": "Actor", "film": "The Karate Kid", "desc": "William Zabka was born on October 20, 1965 in New York City, New York, USA as William Michael Zabka. He is an actor and producer, known for (1984), (2010) and (1986). He has been married to Stacie Zabka since 2008. They have two children."}, {"name": "Johnny Depp", "type": "Actor", "film": "Sweeney Todd: The Demon Barber of Fleet Street", "desc": "Johnny Depp is perhaps one of the most versatile actors of his day and age in Hollywood. He was born John Christopher Depp II in Owensboro, Kentucky, on June 9, 1963, to Betty Sue (Wells), who worked as a waitress, and John Christopher Depp, a civil engineer. Depp was raised in Florida. He dropped ..."}, {"name": "Natassia Malthe", "type": "Actress", "film": "Elektra", "desc": "Linn Natassia Malthe (born 19 January 1974) is a Norwegian model and actress. Natassia is the middle of two sisters with an older brother she recently discovered she had. She was born in Oslo, Norway, and is of half Norwegian/Chinese descent. Her mother is from Kota Kinabalu, Sabah. She is usually ..."}, {"name": "Jessica Chastain", "type": "Actress", "film": "Zero Dark Thirty", "desc": "Jessica Michelle Chastain was born in Sacramento, California, and was raised in a middle-class household in a Northern California suburb. Her mother, Jerri Chastain, is a vegan chef whose family is originally from Kansas, and her stepfather is a fireman. She discovered dance at the age of nine and ..."}, {"name": "Yvonne Strahovski", "type": "Actress", "film": "Stateless", "desc": "Yvonne Jaqueline Strzechowski was born and raised in Australia. Her parents were Polish immigrants. She attended the Santa Sabina College for her high school education. She then went on to study Performance at the University of Western Sydney's School of Contemporary Arts, graduating in 2003. ..."}, {"name": "Marsha Thomason", "type": "Actress", "film": "White Collar", "desc": "Marsha Thomason was born on January 19, 1976 in Manchester, England as Marsha Lisa Thomason. She is an actress, known for (2009), (2015) and (2004). She has been married to since April 5, 2009. They have one child."}, {"name": "Travis Fimmel", "type": "Actor", "film": "Warcraft", "desc": "Travis Fimmel was born near Echuca, Victoria, Australia, to Jennie, a recreation officer for the disabled, and Chris, a cattle farmer. He was raised on a 5500-acre farm located between Melbourne and Sydney. Until the age of seventeen, his life was spent at school and working on the family farm, ..."}, {"name": "Willa Fitzgerald", "type": "Actress", "film": "Little Women", "desc": "Willa Fitzgerald is an American actress, native of Nashville, Tennessee, United States. Fitzgerald graduated from the Harpeth Hall School, a private college-preparatory school for girls in Nashville in 2009, then got her BA in theater studies from Yale University in 2013. Her career in films ..."}, {"name": "Alicia Vikander", "type": "Actress", "film": "Ex Machina", "desc": "Alicia Vikander is a Swedish actress, dancer and producer. She was born and raised in Gothenburg, Västra Götalands län, Sweden, to , an actress of stage and screen, and Svante Vikander, a psychiatrist. Through her mother, she is one quarter Finnish, and had a maternal great aunt who moved..."}, {"name": "Rooney Mara", "type": "Actress", "film": "The Girl with the Dragon Tattoo", "desc": "Actress and philanthropist Rooney Mara was born on April 17, 1985 in Bedford, New York. She made her screen debut in the slasher film (2005), went on to have a supporting role in the independent coming-of-age drama (2009), and has since starred in the horror ..."}, {"name": "Cillian Murphy", "type": "Actor", "film": "28 Days Later...", "desc": "Striking Irish actor Cillian Murphy was born in Douglas, the oldest child of Brendan Murphy, who works for the Irish Department of Education, and a mother who is a teacher of French. He has three younger siblings. Murphy was educated at Presentation Brothers College, Cork. He went on to study law ..."}, {"name": "Priyanka Chopra Jonas", "type": "Actress", "film": "Baywatch", "desc": "Priyanka Chopra Jonas (née Chopra) was born on July 18, 1982 in Jamshedpur, India, to the family of Capt. Dr. Ashok Chopra and Dr. Madhu Chopra, both Indian Army physicians. She had a very varied upbringing. She started her education at La Martinière Girls College in Lucknow as a resident student; ..."}, {"name": "Edi Patterson", "type": "Actress", "film": "The Righteous Gemstones", "desc": "Edi grew up in Texas and lives in Los Angeles. She is a Groundlings Main Company member, and regularly performs there in improv and sketch comedy shows. She is also a member of improvisational theatre company Impro Theatre, which performs full-length, completely improvised plays. Edi likes fun and ..."}, {"name": "Barbie Ferreira", "type": "Actress", "film": "Unpregnant", "desc": "Barbara Linhares Ferreira is an American model and actress. She has earned attention and acclaim for her career as well as for being an outspoken supporter of the body positivity movement. Ferreira was born in Queens, New York, but later moved to Maywood, New Jersey and attended Hackensack High ..."}, {"name": "Jamie Dornan", "type": "Actor", "film": "The Fall", "desc": "Jamie Dornan was born on May 1, 1982 in Belfast, Northern Ireland as James Dornan. Jamie is an actor, known for (2013), (2018) and (2021). Jamie has been married to since April 27, 2013. They have three children."}, {"name": "Morena Baccarin", "type": "Actress", "film": "Deadpool", "desc": "Morena Baccarin was born in Rio de Janeiro, Brazil, to actress and journalist Fernando Baccarin. Her uncle was actor . She is of Italian as well as Lebanese and Portuguese/Brazilian descent. She moved to New York at the age of ten, when her father was transferred there. She ..."}, {"name": "Drea de Matteo", "type": "Actress", "film": "The Sopranos", "desc": "Andrea Donna de Matteo, called Drea (pronounced \"dray\"), was born on January 19, 1972 in Queens, New York, into an affluent family, the youngest of three children and the only girl. She is the daughter of Donna, a playwright and playwriting teacher at HB Studio in New York, and Albert A. De Matteo,..."}, {"name": "Danielle Macdonald", "type": "Actress", "film": "Patti Cake$", "desc": "Danielle Macdonald was born and raised in Sydney, Australia. At the age of 18, she moved to Los Angeles to pursue acting full-time. Audiences know Danielle for her breakout role as 'Patti' in Fox Searchlight's Patti Cake$ as well as the title character opposite Jennifer Aniston in Dumplin'. ..."}, {"name": "Laura Marano", "type": "Actress", "film": "The Royal Treatment", "desc": "Laura Marano started acting in the theatre when she was five years old. She has done numerous plays at the Agoura Children's Theatre, and continued her acting in many national commercials. She is now starring in the new Disney Channel pilot, (2011), where she is playing the title ..."}, {"name": "Anna Shaffer", "type": "Actress", "film": "Harry Potter and the Half-Blood Prince", "desc": "Anna Shaffer was born on March 15, 1992 in London, England. She is an actress, known for (2009), (2011) and (2010)."}, {"name": "Will Smith", "type": "Producer", "film": "The Fresh Prince of Bel-Air", "desc": "Willard Carroll \"Will\" Smith, Jr. (born September 25, 1968) is an American actor, comedian, producer, rapper, and songwriter. He has enjoyed success in television, film, and music. In April 2007, Newsweek called him \"the most powerful actor in Hollywood\". Smith has been nominated for five Golden ..."}, {"name": "Benjamin Walker", "type": "Actor", "film": "The Choice", "desc": "Benjamin Walker was born Benjamin Walker Davis in Georgia, and was raised in Cartersville, GA, the son of Jeannine (Walker), a music teacher, and Greg Davis, who worked in finance and owned a movie rental store. He has one older brother. Walker was educated at Cartersville High School in Georgia ..."}, {"name": "Paul Thomas Anderson", "type": "Director", "film": "Punch-Drunk Love", "desc": "Anderson was born in 1970. He was one of the first of the \"video store\" generation of film-makers. His father was the first man on his block to own a V.C.R., and from a very early age Anderson had an infinite number of titles available to him. While film-makers like Spielberg cut their teeth making..."}, {"name": "Mary Elizabeth Winstead", "type": "Actress", "film": "10 Cloverfield Lane", "desc": "Mary Elizabeth Winstead is an actress known for her versatile work in a variety of film and television projects. Possibly most known for her role as Ramona Flowers in (2010), she has also starred in critically acclaimed independent films such as (2012), for which..."}, {"name": "Walton Goggins", "type": "Actor", "film": "Justified", "desc": "Walton Goggins is an actor of considerable versatility and acclaim who has delivered provocative performances in a multitude of feature films and television series. He won a Critics' Choice Award for his performance in the HBO comedy series \"Vice Principals\" and landed an Emmy nomination for his ..."}, {"name": "Jasmin Savoy Brown", "type": "Actress", "film": "The Leftovers", "desc": "Jasmin Savoy Brown stars as a lead in the new Shonda Rhimes ABC drama series, 'For The People' with Britt Robertson, Wesam Keesh, and Ben Rappaport. Jasmin also recurred on the Judd Apatow Netflix series 'Love.' She is best known as \"Evie Murphy\" in the critically acclaimed HBO's drama series 'The ..."}, {"name": "Kathryn Hahn", "type": "Actress", "film": "Afternoon Delight", "desc": "Kathryn Marie Hahn was born in Westchester, Illinois, but her family then moved to Cleveland, Ohio, where she spent most of her time growing up. She is of German, Irish, and English descent. She graduated with a bachelor's degree in theater from Northwestern University. She later attended Yale, ..."}, {"name": "Clint Eastwood", "type": "Actor", "film": "Million Dollar Baby", "desc": " was born May 31, 1930 in San Francisco, the son of Clinton Eastwood Sr., a bond salesman and later manufacturing executive for Georgia-Pacific Corporation, and , a housewife turned IBM operator. He had a comfortable, middle-class upbringing in nearby Piedmont. At school ..."}, {"name": "Dwayne Johnson", "type": "Actor", "film": "Jumanji: Welcome to the Jungle", "desc": "Dwayne Douglas Johnson, also known as The Rock, was born on May 2, 1972 in Hayward, California. He is the son of (born Feagaimaleata Fitisemanu Maivia) and professional wrestler (born Wayde Douglas Bowles). His father, from Amherst, Nova Scotia, Canada, is black (of Black ..."}, {"name": "Jason Bateman", "type": "Actor", "film": "Arrested Development", "desc": "Jason Bateman is an American film and television actor, known for his role as Michael Bluth on the television sitcom (2003), as well as his role on (1986). He was born in Rye, New York. His father, , from a Utah-based family, is a film and television director..."}, {"name": "Sebastian Stan", "type": "Actor", "film": "Captain America: The Winter Soldier", "desc": "Sebastian Stan was born on August 13, 1982, in Constanta, Romania. He moved with his mother to Vienna, Austria, when he was eight, and then to New York when he was twelve. Stan studied at Rutgers Mason Gross School of the Arts and spent a year at Shakespeare's Globe Theatre in London. When he went ..."}, {"name": "Margaret Qualley", "type": "Actress", "film": "Once Upon a Time in... Hollywood", "desc": "Sarah Margaret Qualley, known as Margaret Qualley, is an American actress. Qualley was born in Montana and is the daughter of actress and former model, Paul Qualley. Margaret grew up in Asheville, North Carolina. She trained as a ballerina and at sixteen she earned an apprenticeship..."}, {"name": "Kathryn Hunter", "type": "Actress", "film": "The Tragedy of Macbeth", "desc": "Kathryn Hunter was born on April 9, 1957 in New York, USA as Kathryn Hadjipateras. She is known for her work on (2021), (2007) and (1992)."}, {"name": "Nora Arnezeder", "type": "Actress", "film": "Faubourg 36", "desc": "Nora Arnezeder was born in Paris, France, to an Austrian father and a Egyptian mother. While she was still in high-school, she studied acting, dancing and singing at the renowned drama school Cours Florent. Nora's first major role was in 2008 in Paris 36 (French: Faubourg 36), which was directed by..."}, {"name": "Hannah John-Kamen", "type": "Actress", "film": "Ant-Man and the Wasp", "desc": "Hannah Dominique E. John-Kamen is a British actress. She is known for her roles as Dutch in the Syfy television series Killjoys, Ornela in the HBO series Game of Thrones, F'Nale Zandor in Steven Spielberg's Ready Player One, and Ghost in Ant-Man and the Wasp. Hannah was born in Beverley, Yorkshire, ..."}, {"name": "Dagmara Dominczyk", "type": "Actress", "film": "The Count of Monte Cristo", "desc": "Dagmara Dominczyk was born on July 17, 1976 in Kielce, Swietokrzyskie, Poland. She is an actress, known for (2002), (2002) and (2001). She has been married to since June 18, 2005. They have two children."}, {"name": "Jon Bernthal", "type": "Actor", "film": "The Wolf of Wall Street", "desc": "Jon Bernthal was born and raised in Washington D.C., the son of Joan (Marx) and Eric Bernthal, a lawyer. His grandfather was musician Murray Bernthal. Jon went to study at The Moscow Art Theatre School, in Moscow, Russia, where he also played professional baseball in the European professional ..."}, {"name": "Kathleen Robertson", "type": "Actress", "film": "Scary Movie 2", "desc": "Kathleen Robertson was born in Hamilton, Ontario, Canada, and launched her career in nearby Toronto, in the -produced (1990) and continues to work with prolific producers. She transitioned from 's acclaimed (2002) into 's Golden ..."}, {"name": "Kim Cattrall", "type": "Actress", "film": "Sex and the City 2", "desc": "Kim Victoria Cattrall was born on August 21, 1956 in Mossley Hill, Liverpool, England to Gladys Shane (Baugh), a secretary, and Dennis Cattrall, a construction engineer. At the age of three months, her family immigrated to Canada, where a large number of her films have been made. At age 11, she ..."}, {"name": "Sophia Bush", "type": "Actress", "film": "John Tucker Must Die", "desc": "Sophia Bush has captured film and television audiences with her range of roles and diverse characters She was born on July 8, 1982, in Pasadena, California, and is an only child. Her father, , is a renowned advertising and celebrity photographer, and her mother, Maureen E. (..."}, {"name": "Rose McIver", "type": "Actress", "film": "The Lovely Bones", "desc": "Rose McIver was born in New Zealand to artist Ann \"Annie\" Coney and professional photographer John George Whitfield \"Mac\" McIver. Rose has an older brother, musician Paul McIver. McIver started appearing in commercials when she was only 2 years old. She made her film debut in the film \"The Piano\" (..."}, {"name": "Thomasin McKenzie", "type": "Actress", "film": "Leave No Trace", "desc": "Thomasin McKenzie was born on July 26, 2000 in Wellington, New Zealand as Thomasin Harcourt McKenzie. She is an actress, known for (2018), (2019) and (2021)."}, {"name": "Shohreh Aghdashloo", "type": "Actress", "film": "House of Sand and Fog", "desc": "Shohreh Aghdashloo was born Shohreh Vaziri-Tabar on May 11, 1952 in Tehran, Iran. In the 1970s at age 20, she achieved nationwide stardom in her homeland of Iran, starring in some prominent pictures such as (1977) directed by the renowned , which won critics awards at the ..."}, {"name": "Hero Fiennes Tiffin", "type": "Actor", "film": "Harry Potter and the Half-Blood Prince", "desc": "Hero Fiennes Tiffin is an English actor, known for his role as the 11-year-old Tom Marvolo Riddle in the sixth installment of the Harry Potter Films, (2009), and as Hardin Scott in the films (2019) and (2020). Hero first appeared in the..."}, {"name": "Jenna Fischer", "type": "Actress", "film": "The Office", "desc": "Jenna Fischer is best known for playing Pam Beesly on the acclaimed television show The Office, for which she received an Emmy nomination for Best Supporting Actress and two SAG Awards for Outstanding Performance by an Ensemble Comedy. She was born in Fort Wayne, Indiana, but was raised mostly in St..."}, {"name": "Natalie Portman", "type": "Actress", "film": "Black Swan", "desc": "Natalie Portman is the first person born in the 1980s to have won the Academy Award for Best Actress (for (2010)). Natalie was born Natalie Hershlag on June 9, 1981, in Jerusalem, Israel. She is the only child of Avner Hershlag, a Israeli-born doctor, and Shelley Stevens, an American-born..."}, {"name": "Matt Damon", "type": "Actor", "film": "Good Will Hunting", "desc": "Matthew Paige Damon was born on October 8, 1970, in Boston, Massachusetts, to , a stockbroker, realtor and tax preparer, and , an early childhood education professor at Lesley University. Matt has an older brother, Kyle, a sculptor. His father was of English and ..."}, {"name": "Elizabeth Olsen", "type": "Actress", "film": "Martha Marcy May Marlene", "desc": "Elizabeth Chase \"Lizzie\" Olsen (born February 16, 1989) is an American actress. She is known for her roles in the films (2011), (2012), (2014), (2015), and (2016). For her role in the critically-acclaimed ..."}, {"name": "Caitriona Balfe", "type": "Actress", "film": "Outlander", "desc": "Caitriona Balfe was born in Dublin, Ireland, and grew up in the village of Tydavnet, in County Monaghan. She started modeling at the age of 19 after she was scouted by an agent while she was collecting money for charity at a local mall. She has both walked the runway and been featured in ..."}, {"name": "Bryce Dallas Howard", "type": "Actress", "film": "Jurassic World", "desc": "Bryce Dallas Howard was born on March 2, 1981, in Los Angeles, California. She was conceived in Dallas, Texas (the reason for her middle name). Her father, , is a former actor turned Oscar-winning director. Her mother is actress and writer (née Alley). Her famous relatives ..."}, {"name": "Ridley Scott", "type": "Producer", "film": "The Martian", "desc": "Described by film producer as \"the very best eye in the business\", director Ridley Scott was born on November 30, 1937 in South Shields, Tyne and Wear (then County Durham). His father was an officer in the Royal Engineers and the family followed him as his career posted him ..."}, {"name": "Ethan Hawke", "type": "Actor", "film": "Training Day", "desc": "Ethan Green Hawke was born on November 6, 1970 in Austin, Texas, to Leslie Carole (Green), a charity worker, and James Steven Hawke, an insurance actuary. His parents were students at the University of Texas at the time but divorced when Ethan was 5 years old. His mother raised him alone for the ..."}, {"name": "Emilia Clarke", "type": "Actress", "film": "Game of Thrones", "desc": "British actress Emilia Clarke was born in London and grew up in Oxfordshire, England. Her father was a theatre sound engineer and her mother is a businesswoman. Her father was working on a theatre production of \"Show Boat\" and her mother took her along to the performance. This is when, at the age ..."}, {"name": "Bradley Cooper", "type": "Actor", "film": "A Star Is Born", "desc": "Bradley Charles Cooper was born on January 5, 1975 in Philadelphia, Pennsylvania. His mother, Gloria (Campano), is of Italian descent, and worked for a local NBC station. His father, Charles John Cooper, who was of Irish descent, was a stockbroker. Immediately after Bradley graduated from the ..."}, {"name": "Olivia Colman", "type": "Actress", "film": "The Favourite", "desc": "Olivia Colman was born on January 30, 1974 in Norwich, Norfolk, England as Sarah Caroline Olivia Colman. She is an actress and producer, known for (2018), (2011) and (2015). She has been married to since August 2001. They have three children."}, {"name": "Chris Evans", "type": "Actor", "film": "The Avengers", "desc": "Christopher Robert Evans began his acting career in typical fashion: performing in school productions and community theatre. He was born in Boston, Massachusetts, the son of Lisa (Capuano), who worked at the Concord Youth Theatre, and G. Robert Evans III, a dentist. His uncle is former U.S. ..."}, {"name": "Adam Driver", "type": "Actor", "film": "Star Wars: Episode VII - The Force Awakens", "desc": "Adam Douglas Driver was born in San Diego, California. His mother, Nancy (Needham) Wright, is a paralegal from Mishawaka, Indiana, and his father, Joe Douglas Driver, who has deep roots in the American South, is from Little Rock, Arkansas. His stepfather is a Baptist minister. His ancestry includes..."}, {"name": "James Gunn", "type": "Writer", "film": "Guardians of the Galaxy", "desc": "James Gunn was born and raised in St. Louis, Missouri, to Leota and James Francis Gunn. He is from a large Catholic family, with Irish and Czech ancestry. His father and his uncles were all lawyers. He has been writing and performing as long as he can remember. He began making 8mm films at the age ..."}, {"name": "Eric Dane", "type": "Actor", "film": "X-Men: The Last Stand", "desc": "Eric Dane was born on November 9, 1972, in San Francisco, California, the older of two brothers. His father is an architect and interior designer based in San Francisco. His mother, Leah (Cohn), was a homemaker. His ancestry includes English, German, Finnish, Russian Jewish, and Austrian Jewish, ..."}, {"name": "Daniel Craig", "type": "Actor", "film": "Casino Royale", "desc": "One of the British theatre's most famous faces, Daniel Craig, who waited tables as a struggling teenage actor with the National Youth Theatre, has gone on to star as James Bond in (2006), (2008), (2012), (2015), and (2021). He was born ..."}, {"name": "Jeremy Strong", "type": "Actor", "film": "Succession", "desc": "Film work includes Molly's Game, Detroit, The Big Short, The Judge, Selma, Parkland, Lincoln, Zero Dark Thirty. Theater work includes A Man For All Seasons on Broadway and extensive work Off Broadway. Jeremy was recipient of the Lincoln Center Theater Annenberg Fellowship. He studied at Yale, The ..."}, {"name": "Karl Urban", "type": "Actor", "film": "Star Trek", "desc": "Originally from Wellington, New Zealand, Karl Urban now lives in Auckland. Born on June 7, 1972, he is the son of a leather-goods manufacturer (who had hoped that Karl would follow in his footsteps). His first acting role was when he was 8 -- he had a line on a television series. However, he did ..."}, {"name": "Zoë Kravitz", "type": "Actress", "film": "Mad Max: Fury Road", "desc": "Zoë Isabella Kravitz, the daughter of singer/actor and actress , was born on December 1, 1988 in Los Angeles, California. She is of half African-American (from her father's mother and her mother's father) and half Ashkenazi Jewish (from her father's father and her mother's ..."}, {"name": "Kieran Culkin", "type": "Actor", "film": "Succession", "desc": "Kieran Kyle Culkin was born September 30, 1982 in New York City, New York. He is the son of , a former stage and child actor, and Patricia Brentrup. He is the brother of , , , , , and . His mother, who is from ..."}, {"name": "Emily Osment", "type": "Actress", "film": "Hannah Montana: The Movie", "desc": "Emily Jordan Osment was born on March 10, 1992 in Los Angeles. She is the younger sister of The Sixth Sense star, . Her father Eugene is also an actor of some renown. Following in their footsteps, Emily started her acting career performing in several commercials, including a radio ..."}, {"name": "Timothy Olyphant", "type": "Actor", "film": "Justified", "desc": "From Timothy Olyphant's first screen appearances, such as his two-minute bit in (1996), to \"Nicko\", whose presence at times dwarfed the island in (2009), he has been a force to be reckoned with. Born in Hawaii, Timothy David Olyphant was raised in Modesto, ..."}, {"name": "Joss Whedon", "type": "Writer", "film": "Buffy the Vampire Slayer", "desc": "Joss Whedon is the middle of five brothers - his younger brothers are and . Both his father, and his grandfather, were successful television writers. Joss' mother, Lee Stearns, was a history teacher and she also wrote novels as Lee Whedon. Whedon was ..."}, {"name": "John Krasinski", "type": "Actor", "film": "Jack Ryan", "desc": "Tall, handsome American film and television star John Krasinski is known for his role as sardonic nice guy Jim Halpert on NBC's popular TV series, (2005), for which he won a 2007 and 2008 Screen Actors Guild Award for outstanding performance by an ensemble in a comedy series. Born John ..."}, {"name": "Mandeep Dhillon", "type": "Actress", "film": "Star Wars: Episode IX - The Rise of Skywalker", "desc": "Mandeep Dhillon was born on December 21, 1990 in Letchworth, Hertfordshire, England. She is an actress, known for (2019), (2019) and (2014)."}, {"name": "Tye Sheridan", "type": "Actor", "film": "Ready Player One", "desc": "Having been named one of Variety's 10 Actors to Watch, Tye Sheridan has emerged as one of Hollywood's most sought after young talents. Most recently, he was seen in the highly anticipated science fiction film (2018) produced and directed by , playing the lead ..."}, {"name": "Laura Linney", "type": "Actress", "film": "The Big C", "desc": "Laura Leggett Linney was born in New York City on February 5, 1964, into a theatre family. Her father was prominent playwright , whose own great-grandfather was a congressman from North Carolina. Her mother, Miriam Anderson (Leggett), is a nurse. Although she did not live in her ..."}, {"name": "Sam Elliott", "type": "Actor", "film": "A Star Is Born", "desc": "Tall, thin, wiry Sam Elliott is the classic picture of the American cowboy. Elliott began his acting career on the stage and his film debut was in (1969). Although his future wife, co-starred in the film, the two did not meet until they filmed ..."}, {"name": "May Calamawy", "type": "Actress", "film": "Ramy", "desc": "May Calamawy (born October 28, 1986) is a Palestinian-Egyptian actress. She completed her undergrad in Acting at Emerson College and continued her studies at William Esper. She is known for the Hulu series Ramy, Marvel's Moon Knight for Disney+, National Geographic's The Long Road Home, CBS' FBI ..."}, {"name": "Jon Favreau", "type": "Producer", "film": "Chef", "desc": "Initially an indie film favorite, actor Jon Favreau has progressed to strong mainstream visibility into the millennium and, after nearly two decades in the business, is still enjoying character stardom as well as earning notice as a writer/producer/director. The amiable, husky-framed actor with the ..."}, {"name": "Haley Bennett", "type": "Actress", "film": "The Magnificent Seven", "desc": "A natural talent with a striking presence, Haley Bennett continues to establish herself as one of Hollywood's most dynamic actresses. Upcoming, Bennett will star opposite Austin Stowell in Carlo Mirabella-Davis's SWALLOW, on which she also serves as an executive producer. Bennett plays 'Hunter,' a ..."}, {"name": "Wes Anderson", "type": "Writer", "film": "Fantastic Mr. Fox", "desc": "Wesley Wales Anderson was born in Houston, Texas. His mother, Texas Ann (Burroughs), is an archaeologist turned real estate agent, and his father, Melver Leonard Anderson, worked in advertising and PR. He has two brothers, Eric and Mel. Anderson's parents divorced when he was a young child, an ..."}, {"name": "Ralph Macchio", "type": "Actor", "film": "The Karate Kid Part III", "desc": "Ralph George Macchio was born on November 4, 1961 in Huntington, Long Island, New York. He started out in various TV commercials in the late 1970s before appearing in the puerile comedy movie (1980), then a regular role in 1980 on the television series (1977) followed..."}, {"name": "Matthew McConaughey", "type": "Actor", "film": "Dallas Buyers Club", "desc": "American actor and producer Matthew David McConaughey was born in Uvalde, Texas. His mother, Mary Kathleen (McCabe), is a substitute school teacher originally from New Jersey. His father, James Donald McConaughey, was a Mississippi-born gas station owner who ran an oil pipe supply business. He is ..."}, {"name": "Annabelle Wallis", "type": "Actress", "film": "The Mummy", "desc": "Annabelle Wallis is an English actress best known for her roles as Jane Seymour in Showtime's period drama The Tudors, Grace Burgess in the BBC drama Peaky Blinders, and for the films Annabelle (2014), and The Mummy (2017). She was born in Oxford, but spent much of her childhood in Portugal, ..."}, {"name": "Amy Adams", "type": "Actress", "film": "Arrival", "desc": "Amy Lou Adams was born in Vicenza, Veneto, Italy, to American parents, Kathryn (Hicken) and Richard Kent Adams, a U.S. serviceman who was stationed at Caserma Ederle in Italy at the time. She was raised in a Mormon family of seven children in Castle Rock, Colorado, and has English, as well as ..."}, {"name": "Tony Cavalero", "type": "Actor", "film": "School of Rock", "desc": "Tony is a main company member of The Groundlings in Los Angeles. He is a proud graduate of the Virginia Military Institute where he learned how to be a soldier and absolutely nothing about acting. Tony is also a founding member of the long-form improvisational group Robert Downey Jr Jr, whose ..."}, {"name": "Marley Shelton", "type": "Actress", "film": "Planet Terror", "desc": "Marley Eve Shelton was born in Los Angeles, California, and grew up in Eagle Rock, CA. She is the daughter of Carol (Stromme), a teacher and singer, and , who worked as a director and producer. She has three sisters: Koren Shelton, and . Both of her ..."}, {"name": "Elodie Yung", "type": "Actress", "film": "Gods of Egypt", "desc": "Elodie Yung was born in Paris, France, of Cambodian and French descent. She grew up in Seine-saint-Denis, in Le Bourget, where she practiced karate and obtained her black belt. She graduated from University of La Sorbonne in Paris and has a law degree. She then decided to study acting at London ..."}, {"name": "Kaitlyn Dever", "type": "Actress", "film": "Booksmart", "desc": "Having been named one of Variety's 10 Actors to Watch, Kaitlyn Dever has become one of Hollywood's top emerging young actresses. Dever has showcased her versatility, appearing in movies such as Clint Eastwood's J. Edgar, James Ponsoldt's The Spectacular Now, Destin Daniel Cretton's Short Term 12, ..."}, {"name": "Selena Gomez", "type": "Actress", "film": "Spring Breakers", "desc": "Actress and singer Selena Gomez was born on July 22, 1992 in Grand Prairie, Texas. She is the daughter of and Ricardo Gomez. Her mother is of part Italian ancestry, and her father is of Mexican descent. She was named after Tejano singer , who died in 1995. Her first acting role ..."}, {"name": "Bruce Willis", "type": "Actor", "film": "Die Hard", "desc": "Actor and musician Bruce Willis is well known for playing wisecracking or hard-edged characters, often in spectacular action films. Collectively, he has appeared in films that have grossed in excess of $2.5 billion USD, placing him in the top ten stars in terms of box office receipts. Walter Bruce ..."}, {"name": "Adam McKay", "type": "Producer", "film": "Don't Look Up", "desc": "Adam McKay (born April 17, 1968) is an American screenwriter, director, comedian, and actor. McKay has a comedy partnership with Will Ferrell, with whom he co-wrote the films Anchorman, Talladega Nights, and The Other Guys. Ferrell and McKay also founded their comedy website Funny or Die through ..."}, {"name": "Karina Lombard", "type": "Actress", "film": "Legends of the Fall", "desc": "Karina Lombard is an actor, screenwriter and director. She was born in Tahiti, the youngest of five children, and raised and educated in Spain, Switzerland and Peru. She is fluent in English, Spanish, Italian, French and German. She resides in Venice, California. She is known for roles in such films..."}, {"name": "Devin Kelley", "type": "Actress", "film": "Chernobyl Diaries", "desc": "Devin Kelley was born on January 18, 1986 in St. Paul, Minnesota, USA as Devin Marie Kelley. She is an actress, known for (2012), (2016) and (2010)."}, {"name": "Gemma Arterton", "type": "Actress", "film": "Prince of Persia: The Sands of Time", "desc": "Gemma Christina Arterton was born in Gravesend, Kent, England, where she was raised. She is the daughter of Sally-Anne (Heap), a cleaner, and Barry J. Arterton, a welder. Her mother's cousin is singer-songwriter . Her parents divorced when she was age five, and Gemma subsequently lived ..."}, {"name": "Christian Bale", "type": "Actor", "film": "The Dark Knight", "desc": "Christian Charles Philip Bale was born in Pembrokeshire, Wales, UK on January 30, 1974, to English parents Jennifer \"Jenny\" (James) and . His mother was a circus performer and his father, who was born in South Africa, was a commercial pilot. The family lived in different countries ..."}, {"name": "Julie Benz", "type": "Actress", "film": "Dexter", "desc": "Julie Benz was born in Pittsburgh, Pennsylvania, USA on May 1, 1972. Julie's father is a Pittsburgh surgeon and her mother is a figure skater. The family settled in nearby Murrysville, when Julie was two, and she started ice skating at age three. She competed in the 1988 U.S. Championships in ..."}, {"name": "Robert Pattinson", "type": "Actor", "film": "Twilight", "desc": "Robert Douglas Thomas Pattinson was born May 13, 1986 in London, England, to Richard Pattinson, a car dealer importing vintage cars, and Clare Pattinson (née Charlton), who worked as a booker at a model agency. He grew up in Barnes, southwest London with two older sisters. Robert discovered his ..."}, {"name": "Mel Gibson", "type": "Actor", "film": "Braveheart", "desc": "Mel Columcille Gerard Gibson was born January 3, 1956 in Peekskill, New York, USA, as the sixth of eleven children of , a railroad brakeman, and Anne Patricia (Reilly) Gibson (who died in December of 1990). His mother was Irish, from County Longford, while his American-born father is ..."}, {"name": "Danielle Brooks", "type": "Actress", "film": "Peacemaker", "desc": "Danielle Brooks was born on September 17, 1989 in Augusta, Georgia, USA. She is an actress and producer, known for (2022), (2013) and (2021). She has been married to Dennis Gelin since January 13, 2022. They have one child."}, {"name": "Kelly Marie Tran", "type": "Actress", "film": "Raya and the Last Dragon", "desc": "Kelly Marie Tran is a American actress from San Diego who is known for voicing Raya from Raya and the Last Dragon and playing Rose Tico from the Star Wars sequel trilogy. She also voiced Dawn Betterman from The Croods: A New Age. She reprised her role of Rose in Lego Star Wars specials and Forces ..."}, {"name": "Wes Bentley", "type": "Actor", "film": "American Beauty", "desc": "Wes Bentley is an American actor who first became well-known via his role in the Oscar-winning film (1999), in which he played the soulful, artistic next-door neighbor Ricky Fitts. He also portrayed gamemaker Seneca Crane in (2012), and co-stars in (2013) as..."}, {"name": "Nicole Kidman", "type": "Actress", "film": "Moulin Rouge!", "desc": "Elegant Nicole Kidman, known as one of Hollywood's top Australian imports, was actually born in Honolulu, Hawaii, while her Australian parents were there on educational visas. Kidman is the daughter of Janelle Ann (Glenny), a nursing instructor, and Antony David Kidman, a biochemist and clinical ..."}, {"name": "Stana Katic", "type": "Actress", "film": "Castle", "desc": "Stana Katic recently finished her three season arc as the star and executive producer of Amazon's TV series Absentia. Katic's feature film work includes: CBGB, about the punk rock club in NYC; Big Sur, based on the Jack Kerouac novel; Frank Miller's film The Spirit; Robert Benton's Feast of Love; ..."}, {"name": "Jensen Ackles", "type": "Actor", "film": "Supernatural", "desc": "Jensen Ross Ackles, better known as simply Jensen Ackles, was born on March 1, 1978, in Dallas, Texas, to Donna Joan (Shaffer) and actor . He has English, German, and Scottish ancestry. Jensen grew up in Richardson, Texas, together with his older brother, Joshua, and a younger sister, ..."}, {"name": "Connie Nielsen", "type": "Actress", "film": "Gladiator", "desc": "Danish beauty Connie Nielsen consistently lights up the screen with an eclectic bevy of film roles. She was born in Frederikshavn, Denmark, to a mother who worked as an insurance clerk, and a father, Bent Nielsen, who was a bus driver. Nielsen began her acting career working alongside her mother on..."}, {"name": "Lee Pace", "type": "Actor", "film": "Guardians of the Galaxy", "desc": "One of the most versatile actors working in Hollywood today, Lee Pace has established himself as a powerful leading man, consistently delivering compelling performances in film, television, and on stage. Pace will next be seen in the highly anticipated Apple TV+ series FOUNDATION. Scheduled for a ..."}, {"name": "Jason Isaacs", "type": "Actor", "film": "Harry Potter and the Chamber of Secrets", "desc": "Jason Isaacs was born in Liverpool, the third of four children of Sheila and Eric Isaacs. His parents were both from Jewish families (from Eastern Europe). He studied law at Bristol University and graduated in 1985 with a degree in law but decided to study acting. While at Bristol University, he ..."}, {"name": "Lori Petty", "type": "Actress", "film": "Tank Girl", "desc": "After this feisty, highly offbeat actress from Chattanooga, Tennessee, broke into TV in the 1980s, she immediately set herself apart from the norm with a prime role as new owner 's female friend in the bizarre mini-movie (1987). This rather inauspicious beginning would also set ..."}, {"name": "Melissa Roxburgh", "type": "Actress", "film": "Star Trek Beyond", "desc": "Melissa Roxburgh was born on December 10, 1992 in Vancouver, British Columbia, Canada. She is an actress, known for (2016), (2012) and (2005)."}, {"name": "Chloé Zhao", "type": "Director", "film": "Nomadland", "desc": "Chloé Zhao or Zhao Ting (born March 31, 1982) is a Chinese film director, screenwriter, and producer. Her debut feature film, Songs My Brothers Taught Me (2015), premiered at Sundance Film Festival. Her second feature film, The Rider (2017), was critically acclaimed and received several accolades ..."}, {"name": "Skyler Gisondo", "type": "Actor", "film": "Vacation", "desc": "Skyler Gisondo was born on July 22, 1996 in Palm Beach County, Florida, USA. Skyler is an actor, known for (2015), (2014) and (2012)."}, {"name": "Quentin Tarantino", "type": "Writer", "film": "Reservoir Dogs", "desc": "Quentin Jerome Tarantino was born in Knoxville, Tennessee. His father, , is an Italian-American actor and musician from New York, and his mother, Connie (McHugh), is a nurse from Tennessee. Quentin moved with his mother to Torrance, California, when he was four years old. In January of..."}, {"name": "Robert Downey Jr.", "type": "Actor", "film": "Iron Man", "desc": "Robert Downey Jr. has evolved into one of the most respected actors in Hollywood. With an amazing list of credits to his name, he has managed to stay new and fresh even after over four decades in the business. Downey was born April 4, 1965 in Manhattan, New York, the son of writer, director and ..."}, {"name": "Yvonne Zima", "type": "Actress", "film": "The Long Kiss Goodnight", "desc": "Yvonne Zima was born in Phillipsburg, New Jersey, to parents Dennis and Marie, and is the sister of actresses and . \"Zima\", a Polish surname, is her mother's maiden name; Yvonne's maternal grandfather was of Polish descent, while her other ancestry is Italian, German, and ..."}, {"name": "Helena Bonham Carter", "type": "Actress", "film": "Sweeney Todd: The Demon Barber of Fleet Street", "desc": "Helena Bonham Carter is an actress of great versatility, one of the UK's finest and most successful. Bonham Carter was born May 26, 1966 in Golders Green, London, England, the youngest of three children of Elena (née Propper de Callejón), a psychotherapist, and Raymond Bonham Carter, a merchant ..."}, {"name": "Elle Fanning", "type": "Actress", "film": "Super 8", "desc": "Mary Elle Fanning was born on the 9th of April 1998 in Conyers, Georgia, USA, to Heather Joy (Arrington) and Steven J. Fanning. Her mother played professional tennis, and her father, now an electronics salesman, played minor league baseball. She is of German, Irish, English, French, and Channel ..."}, {"name": "Jared Leto", "type": "Actor", "film": "Dallas Buyers Club", "desc": "Jared Leto is a very familiar face in recent film history. Although he has always been the lead vocals, rhythm guitar, and songwriter for American band , Leto is an accomplished actor merited by the numerous, challenging projects he has taken in his life. He is known to be ..."}, {"name": "Awkwafina", "type": "Actress", "film": "Ocean's Eight", "desc": "Nora Lum, known professionally as Awkwafina, is an American actress and rapper. She has played supporting roles in the comedy films Ocean's 8 and Crazy Rich Asians (2018), and her leading role in the comedy-drama The Farewell (2019) earned her a Golden Globe Award for Best Actress nomination. She ..."}, {"name": "Alex Hassell", "type": "Actor", "film": "The Tragedy of Macbeth", "desc": "Alex Hassell was born on September 17, 1980 in Southend-on-Sea, Essex, England as Alexander Stephen Hassell. Alex is an actor, known for (2021), (2021) and (2019). Alex is married to ."}, {"name": "Charlotte Ross", "type": "Actress", "film": "NYPD Blue", "desc": "Born and raised in Winnetka, Illinois to Princeton and Harvard grads, it was expected that Charlotte Ross would follow in her parent's footsteps and continue in the field of education. However, falling in love with acting (and singing) in the tender years of her childhood, Charlotte had other plans..."}, {"name": "Parker Posey", "type": "Actress", "film": "Scream 3", "desc": "Parker Posey was born two months premature in Baltimore, Maryland, to Lynda (Patton) and Chris Posey. The family moved to Monroe, La. and then Laurel, Mississippi, where Chris became owner of Laurel's own Posey Chevrolet. Parker attended high school at R. H. Watkins High School in Laurel, and ..."}, {"name": "Alison Brie", "type": "Actress", "film": "GLOW", "desc": "Alison Brie was born in Hollywood, California, to Joanne (Brenner), who worked at a non-profit child care agency, and Charles Terry Schermerhorn, a musician and entertainment reporter. Her mother is Jewish and her father has Scottish, Dutch, English, German, and Norwegian ancestry. Brie grew up in ..."}, {"name": "Elizabeth Debicki", "type": "Actress", "film": "The Great Gatsby", "desc": "Debicki was born in Paris, to a Polish father and an Australian mother of Irish descent, who were both dancers. When she was five, the family moved to Melbourne, where she grew up with two younger siblings. She became interested in ballet at an early age and trained as a dancer until deciding to ..."}, {"name": "Emily Blunt", "type": "Actress", "film": "Edge of Tomorrow", "desc": "Emily Olivia Leah Blunt is a British actress known for her roles in (2006), (2009), (2014), and (2016), among many others. Blunt was born on February 23, 1983, in Roehampton, South West London, England, the second of ..."}, {"name": "Clancy Brown", "type": "Actor", "film": "The Shawshank Redemption", "desc": "A tall, wavy-haired US actor with a deep, resonant voice, Clancy Brown has proven himself a versatile performer with first-class contributions to theatre, feature films, television series and even animation. Clarence J. Brown III was born in 1959 in Urbana, Ohio, to Joyce Helen (Eldridge), a concert..."}, {"name": "Charlie Cox", "type": "Actor", "film": "Daredevil", "desc": "Charlie Thomas Cox was born in London, England, to Patricia C. A. (Harley) and Andrew Frederick Seaforth Cox, a publisher. He has English, Scottish, and Irish ancestry, and descends from several prominent forebears (Baronets of Agnew and Carnegie, an Earl of Findlater, and a Colonial Governor of ..."}, {"name": "Kristen Bell", "type": "Actress", "film": "Frozen", "desc": "Kristen Anne Bell (born 1980) is an American actress and singer. She was born and raised in Huntington Woods, Michigan, and is the daughter of Lorelei (Frygier), a nurse, and Tom Bell, a television news director. Her ancestry is Polish (mother) and German, English, Irish, and Scottish (father). ..."}, {"name": "Zazie Beetz", "type": "Actress", "film": "Atlanta", "desc": "Zazie Beetz (born c. 1991) is a German-American actress known for the role of Vanessa on (2016), as well as for starring in (2018), (2015), and (2020). Born in Berlin to a German father and an African-American mother, Beetz was raised in New York speaking ..."}, {"name": "Jeremy Renner", "type": "Actor", "film": "The Hurt Locker", "desc": "Jeremy Lee Renner was born in Modesto, California, the son of Valerie (Tague) and Lee Renner, who managed a bowling alley. After a tumultuous yet happy childhood with his four younger siblings, Renner graduated from Beyer High School and attended Modesto Junior College. He explored several areas of..."}, {"name": "Charlie Hunnam", "type": "Actor", "film": "Sons of Anarchy", "desc": "Charles Matthew Hunnam was born on April 10, 1980 in Newcastle, England, to Jane (Bell), a business owner, and William Hunnam, a scrap metal merchant. At 18 years of age, he made a guest appearance in popular TV series (1989). He gained fame in Britain thanks to his television role as ..."}, {"name": "Peter Sarsgaard", "type": "Actor", "film": "Shattered Glass", "desc": "Boyish-looking Peter Sarsgaard was born on March 7, 1971, at Scott Air Force Base, in Bellville, Illinois, to Judy Lea (Reinhardt) and John Dale Sarsgaard, an engineer who worked for the Air Force and later Monsanto and IBM. He is a graduate of St. Louis' Washington University, where he majored in ..."}, {"name": "Alan Ritchson", "type": "Actor", "film": "Teenage Mutant Ninja Turtles", "desc": "Alan Ritchson has carved a space for himself on both the large and small screens since he made the trek from a small town in Florida to Los Angeles. Alan Michael Ritchson was born in Grand Forks, North Dakota, to Vickie (Harrell), a high school teacher, and David Ritchson, a U.S. Air Force Chief ..."}, {"name": "Anna Kendrick", "type": "Actress", "film": "Up in the Air", "desc": "Anna Kendrick was born in Portland, Maine, to Janice (Cooke), an accountant, and William Kendrick, a teacher. She has an older brother, , who has also acted. She is of English, Irish, and Scottish descent. For her role as \"Dinah\" in \"High Society\" on Broadway, Anna Kendrick was..."}, {"name": "Diane Lane", "type": "Actress", "film": "Unfaithful", "desc": "Diane Lane was born on January 22, 1965, in New York. She is the daughter of acting coach Burton Eugene \"Burt\" Lane and nightclub singer/centerfold Colleen Farrington. Her parents' families were both from the state of Georgia. Diane was acting from a very young age and made her stage debut at the ..."}, {"name": "Sofia Hublitz", "type": "Actress", "film": "Ozark", "desc": "Sofia Hublitz (born 1999) is an American actress. She appeared with Jason Bateman and Laura Linney as their daughter, in the American television series Ozark. Sofia Hublitz made her debut television appearance in 2013, where she was one of the contestants on MasterChef Junior, finishing in 8th ..."}, {"name": "Emilie Ullerup", "type": "Actress", "film": "JPod", "desc": "Emilie Ullerup-Petersen was born in Denmark, where her father Ove Ullerup-Petersen, a Jurist and Diplomat and a decorated Ambassador of Denmark in Vietnam, held the title of Lord Chamberlain for the Danish Royal Family. It was always been her ambition to become an actress. When she graduated from ..."}, {"name": "Pedro Pascal", "type": "Actor", "film": "The Mandalorian", "desc": "Pedro Pascal is a Chilean-born actor. He is best known for portraying the roles of Oberyn Martell in the fourth season of the HBO series (2011), Javier Peña in the Netflix series (2015) and the title character in the Disney + series (2019). In 2016 he starred ..."}, {"name": "Christopher Nolan", "type": "Writer", "film": "Inception", "desc": "Best known for his cerebral, often nonlinear, storytelling, acclaimed writer-director was born on July 30, 1970, in London, England. Over the course of 15 years of filmmaking, Nolan has gone from low-budget independent films to working on some of the biggest blockbusters ever made. ..."}, {"name": "Dawn Olivieri", "type": "Actress", "film": "Bright", "desc": "Dawn Olivieri was born on February 8, 1981 in St. Petersburg, Florida, USA as Dawn Orienne Olivieri. She is known for her work on (2017), (2018) and (2013)."}, {"name": "Jake Gyllenhaal", "type": "Actor", "film": "Nightcrawler", "desc": "Jacob Benjamin Gyllenhaal was born in Los Angeles, California, to producer/screenwriter (née Achs) and director . He is the brother of actress , who played his sister in (2001). His godmother is actress . His mother is from..."}, {"name": "Xolo Maridueña", "type": "Actor", "film": "Cobra Kai", "desc": "Xolo Maridueña was born in Los Angeles, California on June 9, 2001 and started acting professionally in 2011. His natural talent helped him quickly secure an agent, and he landed dozens of roles within his first year. Those included several television commercials, a recurring role on \"Parenthood\" ..."}, {"name": "Dylan Minnette", "type": "Actor", "film": "Prisoners", "desc": "Dylan Christopher Minnette was born December 29, 1996 in Evansville, Indiana, to Robyn and Craig Minnette. Scouted by an agent in Chicago, Dylan began work on commercial modeling and acting at the age of seven. He later relocated to Los Angeles, CA to continue his acting career. Dylan scored his ..."}, {"name": "Vanessa Kirby", "type": "Actress", "film": "The Crown", "desc": "Vanessa Kirby is an English stage, TV, and film actress. From 2016 to 2018, Kirby portrayed Princess Margaret in Peter Morgan's Netflix series The Crown, for which she won the BAFTA Award for Best Actress in a Supporting Role in a Television Series in 2018. She starred as Estella in the BBC ..."}, {"name": "Josephine Langford", "type": "Actress", "film": "After", "desc": "Josephine Langford was born on August 18, 1997 in Perth, Australia. She is an actress, known for (2019), (2021) and (2021)."}, {"name": "Millie Bobby Brown", "type": "Actress", "film": "Enola Holmes", "desc": "Millie Bobby Brown (born 19 February 2004) is an English actress and model. She rose to prominence for her role as Eleven in the Netflix science fiction drama series (2016), for which she earned a Primetime Emmy Award nomination for Outstanding Supporting Actress in a Drama Series ..."}, {"name": "Dakota Fanning", "type": "Actress", "film": "War of the Worlds", "desc": "Hannah Dakota Fanning was born on the 23rd of February 1994, in Conyers, Georgia, USA, to Heather Joy (Arrington) and . Her mother played professional tennis, and her father, now an electronics salesman, played minor league baseball. She is of German, Irish, English, French, and ..."}, {"name": "Gina Carano", "type": "Actress", "film": "The Mandalorian", "desc": "From pioneering women's MMA to blazing a trail in movies, GINA CARANO is one of Hollywood's most unique rising stars. Carano began her training with Muay Thai to competitive MMA, where she competed in Strikeforce and EliteXC. Her popularity led to her being called the \"Face of Women's MMA\" and she ..."}, {"name": "Ginnifer Goodwin", "type": "Actress", "film": "Big Love", "desc": "Ginnifer Goodwin was born Jennifer Michelle Goodwin on May 22, 1978, in Memphis, Tennessee, to Linda (Kantor), who worked at FedEx, and Tim Goodwin, who had a recording studio. Bright and talented, Ginnifer carried her love for theater and acting through her high school years. She graduated from ..."}, {"name": "Harry Melling", "type": "Actor", "film": "Harry Potter and the Sorcerer's Stone", "desc": "Harry Melling started acting at the age of 10 in the Harry Potter films playing the role of Dudley Dursley. In his mid-teens he joined the National Youth Theatre appearing in a number of shows including \"The Master and Margarita\". Harry at the age of 18 attended the LAMDA (London Academy Of Music and..."}, {"name": "Lucas Bravo", "type": "Actor", "film": "Mrs. Harris Goes to Paris", "desc": "Lucas Bravo was born on March 26, 1988 in Nice, France. He is an actor, known for (2022), (2020) and (2019)."}, {"name": "Linda Cardellini", "type": "Actress", "film": "Scooby-Doo", "desc": "Linda Edna Cardellini was born in Redwood City, California, to Lorraine (Hernan) and Wayne David Cardellini, a businessman. She is of Italian (from her paternal grandfather), Irish (from her mother), German, English, and Scottish descent. Linda grew up in the San Francisco Bay area, California, the..."}, {"name": "Kristen Stewart", "type": "Actress", "film": "Snow White and the Huntsman", "desc": "Though most famous for her role as Isabella \"Bella\" Swan in The (2008) Saga, Kristen Stewart has been a working actor since her early years in Los Angeles, California. Her parents, and , both work in film and television. The family includes three boys, Kristen's ..."}, {"name": "Rosario Dawson", "type": "Actress", "film": "Rent", "desc": "This stunning and resourceful actress has been primarily a film player thus far. Only recently has she been opening herself up more to doing television (the series (2008), which she executive-produced), and animated voice-overs. Dawson's powerhouse talent stands out the most in edgy..."}, {"name": "Brian Tyree Henry", "type": "Actor", "film": "Spider-Man: Into the Spider-Verse", "desc": "Emmy and Tony Award nominee Brian Tyree Henry is a versatile actor whose career spans film, television and theater. Henry originated the role of \"The General\" in the critically acclaimed Broadway musical \"The Book of Mormon,\" for which he received rave reviews. He currently stars alongside Donald ..."}, {"name": "Rachel McAdams", "type": "Actress", "film": "The Notebook", "desc": "Rachel Anne McAdams was born on November 17, 1978 in London, Ontario, Canada, to Sandra Kay (Gale), a nurse, and Lance Frederick McAdams, a truck driver and furniture mover. She is of English, Welsh, Irish, and Scottish descent. Rachel became involved with acting as a teenager and by the age of 13 ..."}, {"name": "Lana Wachowski", "type": "Writer", "film": "The Matrix", "desc": "Lana Wachowski and her sister , also known as the Wachowskis, are the duo behind such ground-breaking movies as (1999) and (2012). Born to mother Lynne, a nurse, and father Ron, a businessman of Polish descent, Wachowski grew up in Chicago and formed a tight ..."}, {"name": "Janet McTeer", "type": "Actress", "film": "Albert Nobbs", "desc": "Janet McTeer was born on August 5, 1961 in Newcastle, England, UK to parents Jean and Allan McTeer. She was raised in York from the age of 6. She attended Queen Anne Grammar School for Girls, where there was not much opportunity for drama. She became interested in acting at age 16, when she saw \"..."}, {"name": "Ashley Johnson", "type": "Actress", "film": "The Avengers", "desc": "Los Angeles-based Ashley Suzanne Johnson was born in Camarillo, California on August 9, 1983, to Clifford and . She is of Danish, Irish, Native American, Norwegian, Scottish, and Swedish descent. When she was 9 days old, her family packed up and moved to Michigan where her father (the ..."}, {"name": "Elizabeth Banks", "type": "Actress", "film": "The Hunger Games", "desc": "Elizabeth Banks was born Elizabeth Mitchell in Pittsfield, a small city in the Berkshires in western Massachusetts near the New York border, on February 10, 1974. She is the daughter of Ann (Wallace), who worked in a bank, and Mark P. Mitchell, a factory worker. Elizabeth describes herself as ..."}, {"name": "Jennifer Aniston", "type": "Actress", "film": "Friends", "desc": "Jennifer Aniston was born in Sherman Oaks, California, to actors and . Her father is Greek, and her mother was of English, Irish, Scottish, and Italian descent. Jennifer spent a year of her childhood living in Greece with her family. Her family then relocated to New York City ..."}, {"name": "Amber Heard", "type": "Actress", "film": "Aquaman", "desc": "Amber Laura Heard was born in Austin, Texas, to Patricia (née Parsons), an internet researcher, and (David Clinton Heard), a contractor. She has English, Irish, Scottish, German, and Welsh ancestry. Heard appeared in the Academy Award-nominated film, (2005), ..."}, {"name": "Nina Dobrev", "type": "Actress", "film": "The Perks of Being a Wallflower", "desc": "Nina Dobrev is a Bulgarian-born Canadian actress. Her best-known television roles are Mia Jones in (2001) and Elena Gilbert and Katherine Pierce on (2009). Her film work includes (2012), (2014), ..."}, {"name": "Rebecca Hall", "type": "Actress", "film": "Vicky Cristina Barcelona", "desc": "Rebecca Hall was born in London, England, the daughter of , a stage director and founder of the Royal Shakespeare Company, and , an opera singer. Her father was English. Her mother, who is American, is of Dutch and African-American origin. Her parents separated when she was ..."}, {"name": "Eva Habermann", "type": "Actress", "film": "Lexx", "desc": "Eva Habermann was born on January 16, 1976 in Hamburg, West Germany as Eva Felicitas Habermann. Eva is an actress and producer, known for (1996), (2019) and (2002). Eva was previously married to Hans-Ullrich Hauenstein."}, {"name": "Rachel Shenton", "type": "Actress", "film": "Switched at Birth", "desc": "Rachel Joy Shenton is a British actress and writer born in the Midlands. Shenton started her career at Edinburgh fringe festival, where her play received critical acclaim. In 2018 Shenton won the Academy Award® for Best Live Action short film, for The Silent Child that she both wrote, produced and ..."}, {"name": "Piper Perabo", "type": "Actress", "film": "Coyote Ugly", "desc": "Piper Perabo is a Golden Globe nominated film, stage and TV actor. Born in Dallas, Texas, and raised in New Jersey, she graduated summa cum Laude from Ohio University. In 2000 she was cast in a breakout role in Coyote Ugly. Since then she has been seen in such films as Christopher Nolan's \"The ..."}, {"name": "Angie Cepeda", "type": "Actress", "film": "A Night in Old Mexico", "desc": "Angélica María Cepeda Jiménez was born in Cartagena de Indias, Colombia on August 2nd 1974. Nevertheless she grew up in Barranquilla. Her parents are José Cepeda and Yadhira Jiménez (both lawyers) and after their divorce Angie went to live with her mother and two sisters, Lorna (actress) and Ivette. ..."}, {"name": "Alan Tudyk", "type": "Actor", "film": "Rogue One", "desc": "Alan Tudyk was born in El Paso, Texas, and grew up in Plano, where he attended Plano Sr. High. In 1990, he went on to study drama at Lon Morris Jr. College. While there, he was awarded the Academic Excellence Award for Drama. He was also named Most Likely to Succeed and Sophomore Beau. During this ..."}, {"name": "Willem Dafoe", "type": "Actor", "film": "Spider-Man", "desc": "Having made over one hundred films in his legendary career, Willem Dafoe is internationally respected for bringing versatility, boldness, and daring to some of the most iconic films of our time. His artistic curiosity in exploring the human condition leads him to projects all over the world, large ..."}, {"name": "Caitlin FitzGerald", "type": "Actress", "film": "The Trial of the Chicago 7", "desc": "Caitlin FitzGerald was born on August 25, 1983 in Camden, Maine, USA. She is known for her work on (2020), (2009) and (2013)."}, {"name": "Shailene Woodley", "type": "Actress", "film": "Big Little Lies", "desc": "Actress and activist Shailene Woodley was born in Simi Valley, California, to Lori (Victor), a middle school counselor, and Lonnie Woodley, a school principal. She has one brother, Tanner. She was educated at Simi Valley High School in California. When Woodley was four years old she began ..."}, {"name": "Eddie Izzard", "type": "Actress", "film": "Ocean's Thirteen", "desc": "Best-known for her surreal and digressive stand-up, British comedian and actor Eddie Izzard was born on February 7, 1962, in Aden, Yemen, where her English parents -- Dorothy Ella, a nurse and midwife, and Harold John Izzard, an accountant -- worked for British Petroleum. Izzard worked as a street ..."}, {"name": "Elisabeth Shue", "type": "Actress", "film": "Leaving Las Vegas", "desc": "Elisabeth Shue was born in Wilmington, Delaware, to Anne Brewster (Wells), who worked for the Chemical Banking Corporation, and James William Shue, a lawyer and real estate developer. She is of German and English ancestry, including descent from Mayflower passengers. Shue's parents divorced while ..."}, {"name": "Martin Kove", "type": "Actor", "film": "The Karate Kid", "desc": "Martin Kove was born on March 6, 1946 in Brooklyn, New York. Strong-featured, narrow-eyed actor who has portrayed a mixed bag of both good guys and bad guys. He first turned up on screen in several minor roles, and was noticed as the villainous Nero the Hero in the low-budget road race ..."}, {"name": "Mena Massoud", "type": "Actor", "film": "Aladdin", "desc": "Mena was born on September 17, 1991 in Cairo, Egypt & raised in Markham, Ontario, Canada. A graduate of Ryerson University's notable theater program, he got his first big break starring in ABC Spark & Teen Nick's mystery-drama television series \"Open Heart\" as \"Jared Malik.\" Since then, he has ..."}, {"name": "Lisa Bonet", "type": "Actress", "film": "Angel Heart", "desc": "Lisa Bonet was born in San Francisco, California, to Arlene Joyce (Litman), a teacher, and Allen Bonet, an opera singer. She has lived most of her life in New York and Los Angeles; in L.A., she attended Reseda High School and Celluloid Actor's Studio. Her father was African-American and her mother ..."}, {"name": "Mia Goth", "type": "Actress", "film": "Suspiria", "desc": "Mia Gypsy Mello da Silva Goth was born November 30, 1993 in Southwark, London, England, UK in Southwark, London, England to a Brazilian mother and a Canadian father. Goth moved to Brazil when she was a few weeks old and returned to Britain when she was five. She later briefly relocated to her ..."}, {"name": "Adassa", "type": "Actress", "film": "Encanto", "desc": "Adassa plays Dolores in Disney's ENcanto Golden Globe winning film and is featured on Billboards Chart Topping song \"We Don't Talk About Bruno\"and she has also featured with Award Winning Artists Snoop Dogg & Pitbull. Adassa is a bilingual Afro-Latin Colombian Singer and VO Artist that has also ..."}, {"name": "Charlize Theron", "type": "Producer", "film": "Monster", "desc": "Charlize Theron was born in Benoni, a city in the greater Johannesburg area, in South Africa, the only child of (née Maritz) and Charles Theron. She was raised on a farm outside the city. Theron is of Afrikaner (Dutch, with some French Huguenot and German) descent, and Afrikaner ..."}, {"name": "Jonathan Groff", "type": "Actor", "film": "Frozen", "desc": "Jonathan Groff was born on March 26, 1985 in Lancaster, Pennsylvania, USA as Jonathan Drew Groff. He is an actor, known for (2013), (2020) and (2021)."}, {"name": "Michael Keaton", "type": "Actor", "film": "Birdman or (The Unexpected Virtue of Ignorance)", "desc": "Quirky, inventive and handsome American actor Michael Keaton first achieved major fame with his door-busting performance as fast-talking ideas man Bill Blazejowski, alongside a nerdish morgue attendant ( ), in (1982). He played further comedic roles in (1983), ..."}, {"name": "Will Poulter", "type": "Actor", "film": "We're the Millers", "desc": "Will Poulter is an English actor, recognized for his performances as Lee Carter in (2007), Eustace Scrubb in (2010), and Kenny Rossmore in (2013). Will was born in Hammersmith, London, the son of Caroline (..."}, {"name": "Lily Rabe", "type": "Actress", "film": "Miss Stevens", "desc": "Lily Rabe was born on June 29, 1982 in New York, New York, USA. She is an actress and producer, known for (2016), (2007) and (2019)."}, {"name": "Rebel Wilson", "type": "Actress", "film": "Pitch Perfect", "desc": "Rebel Wilson was born in Sydney, Australia, to a family of dog handlers and showers. She trained at the Australian Theatre for Young People and at Second City in the US. After a successful stage and television career in Australia, this writer/actress/producer now focuses on feature film projects in..."}, {"name": "Kodi Smit-McPhee", "type": "Actor", "film": "Let Me In", "desc": "Kodi Smit-McPhee started acting at the age of 9. He dropped out of high school in his first year to pursue acting and currently resides in Los Angeles as does his father Andy McPhee and sister Sianoa Smit-McPhee, who are also actors. He made his feature film debut alongside Eric Bana in 2007's \"..."}, {"name": "Martin Donovan", "type": "Actor", "film": "Tenet", "desc": "Martin Donovan was born on August 19, 1957 in Reseda, California, USA as Martin Paul Smith. He is an actor and director, known for (2020), (2017) and (2014). He has been married to since 1984. They have two children."}, {"name": "Brian Hull", "type": "Actor", "film": "Hotel Transylvania: Transformania", "desc": "Brian Hull is a voice actor in Los Angeles. Originally from Mansfield, Texas, Brian quickly gained voice acting attention when his YouTube video, \"Disney and Pixar Sings Let it Go,\" went viral. This caught the attention of many animation studios, including the Walt Disney Studios, and he has been ..."}, {"name": "Bridget Everett", "type": "Actress", "film": "Patti Cake$", "desc": "Bridget Everett was born on April 21, 1972 in Manhattan, Kansas, USA as Bridget Jean Everett. She is an actress and producer, known for (2017), (2017) and (2008)."}, {"name": "Steve Carell", "type": "Actor", "film": "The Office", "desc": "Steve Carell, one of America's most versatile comics, was born Steven John Carell on August 16, 1962, in Concord, Massachusetts. He is the son of Harriet Theresa (Koch), a psychiatric nurse, and Edwin A. Carell, an electrical engineer. His mother was of Polish descent and his father of Italian and ..."}, {"name": "Katee Sackhoff", "type": "Actress", "film": "Battlestar Galactica", "desc": "Kathryn Ann \"Katee\" Sackhoff (born April 8, 1980) is an American actress known for playing Lieutenant Kara \"Starbuck\" Thrace on the Sci Fi Channel's television program Battlestar Galactica (2004-2009). She was nominated for four Saturn Awards for her work on Battlestar Galactica and won the award ..."}, {"name": "Birgitte Hjort Sørensen", "type": "Actress", "film": "Autómata", "desc": "Birgitte Hjort Sørensen was born on January 16, 1982 in Hillerød, Denmark. She is an actress, known for (2014), (2014) and (2015)."}, {"name": "Nicholas Hoult", "type": "Actor", "film": "Mad Max: Fury Road", "desc": "Nicholas Hoult was born on December 7, 1989 in Wokingham, Berkshire, England, UK as Nicholas Caradoc Hoult. His parents are , a piano teacher and Roger Hoult, a pilot. He has three siblings, two sisters and one brother. His great-aunt was one of the most popular actresses of her time, ..."}, {"name": "Matthew Macfadyen", "type": "Actor", "film": "Succession", "desc": "David Matthew Macfadyen was born in Great Yarmouth, Norfolk, to Meinir (Owen), a drama teacher and actress, and Martin Macfadyen, an oil executive. He is of Scottish and Welsh descent. Because of his father's career, he spent at least part of his childhood in Indonesia, before finishing his ..."}, {"name": "Elliot Page", "type": "Actor", "film": "Juno", "desc": "Elliot Page was born in Halifax, Nova Scotia to Martha Philpotts, a teacher, and Dennis Page, a graphic designer. Page wanted to start acting at an early age and attended the Neptune Theater School. They began their career at the age of 10 on the award-winning television series (1999), for..."}, {"name": "Eliza Coupe", "type": "Actress", "film": "Happy Endings", "desc": "Eliza grew up in Plymouth, New Hampshire and graduated from Plymouth Regional High School. Coupe first garnered industry attention in 2006 when her hilarious and irreverent one-woman show, The Patriots, performed at UCB/NYC, was selected for HBO's prestigious US Comedy Arts Festival in Aspen. Coupe ..."}, {"name": "David Tennant", "type": "Actor", "film": "Doctor Who", "desc": "Often considered one of Scotland's greatest actors, David Tennant was born David John McDonald in West Lothian, Scotland, to Essdale Helen (McLeod) and , who was a Presbyterian minister. He is of Scottish and Ulster-Scots descent. When he was about 3 or 4 years old, he decided to ..."}, {"name": "Leslie Grace", "type": "Actress", "film": "In the Heights", "desc": "Leslie Grace was born on January 7, 1995 in The Bronx, New York City, New York, USA. She is an actress and composer, known for (2021), (2019) and (2022)."}, {"name": "Mark Wahlberg", "type": "Producer", "film": "The Fighter", "desc": "American actor Mark Wahlberg is one of a handful of respected entertainers who successfully made the transition from teen pop idol to acclaimed actor. A Best Supporting Actor Oscar nominee for (2006) who went on to receive positive critical reviews for his performance in (..."}, {"name": "Liv Hewson", "type": "Actress", "film": "Dramaworld", "desc": "Liv Hewson is an Australian actor and playwright. Hewson uses they-and-them pronouns. Hewson was born in Canberra and grew up in the suburb of Hughes. They attended Alfred Deakin High School and Canberra College. They began acting as part of the Canberra Youth Theatre. Hewson's mother, Angela, is a..."}, {"name": "Rachael Harris", "type": "Actress", "film": "The Hangover", "desc": "Rachael Harris was born in Worthington, Ohio, where she spend most of her early life. In 1986, she graduated from Worthington High School. She then attended Otterbein College, a liberal arts college located in Westerville, Ohio. She graduated in 1989, with a Bachelor of Fine Arts. Harris joined the ..."}, {"name": "Evangeline Lilly", "type": "Actress", "film": "Ant-Man", "desc": "Evangeline Lilly, born in Fort Saskatchewan, Alberta, in 1979, was discovered on the streets of Kelowna, British Columbia, by the famous Ford modeling agency. Although she initially decided to pass on a modeling career, she went ahead and signed with Ford anyway, to help pay for her University of ..."}, {"name": "George Clooney", "type": "Actor", "film": "Michael Clayton", "desc": "George Timothy Clooney was born on May 6, 1961, in Lexington, Kentucky, to Nina Bruce (née Warren), a former beauty pageant queen, and , a former anchorman and television host (who was also the brother of singer ). He has English, German and Irish ancestry. Clooney spent..."}, {"name": "Yan-Kay Crystal Lowe", "type": "Actress", "film": "Final Destination 3", "desc": "Yan-Kay Crystal Lowe was born to a Chinese father and a Scottish mother on January 20th in Vancouver, British Columbia, Canada. At a young age, Crystal and her family moved to Hong Kong, where she spent a few years, becoming fluent in Cantonese. Yan-Kay Crystal Lowe started her professional acting ..."}, {"name": "Eva Green", "type": "Actress", "film": "Casino Royale", "desc": "French actress and model Eva Gaëlle Green was born on July 6, 1980, in Paris, France. Her father, , is a dentist who appeared in the 1966 film (1966). Her mother, , is an actress turned children's book writer. Eva's mother was born in Algeria, of French..."}, {"name": "Anna Torv", "type": "Actress", "film": "Fringe", "desc": "Anna Torv (born 7 June 1979) is an Australian actress known for her role as FBI agent Olivia Dunham on the Fox television series Fringe (2008-2013). Torv was born in Melbourne, Victoria, the daughter of Susan (née Carmichael) and Hans Torv, also grew up in Gold Coast, Queensland. Her father is of ..."}, {"name": "John Posey", "type": "Actor", "film": "How to Get Away with Murder", "desc": "John is a graduate of the University of Florida. He has worked extensively in television, film and stage in Los Angeles since 1986. For nearly twenty years, he has traveled throughout the country performing his critically acclaimed one-man show, Father, Son & Holy Coach, which is the tale of a ..."}, {"name": "Maggie Q", "type": "Actress", "film": "Divergent", "desc": "Margaret Denise Quigley was born in Honolulu, Hawaii, to a father of Polish and Irish descent (originally based in New York) and a Vietnamese mother. Her parents met during the Vietnam War. Maggie has two older half-siblings from her mother's previous marriage, and two older sisters. The family ..."}, {"name": "Alanna Ubach", "type": "Actress", "film": "Bombshell", "desc": "Hardly recognizable from one character to the next, Alanna González Ubach has starred in over 150 theater, film and television projects, including the Peabody Award-winning \"Men of a Certain Age\" and the Oscar-winning \"Coco\" as Mama Imelda, the family's matriarch. She was nominated for a SAG award ..."}, {"name": "Joel Kinnaman", "type": "Actor", "film": "The Killing", "desc": "Charles Joel Nordström Kinnaman, known professionally as Joel Kinnaman, is a Swedish actor. He is best known for playing the lead role in the Swedish film Easy Money a role that earned him a Guldbagge Award in the \"Best Actor\" category - and for his role as Frank Wagner in the Johan Falk film ..."}, {"name": "Frank Grillo", "type": "Actor", "film": "The Grey", "desc": "The oldest of three children, Frank Grillo was born in New York City, to an Italian-American family. He grew up in upstate New York, and got his first taste of acting in high school where he was in many plays. Frank was also a gifted athlete and his dream was to play sports professionally. Frank ..."}, {"name": "Georgina Haig", "type": "Actress", "film": "Once Upon a Time", "desc": "Georgina Haig is an Australian performer known for her extensive work across varied genres and her portrayal of iconic characters, including Queen Elsa in Once Upon a Time, Paula Yates in INXS: Never Tear Us Apart and Olivia Cotterill in Secret Bridesmaids Business. After graduating from the ..."}, {"name": "Kyle Gallner", "type": "Actor", "film": "American Sniper", "desc": "Kyle Gallner was born in West Chester, Pennsylvania. He started his career by following his sister along to one of her auditions. Perhaps best know for his role as Cassidy \"Beaver\" Casablancas on the CW's lone hit series, (2004), actor Kyle Gallner had been appearing in films and on ..."}, {"name": "Nicholas Braun", "type": "Actor", "film": "Succession", "desc": "Nicholas was born in Bethpage, New York. His parents are actor and Elizabeth Lyle. He made his debut in Disney productions such as (2005) and (2009). He also had a recurring role as Cameron in ABC Family's 2009-2010 series ..."}, {"name": "Rachel Zegler", "type": "Actress", "film": "West Side Story", "desc": "Rachel Zegler is a singer and songwriter, raised in New Jersey by her American father and Colombian mother. Having been one of 30,000 people to audition, she was selected to play the role of Maria in 's remake of the classic (2021), opposite as Tony. She..."}, {"name": "Kate Winslet", "type": "Actress", "film": "Titanic", "desc": "Ask Kate Winslet what she likes about any of her characters, and the word \"ballsy\" is bound to pop up at least once. The British actress has made a point of eschewing straightforward pretty-girl parts in favor of more devilish damsels; as a result, she's built an eclectic resume that runs the gamut..."}, {"name": "Jonah Hill", "type": "Actor", "film": "21 Jump Street", "desc": "Jonah Hill was born and raised in Los Angeles, the son of (née Chalkin), a fashion designer and costume stylist, and , a tour accountant for . He is the brother of music manager and actress . He graduated from ..."}, {"name": "Paul Rudd", "type": "Actor", "film": "Ant-Man", "desc": "Paul Stephen Rudd was born in Passaic, New Jersey. His parents, Michael and Gloria, both from Jewish families, were born in the London area, U.K. He has one sister, who is three years younger than he is. Paul traveled with his family during his early years, because of his father's airline job at ..."}, {"name": "Zoe Saldana", "type": "Actress", "film": "Guardians of the Galaxy", "desc": "Zoe Saldana was born on June 19, 1978 in Passaic, New Jersey, to Asalia Nazario and Aridio Saldaña. Her father was Dominican and her mother is Puerto Rican. She was raised in Queens, New York. When she was 10 years old, she and her family moved to the Dominican Republic, where they would live for ..."}, {"name": "Brie Larson", "type": "Actress", "film": "Room", "desc": "Brie Larson has built an impressive career as an acclaimed television actress, rising feature film star and emerging recording artist. A native of Sacramento, Brie started studying drama at the early age of 6, as the youngest student ever to attend the American Conservatory Theater in San Francisco..."}, {"name": "Michelle Monaghan", "type": "Actress", "film": "Gone Baby Gone", "desc": "Michelle Lynn Monaghan was born on March 23, 1976, in Winthrop, Iowa. She is the youngest of three children and the only daughter of Sharon (Hamel), who ran a day care center, and Robert L. Monaghan, a factory worker and farmer. She is of mostly Irish and German descent. After graduating from high ..."}, {"name": "Alia Shawkat", "type": "Actress", "film": "Arrested Development", "desc": "Alia Shawkat was born in Riverside, California, to and actor . Her maternal grandfather, , was also an actor. Her father is from Baghdad, Iraq, and her mother has Irish, Italian, and Norwegian ancestry. Success arrived early for Alia. Her career began at the young ..."}, {"name": "Matt Berry", "type": "Actor", "film": "Toast of London", "desc": "Matt Berry was born on May 2, 1974 in Bromham, Bedfordshire, England as Matthew Charles Berry. He is an actor and writer, known for (2012), (2006) and (2015)."}, {"name": "Bella Thorne", "type": "Actress", "film": "The Duff", "desc": "Actress and singer Annabella Avery \"Bella\" Thorne, known for (2010), (2015), (2014), and (2018), was born in Pembroke Pines, Florida, to Tamara (Beckett) and Delancey Reinaldo \"Rey\" Thorne. She has three siblings, , and , ..."}, {"name": "Julia Stiles", "type": "Actress", "film": "10 Things I Hate About You", "desc": "Lovely, slim-eyed blonde Julia (O'Hara) Stiles, of Irish, English and German heritage, was born on March 28, 1981 in New York City, the outgoing daughter and eldest of three children of a Greenwich Village artist mother, Judith Newcomb Stiles, and an elementary school teacher father, John O'Hara. ..."}, {"name": "Jamie Clayton", "type": "Actress", "film": "The L Word: Generation Q", "desc": "Jamie Clayton's big break was playing Kyla on Season Three of the hit HBO series Hung alongside Thomas Jane. After her multi-episode arc on HUNG, Jamie joined actors Mary Lynn Rajskub and Hank Harris as a lead in the Emmy winning digital series, Dirty Work, playing crime scene cleanup maven ..."}, {"name": "Trystan Gravelle", "type": "Actor", "film": "Anonymous", "desc": "Trystan Gravelle was born on May 4, 1981 in Llanelli, Carmarthenshire, Wales. He is an actor, known for (2011), (2017) and (2013)."}, {"name": "Sofia Boutella", "type": "Actress", "film": "Kingsman: The Secret Service", "desc": "Sofia Boutella is an Algerian actress, dancer and model. She was born in the Bab El Oued district of Algiers in Algeria, the daughter of composer and jazz musician , and an architect mother. She started classical dance education when she was five years old. In 1992, at age 10, she left..."}, {"name": "Keira Knightley", "type": "Actress", "film": "Pirates of the Caribbean: The Curse of the Black Pearl", "desc": "Keira Christina Knightley was born March 26, 1985 in the South West Greater London suburb of Richmond. She is the daughter of actor and actress turned playwright . An older brother, , was born in 1979. Her father is English, while her Scottish-born ..."}, {"name": "Alexander Dreymon", "type": "Actor", "film": "Christopher and His Kind", "desc": "Alexander Dreymon was born February 7, 1983 in Germany and grew up in France, Switzerland and the United States. He studied in Paris and trained three years at Drama Centre London. Dreymon worked on stage in London and Paris and made his screen debut alongside Doctor Who star Matt Smith in the ..."}, {"name": "Vanessa Hudgens", "type": "Actress", "film": "High School Musical 3: Senior Year", "desc": "Vanessa Anne Hudgens was born in Salinas, California. Her family moved to San Diego, California, while she was still a toddler. She has a younger sister, , who is also an actress. Her mother, (née Guangco), an office worker, is from the Philippines. Her father, ..."}, {"name": "Evan Peters", "type": "Actor", "film": "X-Men: Apocalypse", "desc": "Evan Peters was born in 1987 in St. Louis, Missouri to Phil and Julie Peters. When his father's job was transferred, the family moved to Grand Blanc, Michigan. There, Evan began taking acting classes and at age 15, he moved with his mother to Los Angeles in hopes of pursuing a career in the ..."}, {"name": "Daniel Day-Lewis", "type": "Actor", "film": "There Will Be Blood", "desc": "Born in London, England, Daniel Michael Blake Day-Lewis is the second child of Cecil Day-Lewis (pseudonym ), Poet Laureate of the U.K., and his second wife, actress . His maternal grandfather was Sir , an important figure in the history of British cinema and ..."}, {"name": "Lacey Chabert", "type": "Actress", "film": "Mean Girls", "desc": "Lacey Nicole Chabert was born in Purvis, Mississippi, to Julie (Johnson) and Tony Chabert, a representative for an oil company. She is of Cajun (French), Italian, English, and Scottish ancestry. Chabert started in drama and music performances in and around her hometown in Mississippi from an early ..."}, {"name": "Ralph Fiennes", "type": "Actor", "film": "The Grand Budapest Hotel", "desc": "Actor Ralph Nathaniel Twisleton-Wykeham-Fiennes was born on December 22, 1962 in Suffolk, England, to Jennifer Anne Mary Alleyne (Lash), a novelist, and Mark Fiennes, a photographer. He is the eldest of six children. Four of his siblings are also in the arts: , a director; ..."}, {"name": "Robert Rodriguez", "type": "Producer", "film": "El mariachi", "desc": "Robert Anthony Rodriguez was born and raised in San Antonio, Texas, USA, to Rebecca (Villegas), a nurse, and Cecilio G. Rodríguez, a salesman. His family is of Mexican descent. Of all the people to be amazed by the images of 's 1981 sci-fi parable, (1981), none ..."}, {"name": "Liev Schreiber", "type": "Actor", "film": "X-Men Origins: Wolverine", "desc": "Liev (pronounced Lee-ev) Schreiber was born in San Francisco. His mother, Heather (Milgram), is a painter, and his father, (Tell Carroll Schreiber III), is a theatrical actor who had a small role in (1976). His mother is from a working-class Jewish family from Poland and ..."}, {"name": "Steven Spielberg", "type": "Producer", "film": "Schindler's List", "desc": "One of the most influential personalities in the history of cinema, Steven Spielberg is Hollywood's best known director and one of the wealthiest filmmakers in the world. He has an extraordinary number of commercially successful and critically acclaimed credits to his name, either as a director, ..."}, {"name": "Guillermo del Toro", "type": "Writer", "film": "El laberinto del fauno", "desc": " was born October 9, 1964 in Guadalajara, Jalisco, Mexico. Raised by his Catholic grandmother, del Toro developed an interest in filmmaking in his early teens. Later, he learned about makeup and effects from the legendary ( (1973)) and worked on making his ..."}, {"name": "Leonie Benesch", "type": "Actress", "film": "Around the World in 80 Days", "desc": "Leonie Benesch was born on April 22, 1991. Leonie is an actress, known for (2021), (2016) and (2017)."}, {"name": "María Cecilia Botero", "type": "Actress", "film": "Encanto", "desc": "María Cecilia Botero was born on May 13, 1955 in Medellín, Colombia as María Cecilia Botero Cadavid. She is an actress, known for (2021), (2011) and (2007). She was previously married to ."}, {"name": "Andy Samberg", "type": "Actor", "film": "Saturday Night Live", "desc": "Andy Samberg was born in Berkeley, California, to Marjorie (Marrow), a teacher, and Joe Samberg, a photographer. With and , Samberg is one of three Los Angeles, California-based writer-performer-filmmakers--all childhood friends--dubbed , whose short ..."}, {"name": "Annie Potts", "type": "Actress", "film": "Ghostbusters", "desc": "Annie Potts is an American film, television, and stage actress. She is known for her roles in popular 1980s films such as (1984) and (1986). She made her debut on the big screen in 1978 in the Metro-Goldwyn-Mayer comedy film (1978), with , for ..."}, {"name": "Aaron Taylor-Johnson", "type": "Actor", "film": "Nocturnal Animals", "desc": "Aaron Taylor-Johnson is an English stage, television, and film actor. He was born Aaron Perry Johnson in High Wycombe, Buckinghamshire, to Sarah and Robert Johnson, a civil engineer. He has a sister, , who had a small role in his movie (2002). Aaron is of ..."}, {"name": "Vera Farmiga", "type": "Actress", "film": "Up in the Air", "desc": "Vera Farmiga is an American actress who has received an Academy Award nomination for her role in (2009) and Primetime Emmy Award nominations for her roles in (2013) and (2019). She was born Vera Ann Farmiga, the second of seven children, on August 6, 1973, ..."}, {"name": "Lindsay Duncan", "type": "Actress", "film": "Birdman or (The Unexpected Virtue of Ignorance)", "desc": "Lindsay Duncan was born on November 7, 1950 in Edinburgh, Scotland as Lindsay Vere Duncan. She is known for her work on (2014), (2013) and (2017). She is married to . They have one child."}, {"name": "Jennifer Love Hewitt", "type": "Actress", "film": "I Know What You Did Last Summer", "desc": "Jennifer Love Hewitt was born in Waco, Texas, to Patricia Mae (Shipp), a speech-language pathologist, and Herbert Daniel Hewitt, a medical technician. She has English, Italian, French, Scottish, and German ancestry. She got her first name from her older brother Todd Daniel Hewitt (b. November 8, ..."}, {"name": "Guy Ritchie", "type": "Director", "film": "Sherlock Holmes", "desc": "Guy Ritchie was born in Hatfield, Hertfordshire, UK on September 10, 1968. After watching (1969) as a child, Guy realized that what he wanted to do was make films. He never attended film school, saying that the work of film school graduates was boring and ..."}, {"name": "Anne Hathaway", "type": "Actress", "film": "Les Misérables", "desc": "Anne Jacqueline Hathaway was born in Brooklyn, New York, to , an actress, and , a lawyer, both originally from Philadelphia. She is of mostly Irish descent, along with English, German, and French. Her first major role came in the short-lived television series ..."}, {"name": "Logan Lerman", "type": "Actor", "film": "The Perks of Being a Wallflower", "desc": "One of today's leading talents across both independent and mainstream film, Logan Lerman is an immensely talented actor who takes on challenging roles and brings dynamic characters to life on screen. Logan was born in Beverly Hills, to a Jewish family. His parents are Lisa (Goldman), who worked as ..."}, {"name": "Shelley Fabares", "type": "Actress", "film": "The Donna Reed Show", "desc": "Vibrant, increasingly lovely teen fave Shelley Fabares withstood the test of time by transitioning successfully into adult parts unlike many of her 1960s \"teen queen\" peers who faded quickly into the memory books. She was born Michele Marie Fabares on January 19, 1944, in sunny Santa Monica, ..."}, {"name": "Gerard Butler", "type": "Actor", "film": "300", "desc": "Gerard James Butler was born in Paisley, Scotland, to Margaret and Edward Butler, a bookmaker. His family is of Irish origin. Gerard spent some of his very early childhood in Montreal, Quebec, but was mostly raised, along with his older brother and sister, in his hometown of Paisley. His parents ..."}, {"name": "Wendy Moniz", "type": "Actress", "film": "The Guardian", "desc": "Wendy Moniz, of Portuguese and Irish descent, was born in Kansas City, Missouri, USA. An American actress best known for her roles as Louisa Archer in The Guardian (2001-2004), Rachel McCabe in Nash Bridges (200-2001), and Dinah Marler in Guiding Light (1995-1999), she has been married to Frank ..."}, {"name": "Sidney Poitier", "type": "Actor", "film": "In the Heat of the Night", "desc": "Sidney Poitier was a native of Cat Island, Bahamas, although born, two months prematurely, in Miami during a visit by his parents, Evelyn (Outten) and Reginald James Poitier. He grew up in poverty as the son of farmers, with his father also driving a cab in Nassau. Sidney had little formal ..."}, {"name": "Mecia Simson", "type": "Actress", "film": "The Witcher", "desc": "Mecia Simson is an English actress known for her role as Francesca Findabair in the Netflix series The Witcher. Simson was born in a Jamaican-English family, her father from Jamaica and her mother from England. She grew up in Plymouth and went to Plymstock School during her schooling years. Simson ..."}, {"name": "Natalie Dormer", "type": "Actress", "film": "Game of Thrones", "desc": "Natalie Dormer born 11 February 1982 is an English actress. She is best known for her roles as Anne Boleyn on the Showtime series The Tudors (2007-10), as Margaery Tyrell on the HBO series Game of Thrones (2012-14), Irene Adler on the CBS series Elementary (2013-15), and as Cressida in the ..."}, {"name": "Peter Mullan", "type": "Actor", "film": "The Magdalene Sisters", "desc": "He was interested in directing films at the age of 19 and he made several shorts. As he wasn't admitted to the National Film School, he decided to dedicate himself to acting, and made his debut in the theatre in 1988 before moving to cinema and television. Fame came with the parts he played in such..."}, {"name": "Jennifer Carpenter", "type": "Actress", "film": "Dexter", "desc": "Jennifer was born in Kentucky. Her mother is Catherine Mitchell and her father is Robert Carpenter. She attended St. Raphael the Archangel and then Sacred Heart Academy. During her last two years of high school, she studied drama at the Walden Theatre in Louisville, Kentucky. She then trained at the ..."}, {"name": "Lucy Hale", "type": "Actress", "film": "Truth or Dare", "desc": "Lucy Hale is an American actress, singer and producer. She has captured the attention of millions through her dynamic on-screen performances in some of the most buzzed about projects in film and television. In 2021 Hale begins shooting the AMC series \"Ragdoll.\" Past television credits include the ..."}, {"name": "Graham McTavish", "type": "Actor", "film": "The Hobbit: An Unexpected Journey", "desc": "Graham McTavish is a Scottish television and film actor, best known for his roles as Dougal Mackenzie in the popular TV series \"Outlander\" (2014-16), as Dwalin in the \"The Hobbit\" trilogy for Peter Jackson (2012-14) as well as the Saint of Killers in AMC's series \"Preacher\", based on Garth Ennis ..."}, {"name": "Jason Statham", "type": "Actor", "film": "Crank", "desc": "Jason Statham was born in Shirebrook, Derbyshire, to Eileen (Yates), a dancer, and Barry Statham, a street merchant and lounge singer. He was a Diver on the British National Diving Team and finished twelfth in the World Championships in 1992. He has also been a fashion model, black market salesman ..."}, {"name": "Gary Oldman", "type": "Actor", "film": "The Dark Knight", "desc": "Gary Oldman is a talented English movie star and character actor, renowned for his expressive acting style. One of the most celebrated thespians of his generation, with a diverse career encompassing theatre, film and television, he is known for his roles as in (1986), ..."}, {"name": "David Arquette", "type": "Actor", "film": "Never Been Kissed", "desc": "The youngest of five, David Arquette was born in Winchester, Virginia and is part of the illustrious Arquette family, whose work has spread over several generations. His parents, , an actor, and (née Nowak), an acting teacher and therapist, had 4 other children: ..."}, {"name": "Hardy Krüger", "type": "Actor", "film": "Hatari!", "desc": "At thirteen years, German-born and raised Hardy Kruger became a member of the \"Hitler Jugend\" (Hitler Youth), as did all 13-year-old boys in Germany then. The purpose of the organization was to prepare the boys for military service. At age 15, Hardy made his film debut in a German picture ( ..."}, {"name": "Gillian Anderson", "type": "Actress", "film": "The X Files", "desc": "Gillian Anderson was born in Chicago, Illinois, to Rosemary Alyce (Lane), a computer analyst, and Homer Edward Anderson III, who owned a film post-production company. Gillian started her career as a member of an amateur actor group while at high school. In 1987, her love of the theatre took her to ..."}, {"name": "Kaley Cuoco", "type": "Actress", "film": "The Big Bang Theory", "desc": "Kaley Christine Cuoco was born in Camarillo, California, to Layne Ann (Wingate) and Gary Carmine Cuoco, a realtor. She is of Italian (father) and German and English (mother) descent. A model and commercial actress from the age of 6, Cuoco's first major role was in the TV movie ..."}, {"name": "Bea Arthur", "type": "Actress", "film": "The Golden Girls", "desc": "Actress-comedienne Bea Arthur was born Bernice Frankel on May 13, 1922 in New York City to a Jewish family. She grew up in Maryland, where her parents ran a dress shop. At 12 years old, she was the tallest girl in her school at 5'9\". She earned the title of \"Wittiest Girl\" in her school, and her ..."}, {"name": "Zachary Levi", "type": "Actor", "film": "Shazam!", "desc": "The middle child between two sisters, Zachary Levi was born as Zachary Levi Pugh on September 29, 1980 in Lake Charles, Louisiana, to Susan (Hoctor) and Darrell Alton Pugh. He uses his middle name as his stage surname because his birth name, \"Pugh\", which is of Welsh origin, sounds too much like \"..."}, {"name": "Liam Neeson", "type": "Actor", "film": "Kinsey", "desc": "Liam Neeson was born on June 7, 1952 in Ballymena, Northern Ireland, to Katherine (Brown), a cook, and Bernard Neeson, a school caretaker. He was raised in a Catholic household. During his early years, Liam worked as a forklift operator for Guinness, a truck driver, an assistant architect and an ..."}, {"name": "Martin Scorsese", "type": "Director", "film": "Taxi Driver", "desc": "Martin Charles Scorsese was born on November 17, 1942 in Queens, New York City, to (née Cappa) and , who both worked in Manhattan's garment district, and whose families both came from Palermo, Sicily. He was raised in the neighborhood of Little Italy, which later ..."}, {"name": "Arielle Kebbel", "type": "Actress", "film": "John Tucker Must Die", "desc": "Arielle Kebbel is quickly emerging as one of Hollywood's most sought after talents. With her combination of raw talent and natural charm, Arielle is poised to become one of the most dynamic and versatile actresses of her generation. Kebbel plays the lead role of \"Amelia\" in the NBC series \"Lincoln\"..."}, {"name": "Michael Stuhlbarg", "type": "Actor", "film": "A Serious Man", "desc": "Michael Stewart Stuhlbarg was born in Long Beach, California. He attended UCLA, and then The Juilliard School in New York City, where he graduated with a Bachelor of Fine Arts. His other studies included time at the Vilnius Conservatory in Lithuania, the British American Drama Academy at Baliol and..."}, {"name": "Maddie Ziegler", "type": "Actress", "film": "Music", "desc": "Maddie Ziegler was born as Madison Nicole Ziegler on September 30, 2002 in Pittsburgh, Pennsylvania. Since the age of two, Maddie Ziegler has had a passion for performance. Raised in Pittsburgh, Pennsylvania, Maddie's mother Melissa enrolled her and her younger sister, , in dance ..."}, {"name": "Carla Gugino", "type": "Actress", "film": "Watchmen", "desc": "Carla Gugino was born in Sarasota, Florida, to Carl Gugino, an orthodontist. She is of Italian (father) and English-Irish (mother) ancestry. Gugino moved with her mother to Paradise, California, when Carla was just five years old. During her childhood, they moved many times within the state. But ..."}, {"name": "Claire Foy", "type": "Actress", "film": "First Man", "desc": "Claire Elizabeth Foy (born 16 April 1984) is an English actress. She studied acting at the Liverpool John Moores University and the Oxford School of Drama and made her screen debut in the pilot of the supernatural comedy series Being Human, in 2008. Following her professional stage debut at the ..."}, {"name": "Mads Mikkelsen", "type": "Actor", "film": "Hannibal", "desc": "Mads Mikkelsen's great successes parallel those achieved by the Danish film industry since the mid-1990s. He was born in Østerbro, Copenhagen, to Bente Christiansen, a nurse, and , a banker. Starting out as a low-life pusher/junkie in the 1996 success (1996), he slowly grew ..."}, {"name": "Kate Beckinsale", "type": "Actress", "film": "Underworld: Evolution", "desc": "Kate Beckinsale was born on 26 July 1973 in Hounslow, Middlesex, England, and has resided in London for most of her life. Her mother is , who has appeared in a number of British dramas and sitcoms and continues to work as an actress, predominantly in British television productions. Her ..."}, {"name": "Philippine Leroy-Beaulieu", "type": "Actress", "film": "Dix pour cent", "desc": "Philippine Leroy-Beaulieu was born on April 25, 1963 in Boulogne-Billancourt, Hauts-de-Seine, France. She is an actress, known for (2015), (2004) and (1994)."}, {"name": "Robert De Niro", "type": "Actor", "film": "Cape Fear", "desc": "One of the greatest actors of all time, Robert De Niro was born on August 17, 1943 in Manhattan, New York City, to artists Virginia (Admiral) and His paternal grandfather was of Italian descent, and his other ancestry is Irish, English, Dutch, German, and French. He was trained ..."}, {"name": "Tori Kelly", "type": "Soundtrack", "film": "Sing", "desc": "Tori Kelly was born on December 14, 1992 in Wildomar, California, USA as Victoria Loren Kelly. She is an actress and writer, known for (2016), (2021) and (2013). She has been married to André Murillo since May 19, 2018."}, {"name": "Dan Stevens", "type": "Actor", "film": "Downton Abbey", "desc": "Dan Stevens was born at Croydon in Surrey on 10th October 1982. His parents are teachers. He was educated at Tonbridge School and trained in acting at the National Youth Theatre of Great Britain. He studied English Literature at Emmanuel College, Cambridge. Whilst he was a Cambridge undergraduate, ..."}, {"name": "Sylvester Stallone", "type": "Actor", "film": "Rocky", "desc": "Sylvester Stallone is a athletically built, dark-haired American actor/screenwriter/director/producer, the movie fans worldwide have been flocking to see Stallone's films for over 40 years, making \"Sly\" one of Hollywood's biggest-ever box office draws. Sylvester Stallone was born on July 6, 1946, in..."}, {"name": "Becca Tobin", "type": "Actress", "film": "Glee", "desc": "Becca Tobin was born on January 18, 1986 in Marietta, Georgia, USA as Rebecca Melise Tobin. She is an actress and producer, known for (2009), (2017) and (2019). She has been married to Zach Martin since December 3, 2016."}, {"name": "Jo Hartley", "type": "Actress", "film": "Eddie the Eagle", "desc": "Jo Hartley was born in Oldham, Lancashire. Attended North Chadderton Comprehensive School. At the age of 11 years old, performed in 'The Sound Of Music' as Gretel. Jo got her first taste for acting. Later, she went on to join Oldham Theatre Workshop where she stayed for several years. At the age of ..."}, {"name": "Hayley Atwell", "type": "Actress", "film": "Captain America: The First Avenger", "desc": "Born in London, England, Hayley Elizabeth Atwell has dual citizenship of the United Kingdom and the United States. An only child, Hayley was named after actress . Her parents, Alison (Cain) and Grant Atwell, both motivational speakers, met at a London workshop of Dale Carnegie's ..."}, {"name": "Mika Abdalla", "type": "Actress", "film": "Sex Appeal", "desc": "Born and raised in Texas, Mikayla Sofia Abdalla is a first-generation American actress of Bulgarian, Lebanese, Greek, Italian, and German descent. She is best known for playing the lead spy, McKeyla McAlister, in the Emmy-nominated Netflix original series, Project MC2 (2015). After graduating high ..."}, {"name": "Tony Way", "type": "Actor", "film": "Edge of Tomorrow", "desc": "Tony Way was born on October 7, 1978 in Rochford, Essex, England. He is an actor and writer, known for (2014), (2011) and (2015)."}, {"name": "Tatiana Maslany", "type": "Actress", "film": "Perry Mason", "desc": "Tatiana Gabrielle Maslany was born September 22, 1985 in Regina, Saskatchewan, to Renate, a translator, and Dan, a woodworker. She graduated from Dr. Martin LeBoldus High school in 2003. She was a well respected student, and participated as often as possible in school productions. She is well known..."}, {"name": "Rachel Brosnahan", "type": "Actress", "film": "House of Cards", "desc": "Rachel Brosnahan was born in in Milwaukee, Wisconsin in 1990 and is an American actress. She is best known for her role as 'Midge' Maisel in the Amazon Prime Video series (2017) for which she has won two Golden Globes for Best Performance by an Actress in a Television ..."}, {"name": "Joel Coen", "type": "Producer", "film": "The Ballad of Buster Scruggs", "desc": "Joel Daniel Coen is an American filmmaker who regularly collaborates with his younger brother Ethan. They made Raising Arizona, Barton Fink, Fargo, The Big Lebowski, True Grit, O Brother Where Art Thou?, Burn After Reading, A Serious Man, Inside Llewyn Davis, Hail Caesar and other projects. Joel ..."}, {"name": "Javier Bardem", "type": "Actor", "film": "Skyfall", "desc": "Javier Bardem belongs to a family of actors that have been working on films since the early days of Spanish cinema. He was born in Las Palmas de Gran Canaria, Spain, to actress (María del Pilar Bardem Muñoz) and businessman José Carlos Encinas Doussinague. His maternal grandparents were..."}, {"name": "Eliza Dushku", "type": "Actress", "film": "Bring It On", "desc": "Eliza Dushku was born in Boston, Massachusetts, to Judith (Rasmussen), a political science professor, and Philip R. Dushku, a teacher and administrator. Her father is Albanian and her mother is American (of Danish, Irish, English, and German descent). She was discovered at the end of a five-month ..."}, {"name": "Lizzy Caplan", "type": "Actress", "film": "Cloverfield", "desc": "Actress Elizabeth Anne \"Lizzy\" Caplan was born in Los Angeles, California, to Barbara (Bragman), a political aide, and Richard Caplan, a lawyer. She has two older siblings, Julie and Benjamin, and was raised in a Jewish household. Her mother was a cousin of publicist . Caplan was ..."}, {"name": "April Bowlby", "type": "Actress", "film": "Doom Patrol", "desc": "April Michelle Bowlby was born on 30 July 1980 in Vallejo, California, USA. She and her family moved to Manteca, California, when she was a small child. April studied ballet, French and marine biology at Moorpark College, before deciding to pursue an acting career. She studied drama with ..."}, {"name": "Bailee Madison", "type": "Actress", "film": "Bridge to Terabithia", "desc": "This young actress has worked with a number of the industry's biggest stars in a variety of diverse and challenging roles. She won rave reviews and a Critics Choice Movie Award nomination for her powerful work on the feature film, (2009), opposite , and ..."}, {"name": "Reese Witherspoon", "type": "Producer", "film": "Wild", "desc": "Laura Jeanne Reese Witherspoon was born on March 22, 1976 in New Orleans, Louisiana to , a registered nurse & John Draper Witherspoon, a military surgeon. Reese spent the first 4 years of her life in Wiesbaden, Hesse, Germany, where her father served as a lieutenant colonel in the ..."}, {"name": "Bobby Cannavale", "type": "Actor", "film": "The Station Agent", "desc": "In both career and in real life, Bobby Cannavale tends to choose the unconventional way of doing things. In the beginning, his decisions may have cost the dark, swarthily good-looking actor some acting roles and/or good-paying parts but, in the end, his strong work ethic and sense of self, despite ..."}, {"name": "Adrianne Palicki", "type": "Actress", "film": "G.I. Joe: Retaliation", "desc": "Adrianne Palicki was born on May 6, 1983 in Toledo, Ohio, to Nancy (French) and Jeffrey Palicki. Her father is of Polish and Hungarian descent, and her mother is of English and German ancestry. Adrianne graduated from Whitmer High School. She did not take the stage in her first play until she was a..."}, {"name": "Deborah Ann Woll", "type": "Actress", "film": "True Blood", "desc": "Deborah was born in 1985, in Brooklyn, New York, from Irish and German heritage. She took acting, piano and dance classes. She went to high school at Packer Collegiate Institute and graduated from the BFA program at the USC School of Theatre at the University of Southern California. Deborah started ..."}, {"name": "Chris Hemsworth", "type": "Actor", "film": "The Avengers", "desc": "Christopher Hemsworth was born on August 11, 1983 in Melbourne, Victoria, Australia to Leonie Hemsworth (née van Os), an English teacher & Craig Hemsworth, a social-services counselor. His brothers are actors, & ; he is of Dutch (from his immigrant maternal grandfather)..."}, {"name": "Alice Eve", "type": "Actress", "film": "Before We Go", "desc": "Alice Sophia Eve was born in London, England. Her father is and her mother is , both fellow actors. She is the eldest of three children. Eve has English, Irish and Welsh ancestry. Her family moved to Los Angeles, California when she was young as her father tried to crack ..."}, {"name": "Ryan Gosling", "type": "Actor", "film": "La La Land", "desc": "Born Ryan Thomas Gosling on November 12, 1980, in London, Ontario, Canada, he is the son of Donna (Wilson), a secretary, and Thomas Ray Gosling, a traveling salesman. Ryan was the second of their two children, with an older sister, Mandi. His ancestry is French-Canadian, as well as English, ..."}, {"name": "Erin Sanders", "type": "Actress", "film": "The Call", "desc": "Erin Sanders is an actor, writer, and director who is best known for her portrayal of the iconic Quinn Pensky on Nickelodeon's Zoey 101. Following Zoey 101, Erin worked on CBS's The Young and the Restless playing Eden Baldwin, the daughter of Michael Grossman. Shortly thereafter, the creator of the ..."}, {"name": "Maggie Smith", "type": "Actress", "film": "Gosford Park", "desc": "One of the world's most famous and distinguished actresses, Dame Maggie Smith was born Margaret Natalie Smith in Essex. Her Scottish mother, Margaret (Hutton), worked as a secretary, and her English father, Nathaniel Smith, was a teacher at Oxford University. Smith has been married twice: to actor ..."}, {"name": "Rachel Weisz", "type": "Actress", "film": "The Constant Gardener", "desc": "Rachel Hannah Weisz was born on 7 March, 1970, in London, U.K., to Edith Ruth (Teich), a psychoanalyst, and George Weisz, an inventor. Her parents both came to England around 1938. Her father is a Hungarian Jewish immigrant, and her mother, from Vienna, was of Italian and Austrian Jewish heritage. ..."}, {"name": "Daniella Pineda", "type": "Actress", "film": "Jurassic World: Fallen Kingdom", "desc": "Daniella Pineda is a Mexican-American actress, writer, and comedian from Oakland, California. In January 2013 it was announced that she was cast as the witch Sophie for season 4 episode 20 of The CW's hit series The Vampire Diaries. This episode serves as a backdoor pilot for a possible spin-off ..."}, {"name": "Penelope Wilton", "type": "Actress", "film": "The Best Exotic Marigold Hotel", "desc": "Penelope Wilton was born on June 3, 1946 in Scarborough, North Yorkshire, England as Penelope Alice Wilton. She is an actress, known for (2011), (2005) and (2004). She was previously married to and ."}, {"name": "Samara Weaving", "type": "Actress", "film": "Ready or Not", "desc": "Samara Weaving was born on February 23, 1992 in Adelaide, South Australia, Australia, but spent the years after that moving around from Singapore, Fiji, Indonesia, and back to Australia with her family. During that time, she attended grade school in Jakarta, Indonesia, eventually going to Pittwater..."}, {"name": "Jean Louisa Kelly", "type": "Actress", "film": "Uncle Buck", "desc": "Jean Louisa Kelly was born in Worcester, Massachusetts. She is an actress known for Yes, Dear (2000); Uncle Buck (1989)--as John Candy's mean-spirited, rebellious niece; Mr. Holland's Opus (1995); and Ant-Man (2015). She has been married to James Pitaro since May 24, 1997. They have two children ..."}, {"name": "Nicole Ari Parker", "type": "Actress", "film": "Boogie Nights", "desc": "Nicole Ari Parker was born on October 7, 1970 in Baltimore, Maryland, USA. She is an actress and producer, known for (1997), (2000) and (1999). She has been married to since May 21, 2005. They have two children. She was previously married ..."}, {"name": "AnnaSophia Robb", "type": "Actress", "film": "Bridge to Terabithia", "desc": "Actress AnnaSophia Robb most recently starred in two of Hulu's most critically acclaimed limited series. In 2019, she co-starred opposite Patricia Arquette in THE ACT. This spring, she portrayed the flashback version of Reese Witherspoon's \"Elena Richardson\" character in LITTLE FIRES EVERYWHERE, ..."}, {"name": "Machine Gun Kelly", "type": "Actor", "film": "The Dirt", "desc": "Colson Baker is better known by his stage name Machine Gun Kelly. His stage name was given for his rapid-fire lyrical flow and is a reference to notorious criminal George \"Machine Gun Kelly\" Barnes. MGK was born in Houston, Texas and experienced multiple moves until 2005 when he and his family ..."}, {"name": "Paget Brewster", "type": "Actress", "film": "Criminal Minds", "desc": "Paget Valerie Brewster is an American actress, voice actress, and singer. She was first recognized for her recurring role as Kathy on the fourth season of the NBC sitcom Friends. Her breakthrough role came as Supervisory Special Agent Emily Prentiss on the crime drama Criminal Minds, on which she ..."}, {"name": "Jason Sudeikis", "type": "Actor", "film": "Ted Lasso", "desc": "Jason Sudeikis was born on September 18, 1975 in Fairfax, Virginia as Daniel Jason Sudeikis. His father is Daniel Joseph Sudeikis, a Vice President of a business development and his mother is Kathryn (née Wendt), a travel agent at Brennco and President of the American Society of Travel Agents. He ..."}, {"name": "Jacob Bertrand", "type": "Actor", "film": "Cobra Kai", "desc": "Jacob Bertrand was born on March 6, 2000 in the USA. Jacob is an actor and director, known for (2018), (2014) and (2018)."}, {"name": "Tawny Cypress", "type": "Actress", "film": "Inez & Doug & Kira", "desc": "Among her studies, Tawny Cypress has done stints at Boston University; Westminster Choir College in Princeton, New Jersey; and Mason Gross at Rutgers University. She is also a former student of Barbara Marchant and The William Esper Studio in New York City."}, {"name": "Milana Vayntrub", "type": "Actress", "film": "Werewolves Within", "desc": "Milana Vayntrub is an Uzbekistan-born American actress, writer and stand-up comedian. She began her career making YouTube videos amounting over 11 million views, then turned her web content into an MTV pilot. In 2016 is was recognized by Adweek on the cover of their Creative 100 issue for her ..."}, {"name": "Jamie Chung", "type": "Actress", "film": "Big Hero 6", "desc": "Jamie Chung was born and raised in California, the daughter of Korean parents. She studied Economics at the University of California, Riverside. Chung's break came in 2004, when she was working in a sports bar. MTV held auditions for (1992) there, she tried out, and was successful, ..."}, {"name": "Lucien Laviscount", "type": "Actor", "film": "The Bye Bye Man", "desc": "Lucien Laviscount was born on June 9, 1992 in Ribble Valley, Lancashire, England as Lucien Leon Laviscount. He is an actor, known for (2017), (2017) and (2005)."}], "celebrities_faces": [{"celebrity_name": "Gaspard Ulliel", "img_url": "https://m.media-amazon.com/images/M/MV5BMjM1OTkxMzczNF5BMl5BanBnXkFtZTgwNTMwMzI4MTE@._V1_UY209_CR0,0,140,209_AL_.jpg", "hash": "d782a7756397aa2b24c8f91dff8fddf6"}, {"celebrity_name": "Jennifer Holland", "img_url": "https://m.media-amazon.com/images/M/MV5BMTczYTkzMGMtYTA4Yy00NTkwLWEzY2ItMWI2ZGZjNWY5ZTlhXkEyXkFqcGdeQXVyMjA5NzIzNTg@._V1_UY209_CR4,0,140,209_AL_.jpg", "hash": "ff022775af9eb9d62ecc8e627cda6aee"}, {"celebrity_name": "Dina Shihabi", "img_url": "https://m.media-amazon.com/images/M/MV5BOWNmMzczYmYtZWQ0OS00Mzg4LWI0ZDktMmI1ZjFiODVlNTIxXkEyXkFqcGdeQXVyMzI5NjMxMzU@._V1_UY209_CR3,0,140,209_AL_.jpg", "hash": "e9426e77f4d3bfb8d9375cc7ee3276c6"}, {"celebrity_name": "Freddie Stroma", "img_url": "https://m.media-amazon.com/images/M/MV5BNzg3ZTI0NjYtN2Q4Zi00ZmY4LWFmZjgtYThmN2Q3OTNhNGQ0XkEyXkFqcGdeQXVyMTI2Nzk3NzI4._V1_UY209_CR1,0,140,209_AL_.jpg", "hash": "34a7b34885c50b68463410d5d680c7d4"}, {"celebrity_name": "Jessica Darrow", "img_url": "https://m.media-amazon.com/images/M/MV5BN2Q0ZDU1ZmItODRjZS00OTk5LWI4M2YtM2FmYWQ0NjU3ZTM1XkEyXkFqcGdeQXVyNzE4Njc3NjQ@.jpg", "hash": "126d59eafe0678161e248842a0bc24dd"}, {"celebrity_name": "Hunter Schafer", "img_url": "https://m.media-amazon.com/images/M/MV5BYTE4ZmU3NTQtMWY0OC00YmQ5LThlOTEtMTc3NjcwZjMwN2QzXkEyXkFqcGdeQXVyMDM2NDM2MQ@@.jpg", "hash": "aaafa40199d2c120bc06c0614ecafd11"}, {"celebrity_name": "Gemma Chan", "img_url": "https://m.media-amazon.com/images/M/MV5BYTI3ZDEwYjktZjVhYS00NTlhLTkwOWEtNjM1MzEyMWU5M2QyXkEyXkFqcGdeQXVyMTE3ODY2Nzk@._V1_UY209_CR2,0,140,209_AL_.jpg", "hash": "8c27939753b192e2075a76942beb2951"}, {"celebrity_name": "Barry Keoghan", "img_url": "https://m.media-amazon.com/images/M/MV5BMTcyNzEzMjY4NV5BMl5BanBnXkFtZTgwOTMzOTA5MjI@.jpg", "hash": "9f93bdffab27948777a58520d69844a1"}, {"celebrity_name": "Sydney Sweeney", "img_url": "https://m.media-amazon.com/images/M/MV5BOTVjOTkxNjMtNDJiYS00YzEzLThmZTItZjJhM2E4NWQyM2Q2XkEyXkFqcGdeQXVyNzM1NTU0NA@@._V1_UY209_CR8,0,140,209_AL_.jpg", "hash": "3e3fffb74143108ff52c2d99dfadc513"}, {"celebrity_name": "Zendaya", "img_url": "https://m.media-amazon.com/images/M/MV5BMjAxZTk4NDAtYjI3Mi00OTk3LTg0NDEtNWFlNzE5NDM5MWM1XkEyXkFqcGdeQXVyOTI3MjYwOQ@@._V1_UY209_CR8,0,140,209_AL_.jpg", "hash": "c8f50722f07d7e4194572a3dea2cf7c6"}, {"celebrity_name": "Jennifer Beals", "img_url": "https://m.media-amazon.com/images/M/MV5BMTc1MTg4MDAyN15BMl5BanBnXkFtZTcwNDgwNTExMw@@._V1_UY209_CR8,0,140,209_AL_.jpg", "hash": "7280e81dfdb0d5f10235914705c0d0cc"}, {"celebrity_name": "Melanie Lynskey", "img_url": "https://m.media-amazon.com/images/M/MV5BMjIzNDg5NTg4Nl5BMl5BanBnXkFtZTcwMTU3NjgyMw@@._V1_UY209_CR4,0,140,209_AL_.jpg", "hash": "238172a1d66c7914d8ab19b9922bad20"}, {"celebrity_name": "Julia Garner", "img_url": "https://m.media-amazon.com/images/M/MV5BNmU3NDRjMDEtNTQ2Ni00ZGZmLTk3ZjUtODUxMjA2NGY4NDg4XkEyXkFqcGdeQXVyMjQzMDM0NDU@.jpg", "hash": "7fc8079da8fc82d21a66ee7869518ef2"}, {"celebrity_name": "Stephanie Beatriz", "img_url": "https://m.media-amazon.com/images/M/MV5BYWY3ZGQ0OGUtZDNjYi00MmRkLWE4YmMtYzk3MzAwZjQxMDRlXkEyXkFqcGdeQXVyODkzNTgxMDg@._V1_UY209_CR82,0,140,209_AL_.jpg", "hash": "7a85cacecdf5f6e86336af188c0feca1"}, {"celebrity_name": "Isabel May", "img_url": "https://m.media-amazon.com/images/M/MV5BYTI5MWQ0NmEtYmU5Zi00NDlmLWE1MmMtOTVjZGMzYTc2M2FhXkEyXkFqcGdeQXVyNjUzMzg3MTE@._V1_UY209_CR86,0,140,209_AL_.jpg", "hash": "074e81c3aa79b719d0adc3df64eefcc3"}, {"celebrity_name": "Richard Madden", "img_url": "https://m.media-amazon.com/images/M/MV5BMTUyMDgxNDYxOV5BMl5BanBnXkFtZTgwMTExMDEwMDI@._V1_UY209_CR7,0,140,209_AL_.jpg", "hash": "3c48a8b32fbc0a284bcd1c247e8259c4"}, {"celebrity_name": "Meat Loaf", "img_url": "https://m.media-amazon.com/images/M/MV5BMTIzNTQ4MjYyOV5BMl5BanBnXkFtZTcwNzgwNTEzMg@@._V1_UY209_CR4,0,140,209_AL_.jpg", "hash": "b4a666488f465b8ee16e69388f4419e0"}, {"celebrity_name": "Mckenna Grace", "img_url": "https://m.media-amazon.com/images/M/MV5BOTkyZDQ2MjAtN2Q2Ni00ZDA5LWI3MzgtMmVjZDM4OWU2NGI3XkEyXkFqcGdeQXVyMzQxNjUxMDE@._V1_UY209_CR3,0,140,209_AL_.jpg", "hash": "c0316680c2addd11bd7de01446415691"}, {"celebrity_name": "Ming-Na Wen", "img_url": "https://m.media-amazon.com/images/M/MV5BMTIyNjUwNTk3OV5BMl5BanBnXkFtZTcwOTE4NTMzMQ@@._V1_UY209_CR13,0,140,209_AL_.jpg", "hash": "b300b7a7dc5ab7a16accdd796af3b494"}, {"celebrity_name": "Freya Allan", "img_url": "https://m.media-amazon.com/images/M/MV5BZTYxMDc0Y2UtZWJjYi00Yjk1LWE5NWQtMGNmMmVhNzkwYmQ4XkEyXkFqcGdeQXVyMTI5Njc2ODg3.jpg", "hash": "5ee4a557e1aa35c7b357c17869b30608"}, {"celebrity_name": "Anya Chalotra", "img_url": "https://m.media-amazon.com/images/M/MV5BN2ZjOGVmMTgtZTJmNS00MWFjLTk5MWEtYmYzY2M0YzEyN2U0XkEyXkFqcGdeQXVyMTA1MDUzMjgx._V1_UY209_CR9,0,140,209_AL_.jpg", "hash": "0a2981e0014ece7344ad33eeba32ebcd"}, {"celebrity_name": "Cole Hauser", "img_url": "https://m.media-amazon.com/images/M/MV5BZWRiOTdjN2UtY2M1Yy00YzBjLWJmMzQtYTAyZGY4ZGFmZDRkXkEyXkFqcGdeQXVyNDI3NzU1NDE@.jpg", "hash": "af5a0cb1ec78fff2178c458e22329073"}, {"celebrity_name": "Ella Purnell", "img_url": "https://m.media-amazon.com/images/M/MV5BMTYxNDk4NDAyMl5BMl5BanBnXkFtZTgwNjIzMTc0NTM@._V1_UY209_CR2,0,140,209_AL_.jpg", "hash": "4cbdf2fb940bec6afb515b07bcd68855"}, {"celebrity_name": "Alyssa Milano", "img_url": "https://m.media-amazon.com/images/M/MV5BMTMwMTE1NTgzNV5BMl5BanBnXkFtZTcwMzk4Mzc2Mw@@._V1_UY209_CR15,0,140,209_AL_.jpg", "hash": "8b1f9a86595a1eda550bfa1ee5e893f7"}, {"celebrity_name": "Matt McGorry", "img_url": "https://m.media-amazon.com/images/M/MV5BYzZlZTY2NDAtZGViYS00ZjRlLThjYTEtNzFiMTc1ZThkNTMyXkEyXkFqcGdeQXVyMTA5MTI4NTA5.jpg", "hash": "59e6b0dbec4d6fab3c0983c5d3ed6b27"}, {"celebrity_name": "Lily James", "img_url": "https://m.media-amazon.com/images/M/MV5BMTgxMjM2NTAyMV5BMl5BanBnXkFtZTgwOTU4NjU2NDE@.jpg", "hash": "f6cedde2aa8f8a9cc4c01603f4bd589d"}, {"celebrity_name": "Henry Cavill", "img_url": "https://m.media-amazon.com/images/M/MV5BODI0MTYzNTIxNl5BMl5BanBnXkFtZTcwNjg2Nzc0NA@@._V1_UY209_CR18,0,140,209_AL_.jpg", "hash": "6b493be80ee2af4f2738fae11d5d32a6"}, {"celebrity_name": "Oscar Isaac", "img_url": "https://m.media-amazon.com/images/M/MV5BMTQ2ODE2NDQ5OF5BMl5BanBnXkFtZTcwOTU3OTM1OQ@@._V1_UY209_CR4,0,140,209_AL_.jpg", "hash": "b095062c1d2d4eb85e4df459915701ee"}, {"celebrity_name": "Jodie Comer", "img_url": "https://m.media-amazon.com/images/M/MV5BZmViMjQxYTUtZDExNy00NjU1LWI4MmEtY2RhODRkMzNkODM1XkEyXkFqcGdeQXVyNjkwNzEwMzY@._V1_UY209_CR37,0,140,209_AL_.jpg", "hash": "07e26e049815c183c4ca9e270d22abcc"}, {"celebrity_name": "Diane Guerrero", "img_url": "https://m.media-amazon.com/images/M/MV5BMjEyODg0OTg5OF5BMl5BanBnXkFtZTgwOTk1MDAzMTI@._V1_UY209_CR3,0,140,209_AL_.jpg", "hash": "c3b293a66b4a1c1f6ffa6c7c0b4348d7"}, {"celebrity_name": "Jenna Ortega", "img_url": "https://m.media-amazon.com/images/M/MV5BMDcwMTYxNjEtN2M1Mi00ZmQxLWI4YjAtMjFjZDhiY2QzYWVjXkEyXkFqcGdeQXVyMzQwODQxNTU@._V1_UY209_CR10,0,140,209_AL_.jpg", "hash": "e45813ff0bc48f86bc66f017232afc36"}, {"celebrity_name": "Louie Anderson", "img_url": "https://m.media-amazon.com/images/M/MV5BMTc2MTAzNTc5MV5BMl5BanBnXkFtZTYwNTMxNzk1._V1_UY209_CR2,0,140,209_AL_.jpg", "hash": "589d22502d547547d7fc51b7fe1d9cc4"}, {"celebrity_name": "Tom Holland", "img_url": "https://m.media-amazon.com/images/M/MV5BNzZiNTEyNTItYjNhMS00YjI2LWIwMWQtZmYwYTRlNjMyZTJjXkEyXkFqcGdeQXVyMTExNzQzMDE0.jpg", "hash": "5a053e4f1b3fed84369b4717bc8573e6"}, {"celebrity_name": "Diane Morgan", "img_url": "https://m.media-amazon.com/images/M/MV5BN2M4MGM3NjItNDMyNC00ZjVmLWFkNTctNjAzODcyZGVjNzhlXkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1_UY209_CR44,0,140,209_AL_.jpg", "hash": "cd1521172a810dd236013a4650dca772"}, {"celebrity_name": "Sam Page", "img_url": "https://m.media-amazon.com/images/M/MV5BMTU4MDExMjIxNF5BMl5BanBnXkFtZTcwNTkwMTgyMQ@@._V1_UY209_CR42,0,140,209_AL_.jpg", "hash": "0a20346d5fb259266069ae38394bd9f5"}, {"celebrity_name": "Neve Campbell", "img_url": "https://m.media-amazon.com/images/M/MV5BODc1MDdlZGQtMmYyNC00ZWRiLTlmYWMtNDNhYTU0YTI4YjlmXkEyXkFqcGdeQXVyMTIzMDcyMzA@._V1_UY209_CR12,0,140,209_AL_.jpg", "hash": "b8489b68e70807da6bbaf14312abc841"}, {"celebrity_name": "Ma Dong-seok", "img_url": "https://m.media-amazon.com/images/M/MV5BMjJkNTk0NGQtOGU3NS00M2JlLTg2NzktNjQ1ZTU2YzU0YWI2XkEyXkFqcGdeQXVyMTkxNjUyNQ@@.jpg", "hash": "c2f8aec57025a275c75969561409ff25"}, {"celebrity_name": "Eric Nelsen", "img_url": "https://m.media-amazon.com/images/M/MV5BN2FhM2VlYzMtZDYwYS00YzA4LTg1MTMtZTVhYzAzMDIyN2RhXkEyXkFqcGdeQXVyMjk5MDU3OTU@._V1_UY209_CR14,0,140,209_AL_.jpg", "hash": "8c4ba943394775b50d93156d67984cdf"}, {"celebrity_name": "Kelly Reilly", "img_url": "https://m.media-amazon.com/images/M/MV5BNjgzMzk2MjEzM15BMl5BanBnXkFtZTgwMTkzMDEwMTE@.jpg", "hash": "bf5b452de0d9c149629f97174d6544c4"}, {"celebrity_name": "Hailee Steinfeld", "img_url": "https://m.media-amazon.com/images/M/MV5BMGFmZDVhZDUtZWIyNC00NzBjLTg0ZGEtY2FhMjJlZWJhZjBlXkEyXkFqcGdeQXVyMTcwNzE4OTI@._V1_UY209_CR34,0,140,209_AL_.jpg", "hash": "27c658b69cef1d5bda493e67dbe9084d"}, {"celebrity_name": "Andrew Garfield", "img_url": "https://m.media-amazon.com/images/M/MV5BMjE2MjI2OTk1OV5BMl5BanBnXkFtZTgwNTY1NzM4MDI@._V1_UY209_CR1,0,140,209_AL_.jpg", "hash": "bd732589c9662d8cdebfacfd05398e05"}, {"celebrity_name": "Temuera Morrison", "img_url": "https://m.media-amazon.com/images/M/MV5BNmRlZWQxMjUtNjJkZS00MTY2LWJlYzgtN2Y3N2VhYTUwZDM4XkEyXkFqcGdeQXVyMTIzMDI5MzAy.jpg", "hash": "958153a46cdbad98462a53bd58df64fe"}, {"celebrity_name": "Yvette Mimieux", "img_url": "https://m.media-amazon.com/images/M/MV5BMzc2NTgwMzYzNV5BMl5BanBnXkFtZTcwNTA0NTcxOA@@._V1_UY209_CR11,0,140,209_AL_.jpg", "hash": "84711115a505232e3d0a7376bb42985e"}, {"celebrity_name": "Peyton List", "img_url": "https://m.media-amazon.com/images/M/MV5BY2JiOTUwYWEtYjQ2OS00ZTlkLTkxNWItZDY0NWM1NWM0MGIwXkEyXkFqcGdeQXVyMTAxMTI0MzI@.jpg", "hash": "b50b763968f11f001cedf2ef063ba55f"}, {"celebrity_name": "Maude Apatow", "img_url": "https://m.media-amazon.com/images/M/MV5BMjA5NTMzNTQ1Ml5BMl5BanBnXkFtZTgwMjc1NjAwNzM@._V1_UY209_CR13,0,140,209_AL_.jpg", "hash": "bbd71f2494521c2bc373e0d882f3224e"}, {"celebrity_name": "Lauren Ridloff", "img_url": "https://m.media-amazon.com/images/M/MV5BYTQ5MzZiMzEtNjJjOS00ZGRjLTg4YzctZTljODUwMTg2ZjdiXkEyXkFqcGdeQXVyNjkzNjQ5NjU@.jpg", "hash": "eb98f6bdeb2a4f7f29ec63b980e84dc1"}, {"celebrity_name": "Cassidy Freeman", "img_url": "https://m.media-amazon.com/images/M/MV5BMTUzOTUzMDY4OF5BMl5BanBnXkFtZTgwNDc3OTU5ODE@.jpg", "hash": "b4482a2bd832ffad1a607c6e9624a312"}, {"celebrity_name": "Kit Harington", "img_url": "https://m.media-amazon.com/images/M/MV5BMTA2NTI0NjYxMTBeQTJeQWpwZ15BbWU3MDIxMjgyNzY@.jpg", "hash": "5f41d7c8cf20d75db1e241c7c8675f0c"}, {"celebrity_name": "Ana de Armas", "img_url": "https://m.media-amazon.com/images/M/MV5BMWM3MDMzNjMtODM5Ny00YmY0LWJhNzQtNTE1ZDNlNjllNDQ0XkEyXkFqcGdeQXVyODkzNTgxMDg@._V1_UY209_CR86,0,140,209_AL_.jpg", "hash": "6f42a387c079c341b5bfcb38f7d96f22"}, {"celebrity_name": "Alexa Demie", "img_url": "https://m.media-amazon.com/images/M/MV5BY2UwOGQ0MTgtZWUxYS00ODc3LWEzOWQtOTY3M2MwZTkwZTgzXkEyXkFqcGdeQXVyNTg3NjAyMTY@._V1_UY209_CR87,0,140,209_AL_.jpg", "hash": "7056388c6411827e930c923844417f74"}, {"celebrity_name": "Cush Jumbo", "img_url": "https://m.media-amazon.com/images/M/MV5BZTI0YzFmZGYtMjM0MC00NmNlLWJkM2QtMTc2YTc0YTQyNTRiXkEyXkFqcGdeQXVyNjY5NDgzNjQ@.jpg", "hash": "c662b7762637dd674e5c242f732b3c04"}, {"celebrity_name": "Ariana DeBose", "img_url": "https://m.media-amazon.com/images/M/MV5BZjNkNzI4YTItY2ZhNi00YmIyLWFlYTMtNTdjMzcwNTdiMDkyXkEyXkFqcGdeQXVyOTc3OTcwMTk@.jpg", "hash": "43088553a2f55b16bb8787c1644347af"}, {"celebrity_name": "Richard Armitage", "img_url": "https://m.media-amazon.com/images/M/MV5BMTZkZDcwMzEtNmE3Ny00M2YzLWJhNDAtY2U5NjkzMzJkNjM4XkEyXkFqcGdeQXVyMjQxODUxMjA@._V1_UY209_CR0,0,140,209_AL_.jpg", "hash": "94c7b64bc3d3d04c180f5830adf18093"}, {"celebrity_name": "Florence Pugh", "img_url": "https://m.media-amazon.com/images/M/MV5BYjI5YjIyNTgtN2UzOS00NmRiLWE0YjgtNDIxN2M5MDQ2NmY2XkEyXkFqcGdeQXVyNjUwNzk3NDc@._V1_UY209_CR4,0,140,209_AL_.jpg", "hash": "9f92c2a22729cd0962d44116983b9465"}, {"celebrity_name": "Mikey Madison", "img_url": "https://m.media-amazon.com/images/M/MV5BMzc4MWVkNmEtOWEwMS00Yzg3LTliODAtM2VlMTVhZDliNjU5XkEyXkFqcGdeQXVyNDM4NzgyMzk@.jpg", "hash": "eed680596f246f6279e011977a4fcbfa"}, {"celebrity_name": "Timothée Chalamet", "img_url": "https://m.media-amazon.com/images/M/MV5BOWU1Nzg0M2ItYjEzMi00ODliLThkODAtNGEyYzRkZTBmMmEzXkEyXkFqcGdeQXVyNDk2Mzk2NDg@._V1_UY209_CR9,0,140,209_AL_.jpg", "hash": "c6cc291bff97e86584c48ecc3c11b6e2"}, {"celebrity_name": "Julia Chan", "img_url": "https://m.media-amazon.com/images/M/MV5BZDVmOWQ3ZTYtNDY0NS00MzdhLWE3NzMtYWFmNGY0YjcxNzJlXkEyXkFqcGdeQXVyMjI5MzUyMjI@._V1_UY209_CR13,0,140,209_AL_.jpg", "hash": "572670e5df6cfcac13add23baf05e32c"}, {"celebrity_name": "Sophie Nélisse", "img_url": "https://m.media-amazon.com/images/M/MV5BYzA1YmIzYzUtZDgxMy00N2RkLWI5NjktYmQ5ZDQ0YmQ5NmNhXkEyXkFqcGdeQXVyMTEwMTU2NDc5.jpg", "hash": "94ffe3202594f1c294bfb06857b4bdef"}, {"celebrity_name": "Christina Ricci", "img_url": "https://m.media-amazon.com/images/M/MV5BMjUzMzk5NzcyNV5BMl5BanBnXkFtZTcwNzQ1NjkzNw@@.jpg", "hash": "080cce3d16a82f4b2379de2a5c8394b1"}, {"celebrity_name": "Kelly Rohrbach", "img_url": "https://m.media-amazon.com/images/M/MV5BMTY2NDc2Njk1M15BMl5BanBnXkFtZTgwNjUyNjM5MTI@.jpg", "hash": "a1e977d147978a6d735c87b7816fe6a5"}, {"celebrity_name": "Luke Grimes", "img_url": "https://m.media-amazon.com/images/M/MV5BMTcyNzgxNDY2Nl5BMl5BanBnXkFtZTgwMTcxMjA3NTM@.jpg", "hash": "175c4e141e8af5ac672bc2273a2ce637"}, {"celebrity_name": "Betty White", "img_url": "https://m.media-amazon.com/images/M/MV5BMjA2OTA5NTUyMF5BMl5BanBnXkFtZTcwNjMwNzYzMw@@._V1_UY209_CR7,0,140,209_AL_.jpg", "hash": "ab402797fdb83f1699173bac593b9883"}, {"celebrity_name": "Teresa Palmer", "img_url": "https://m.media-amazon.com/images/M/MV5BMWY4OWYxMmYtYWQ1Yy00NzI2LTkxMzktMWViM2JlOGEwNDgwXkEyXkFqcGdeQXVyNDE1NzY2MTI@._V1_UY209_CR20,0,140,209_AL_.jpg", "hash": "69b30d97a5b173dd10ad8d1b6b081867"}, {"celebrity_name": "Francia Raisa", "img_url": "https://m.media-amazon.com/images/M/MV5BMWFlMDE3M2MtMWNjYi00NmU4LTkxZmItMjYwNWQ2OGVjZGRlXkEyXkFqcGdeQXVyMTM3NDI1NTU@.jpg", "hash": "e9bf9f42bbf96949d4def98c1a5d71e8"}, {"celebrity_name": "Jodie Sweetin", "img_url": "https://m.media-amazon.com/images/M/MV5BMTc2MTA5MzQ0MF5BMl5BanBnXkFtZTgwNjA0MzAyNjE@._V1_UY209_CR4,0,140,209_AL_.jpg", "hash": "7d046e83c720d9b6be7bbc6352590adc"}, {"celebrity_name": "Christopher Lowell", "img_url": "https://m.media-amazon.com/images/M/MV5BMTk1YTQ2MWItOGIzNS00MjFkLWE4ODktYjU1ZjJhMzQyNDIxXkEyXkFqcGdeQXVyMTE1MTYxNDAw._V1_UY209_CR11,0,140,209_AL_.jpg", "hash": "43164d14e5e9c2742d7c71f66dd5ddef"}, {"celebrity_name": "Leonardo DiCaprio", "img_url": "https://m.media-amazon.com/images/M/MV5BMjI0MTg3MzI0M15BMl5BanBnXkFtZTcwMzQyODU2Mw@@._V1_UY209_CR7,0,140,209_AL_.jpg", "hash": "072fb1d1982f70aead50ea596955d05b"}, {"celebrity_name": "Alexandra Daddario", "img_url": "https://m.media-amazon.com/images/M/MV5BMTY3Nzg2NjA1OF5BMl5BanBnXkFtZTgwMjY5NTU1MzI@._V1_UY209_CR7,0,140,209_AL_.jpg", "hash": "f9233100a4390742007cdb5da92fd54e"}, {"celebrity_name": "Angus Cloud", "img_url": "https://m.media-amazon.com/images/M/MV5BZjk2NTM3NzQtZDA0Zi00OGM0LThmM2UtYzcwMjQ1MjA1ODkwXkEyXkFqcGdeQXVyMTI1MTQ4MTM3._V1_UY209_CR87,0,140,209_AL_.jpg", "hash": "e743db8cb131f039c67d166ee458bc53"}, {"celebrity_name": "Angelina Jolie", "img_url": "https://m.media-amazon.com/images/M/MV5BODg3MzYwMjE4N15BMl5BanBnXkFtZTcwMjU5NzAzNw@@._V1_UY209_CR15,0,140,209_AL_.jpg", "hash": "8e5c59ae6f53140372155250ff8b0807"}, {"celebrity_name": "Salma Hayek", "img_url": "https://m.media-amazon.com/images/M/MV5BMzkyMTk2NzM2Ml5BMl5BanBnXkFtZTcwNDQ4MjYzMg@@._V1_UY209_CR4,0,140,209_AL_.jpg", "hash": "9a0e6a2ce6e754beb04d8f0e4df88bf4"}, {"celebrity_name": "Cate Blanchett", "img_url": "https://m.media-amazon.com/images/M/MV5BMTc1MDI0MDg1NV5BMl5BanBnXkFtZTgwMDM3OTAzMTE@._V1_UY209_CR2,0,140,209_AL_.jpg", "hash": "a0ea92f7450c8e275b1207bf0d2e2931"}, {"celebrity_name": "Matthew Goode", "img_url": "https://m.media-amazon.com/images/M/MV5BMTY5MDI4NzkxOV5BMl5BanBnXkFtZTgwNzc2MzU0MzE@.jpg", "hash": "d0186a264066918e040f78e2ae84b88e"}, {"celebrity_name": "Alexander Skarsgård", "img_url": "https://m.media-amazon.com/images/M/MV5BMTY1MjQxNjEzOF5BMl5BanBnXkFtZTgwMTU5ODM2ODE@.jpg", "hash": "13ce8d172902212427a9d30afbcfe2b6"}, {"celebrity_name": "John Cena", "img_url": "https://m.media-amazon.com/images/M/MV5BMTQ5MzkzNTIyN15BMl5BanBnXkFtZTYwNzUzOTA2.jpg", "hash": "5892bfc7f85e43c5a8d32b4602f77cb4"}, {"celebrity_name": "Mackenzie Davis", "img_url": "https://m.media-amazon.com/images/M/MV5BYzRkYmE0YWYtY2I3OC00OTAyLWE5YmItYzIwMGYyMTk1NDk3XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY209_CR34,0,140,209_AL_.jpg", "hash": "724a8aba3023a45271ebbf89c940f4d2"}, {"celebrity_name": "Mark Rylance", "img_url": "https://m.media-amazon.com/images/M/MV5BMTA1MDY3MTc2OTReQTJeQWpwZ15BbWU3MDc2MTU1NzE@.jpg", "hash": "ddc9cef8321dc23ca53280d1d455ee8e"}, {"celebrity_name": "Jennifer Lawrence", "img_url": "https://m.media-amazon.com/images/M/MV5BOTU3NDE5MDQ4MV5BMl5BanBnXkFtZTgwMzE5ODQ3MDI@.jpg", "hash": "154097ccda98f5734671b5a589f4c29a"}, {"celebrity_name": "Jesse Plemons", "img_url": "https://m.media-amazon.com/images/M/MV5BZTQyMzQzMjEtODVjMS00YzEzLWJjNzItY2I0MWM1YjY3MjZkXkEyXkFqcGdeQXVyMTMxNjMxMjE5._V1_UY209_CR13,0,140,209_AL_.jpg", "hash": "fd020f50514a9048c474460304f790ca"}, {"celebrity_name": "Keanu Reeves", "img_url": "https://m.media-amazon.com/images/M/MV5BNmNlNGU0ZDgtMDg3MS00ZGZmLTg4ZjMtYjMyZjVmNzlhNWIwXkEyXkFqcGdeQXVyMTE1MTYxNDAw._V1_UY209_CR34,0,140,209_AL_.jpg", "hash": "3bbbda937ad8eaba4cd46fff56f914ce"}, {"celebrity_name": "Carrie Coon", "img_url": "https://m.media-amazon.com/images/M/MV5BY2JlNjA2MzgtNjMwNy00Mjg1LTk1NGYtZTQ3NTZjYTgxMjM1XkEyXkFqcGdeQXVyMjQwMDg0Ng@@.jpg", "hash": "6dc58443c63060b2f6a9a8050e8c0216"}, {"celebrity_name": "Benedict Cumberbatch", "img_url": "https://m.media-amazon.com/images/M/MV5BOTc0ZGQwMTAtNGM5Zi00OGZjLTlmMWMtZDNjN2M3YjNmMmUyXkEyXkFqcGdeQXVyMjI2MDYzNDE@._V1_UY209_CR35,0,140,209_AL_.jpg", "hash": "4d637c9a79d943d84fd715e9c2f3b9d6"}, {"celebrity_name": "Jessica Henwick", "img_url": "https://m.media-amazon.com/images/M/MV5BYTk2NmFjNzQtYTNiNy00ODk5LWE4NGUtZTFjNjI4N2JjZDMxXkEyXkFqcGdeQXVyMTAwODk1MDk@._V1_UY209_CR11,0,140,209_AL_.jpg", "hash": "2b359d61057ef5aa5dedfb02cc57a078"}, {"celebrity_name": "Lily Collins", "img_url": "https://m.media-amazon.com/images/M/MV5BZGYxMmQyNjEtZmI0Yi00OWUwLThiNDItYmViZTYyYmQ3YjdkXkEyXkFqcGdeQXVyMTIzOTM5Mjc0.jpg", "hash": "b8c77ea01708ab0c663834dacc984cbb"}, {"celebrity_name": "Vincent D'Onofrio", "img_url": "https://m.media-amazon.com/images/M/MV5BMTk0NTE2MDkzNF5BMl5BanBnXkFtZTYwODUzMjcz._V1_UY209_CR4,0,140,209_AL_.jpg", "hash": "df8d252384b053ee6b1b31166253eba9"}, {"celebrity_name": "Kelsey Asbille", "img_url": "https://m.media-amazon.com/images/M/MV5BMGZlMDg0ZDgtOGMyNS00ZGM5LTkxZGUtNjY3ZWFmMmJlMmFiXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY209_CR14,0,140,209_AL_.jpg", "hash": "d85cd061f6c000d38a3f50f99997365d"}, {"celebrity_name": "Courtney Eaton", "img_url": "https://m.media-amazon.com/images/M/MV5BZTc1MTk0YTYtMjY2ZS00ZmY3LTk3NDctMjMzYzM3ZmYwNzllXkEyXkFqcGdeQXVyODcyNzI0OTE@.jpg", "hash": "bcd176af8e66c2bd5c7a08cb4cba970f"}, {"celebrity_name": "Melissa Barrera", "img_url": "https://m.media-amazon.com/images/M/MV5BNjQwMWJiYTctNzkxYy00ZDQ3LTkwZmQtM2YxMmRhOTBhNDljXkEyXkFqcGdeQXVyMTA2MDIzMDE5.jpg", "hash": "39080ea4cbfb3701a35bf5484c362613"}, {"celebrity_name": "Antje Traue", "img_url": "https://m.media-amazon.com/images/M/MV5BZmYyN2RmZjAtZTQwNS00ZTNhLThlYmMtYjRlOGE5NDA0YTk0XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY209_CR87,0,140,209_AL_.jpg", "hash": "b5a3a95d218cc1f39790c9f4bd9704de"}, {"celebrity_name": "Bill Skarsgård", "img_url": "https://m.media-amazon.com/images/M/MV5BODBlNmRhODYtOWE2Ni00MTZmLWExMWYtMmRjYWNhNDRjNGU2XkEyXkFqcGdeQXVyMDM2NDM2MQ@@._V1_UY209_CR80,0,140,209_AL_.jpg", "hash": "3ace722b2ea3898f8d817670041f9230"}, {"celebrity_name": "Lucy Boynton", "img_url": "https://m.media-amazon.com/images/M/MV5BMTk4ZWI3ZDktNzBiYS00MzdiLTk2MDEtOWNlOTY0ZDg3NDBhXkEyXkFqcGdeQXVyODY2MTA2OTg@._V1_UY209_CR69,0,140,209_AL_.jpg", "hash": "1c3a0f2c88ede87d6ffc9f61a6daa7a1"}, {"celebrity_name": "Hilary Duff", "img_url": "https://m.media-amazon.com/images/M/MV5BMTk5OTU1NzIzNF5BMl5BanBnXkFtZTcwMTg3MjM3Mw@@.jpg", "hash": "3314ea8f18bb33e9d6c092d9bc61b1c8"}, {"celebrity_name": "John Leguizamo", "img_url": "https://m.media-amazon.com/images/M/MV5BNTEyMjMxNDg5NF5BMl5BanBnXkFtZTcwNzczOTY4MQ@@._V1_UY209_CR15,0,140,209_AL_.jpg", "hash": "e05729b266048b389539e0191eef2b96"}, {"celebrity_name": "Chloe Cherry", "img_url": "https://m.media-amazon.com/images/M/MV5BZWIwMzRlYjMtODFkYi00MGMyLWIyNmYtNTIyMWY3YmUzMzg2XkEyXkFqcGdeQXVyMzM4MjM0Nzg@.jpg", "hash": "40937bdeda716799e2b61893e17b14cd"}, {"celebrity_name": "Anna Chlumsky", "img_url": "https://m.media-amazon.com/images/M/MV5BMjEwMzY0Njk3M15BMl5BanBnXkFtZTcwMjU5OTUxNw@@._V1_UY209_CR11,0,140,209_AL_.jpg", "hash": "392c9f4f82c18952f60330bad7b5c18a"}, {"celebrity_name": "Zooey Deschanel", "img_url": "https://m.media-amazon.com/images/M/MV5BMTgzMjM2NDE1OF5BMl5BanBnXkFtZTcwMjA2NDU5OA@@._V1_UY209_CR8,0,140,209_AL_.jpg", "hash": "520c68cfce0958ff825db81306299511"}, {"celebrity_name": "Samantha Hanratty", "img_url": "https://m.media-amazon.com/images/M/MV5BZWJkZGFhYmYtZGQxOC00NTc4LWFiYWEtNzBiNzgxMjZjMDRmXkEyXkFqcGdeQXVyNDI3MDgyNQ@@._V1_UY209_CR60,0,140,209_AL_.jpg", "hash": "694fa4b5e5ad18fe6d6f6dbb5c7bc66e"}, {"celebrity_name": "Courtney Henggeler", "img_url": "https://m.media-amazon.com/images/M/MV5BYzk2YzdhMDgtYmEzYS00Yjg1LWJmZjEtNDEzNWI4NjFhN2RkXkEyXkFqcGdeQXVyMTkyNzUwMzk@.jpg", "hash": "b54197b6d4e7834ecdba2711887cab8e"}, {"celebrity_name": "Kaya Scodelario", "img_url": "https://m.media-amazon.com/images/M/MV5BNjk5NjE5NTczMV5BMl5BanBnXkFtZTcwODI0OTM0NA@@._V1_UY209_CR3,0,140,209_AL_.jpg", "hash": "f4bcd9f52198edcc6d558a2ec959d426"}, {"celebrity_name": "Thomas Ian Griffith", "img_url": "https://m.media-amazon.com/images/M/MV5BYmY0MTc3OTYtM2ZmYS00NWZiLTk2NTYtY2Q5MzE3NjNiNzZiXkEyXkFqcGdeQXVyMTA3NjAyMDk3.jpg", "hash": "e3a2d58e7a597a934d49cebfee8ddd83"}, {"celebrity_name": "Juliette Lewis", "img_url": "https://m.media-amazon.com/images/M/MV5BMjE4Nzk1MDgyNV5BMl5BanBnXkFtZTYwNzQ3MDgy._V1_UY209_CR0,0,140,209_AL_.jpg", "hash": "3db9ed18f303fcf59d491dedd9b92242"}, {"celebrity_name": "Sara Ramirez", "img_url": "https://m.media-amazon.com/images/M/MV5BMTA3Nzk1MTY4MDFeQTJeQWpwZ15BbWU2MDY3NDkyOA@@._V1_UY209_CR7,0,140,209_AL_.jpg", "hash": "77aa03ee48424dc56798e03e81babb52"}, {"celebrity_name": "Stacey Dash", "img_url": "https://m.media-amazon.com/images/M/MV5BMTQzMzUwNDE0MF5BMl5BanBnXkFtZTgwOTQ3NTI3MzE@.jpg", "hash": "d965c901ad9b3f6c94b5bdab3c62a512"}, {"celebrity_name": "Jack Quaid", "img_url": "https://m.media-amazon.com/images/M/MV5BY2Y2MmIzOGEtNTgyYi00OWUyLTljNzEtYmFlOWU2MzFkZTg1XkEyXkFqcGdeQXVyMjYyNDg5NzY@._V1_UY209_CR0,0,140,209_AL_.jpg", "hash": "80b513bf07c93293997a99ecbdc9272e"}, {"celebrity_name": "Julie Ann Emery", "img_url": "https://m.media-amazon.com/images/M/MV5BNTk0ODQ1OTQxM15BMl5BanBnXkFtZTgwMjMzMTE0NDE@._V1_UY209_CR5,0,140,209_AL_.jpg", "hash": "3e61c9041474f3d62fb57c857fe44082"}, {"celebrity_name": "Tom Hardy", "img_url": "https://m.media-amazon.com/images/M/MV5BMTQ3ODEyNjA4Nl5BMl5BanBnXkFtZTgwMTE4ODMyMjE@.jpg", "hash": "14ecd1f4ba66bc502204fc5015cb300e"}, {"celebrity_name": "Rebecca Ferguson", "img_url": "https://m.media-amazon.com/images/M/MV5BNzA4NDA1MTA5NV5BMl5BanBnXkFtZTcwNjMyNTQ3OA@@._V1_UY209_CR4,0,140,209_AL_.jpg", "hash": "170f1b1371294abfc2376b92003d6b37"}, {"celebrity_name": "Anya Taylor-Joy", "img_url": "https://m.media-amazon.com/images/M/MV5BMTllYmE5YTYtZGZmYy00ZTBlLWJlODEtYWQ0ZmU1YTJkMjJlXkEyXkFqcGdeQXVyNzI1NzMxNzM@.jpg", "hash": "b812b6e29da00dd7ba51b0394c7c9c93"}, {"celebrity_name": "Bob Saget", "img_url": "https://m.media-amazon.com/images/M/MV5BMTQxMTY2NjE1NF5BMl5BanBnXkFtZTcwNjIyMjM2MQ@@._V1_UY209_CR10,0,140,209_AL_.jpg", "hash": "80ada47f494b65d996a2b575cded6c15"}, {"celebrity_name": "Denzel Washington", "img_url": "https://m.media-amazon.com/images/M/MV5BMjE5NDU2Mzc3MV5BMl5BanBnXkFtZTcwNjAwNTE5OQ@@._V1_UY209_CR8,0,140,209_AL_.jpg", "hash": "bc07b0dc5bcdb223036053558e3a2dac"}, {"celebrity_name": "Juno Temple", "img_url": "https://m.media-amazon.com/images/M/MV5BMTQ3NDU5OTY5NV5BMl5BanBnXkFtZTgwNjE5ODA5OTE@.jpg", "hash": "539350c8ad14234e7c9f15cf8c16be0b"}, {"celebrity_name": "Adam Sandler", "img_url": "https://m.media-amazon.com/images/M/MV5BMjQyNzM2MjM1Ml5BMl5BanBnXkFtZTcwMDE5NjI3Mg@@._V1_UY209_CR5,0,140,209_AL_.jpg", "hash": "8d57fffe2abd3eec10c8b832871de369"}, {"celebrity_name": "Léa Seydoux", "img_url": "https://m.media-amazon.com/images/M/MV5BMjM3MTczNzY1MF5BMl5BanBnXkFtZTgwNjgwODgzNDE@._V1_UY209_CR4,0,140,209_AL_.jpg", "hash": "096966c90eb033998ffd6b5a1588d624"}, {"celebrity_name": "Tom Pelphrey", "img_url": "https://m.media-amazon.com/images/M/MV5BYmNmMjkyYzgtNGI2Ny00YTZlLWFkNjQtYmM5ZjUzYzFhZmFlXkEyXkFqcGdeQXVyNzU1OTM4ODE@.jpg", "hash": "f667a09e8ac86260c6fcc0a03b4c3f24"}, {"celebrity_name": "Tom Cruise", "img_url": "https://m.media-amazon.com/images/M/MV5BMTk1MjM3NTU5M15BMl5BanBnXkFtZTcwMTMyMjAyMg@@._V1_UY209_CR9,0,140,209_AL_.jpg", "hash": "cbef7368efa221f37732c656d34ba2e2"}, {"celebrity_name": "Ben Affleck", "img_url": "https://m.media-amazon.com/images/M/MV5BMzczNzNiMDAtMmUzZS00MTkwLWIwOTYtNmYyNjg3MTVkNThhXkEyXkFqcGdeQXVyMjA4MjI5MTA@._V1_UY209_CR8,0,140,209_AL_.jpg", "hash": "b152f0c8ac617f4b22c2681b0109e9fb"}, {"celebrity_name": "Jessy Schram", "img_url": "https://m.media-amazon.com/images/M/MV5BODRlZjA4OGYtMzUyZC00OGViLWI2YjYtODRlZDgxZjhkYjdkXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY209_CR16,0,140,209_AL_.jpg", "hash": "5dcc2859affb8c70ab57293238733e82"}, {"celebrity_name": "Dove Cameron", "img_url": "https://m.media-amazon.com/images/M/MV5BMTUzNDA3NTI2M15BMl5BanBnXkFtZTgwNDA2NDI1NDM@._V1_UY209_CR1,0,140,209_AL_.jpg", "hash": "74b10c3e036b22272bdc69bfec1e9316"}, {"celebrity_name": "Chloë Grace Moretz", "img_url": "https://m.media-amazon.com/images/M/MV5BMjA5MzE2NzA2M15BMl5BanBnXkFtZTgwNTc1NDA4NTM@._V1_UY209_CR25,0,140,209_AL_.jpg", "hash": "488f28e6337ce0909888df75c9e44977"}, {"celebrity_name": "Jessie Buckley", "img_url": "https://m.media-amazon.com/images/M/MV5BNjlmMmQ2MzktMzY3Zi00ZWRiLThiOTAtNDMyYWY2YTBmYzU3XkEyXkFqcGdeQXVyODk4OTc3MTY@.jpg", "hash": "8b6af2765865ec3fa3de38cd50e35b4a"}, {"celebrity_name": "Kevin Costner", "img_url": "https://m.media-amazon.com/images/M/MV5BMTY1ODkwMTQxOF5BMl5BanBnXkFtZTcwNzkwNDcyMw@@.jpg", "hash": "7f2207b1313bd3b2d21540318b01c392"}, {"celebrity_name": "Caroline Munro", "img_url": "https://m.media-amazon.com/images/M/MV5BMzE5MjczODA1OF5BMl5BanBnXkFtZTgwMjY0OTE0NTE@.jpg", "hash": "98c91dc1d2a7ae232cc53ecd429e1713"}, {"celebrity_name": "Daniel Radcliffe", "img_url": "https://m.media-amazon.com/images/M/MV5BZmE0NzNiNzQtYTVlYS00MjljLWE4MTgtYzYxNjU2NjZkM2M4XkEyXkFqcGdeQXVyNjY5NDgzNjQ@.jpg", "hash": "dbbf951c60edc3dd2dd608d7d4cc1905"}, {"celebrity_name": "Sarah Parish", "img_url": "https://m.media-amazon.com/images/M/MV5BMjAzMjM4OTY4Ml5BMl5BanBnXkFtZTcwNjcyNDM4Nw@@.jpg", "hash": "1325acd5ff1aad87c2cc96d6b3c97ed0"}, {"celebrity_name": "Brendan Fraser", "img_url": "https://m.media-amazon.com/images/M/MV5BMjA5MjExMzY0M15BMl5BanBnXkFtZTgwNTMxOTg4MTI@._V1_UY209_CR8,0,140,209_AL_.jpg", "hash": "f329464bc5324f81f8917923b71d3a7c"}, {"celebrity_name": "Harry Styles", "img_url": "https://m.media-amazon.com/images/M/MV5BMTUxMzU2MTk1OF5BMl5BanBnXkFtZTgwNzg4NjAwMzI@._V1_UY209_CR21,0,140,209_AL_.jpg", "hash": "a899db760e3c09121b591b36a88b0efb"}, {"celebrity_name": "Kirsten Dunst", "img_url": "https://m.media-amazon.com/images/M/MV5BMTQ3NzkwNzM1MV5BMl5BanBnXkFtZTgwMzE2MTQ3MjE@._V1_UY209_CR8,0,140,209_AL_.jpg", "hash": "73d733cfb174ae58b2bb50145135b8f2"}, {"celebrity_name": "Josie Davis", "img_url": "https://m.media-amazon.com/images/M/MV5BNTBhN2FlODQtOWQ1YS00NDM0LTk2MzgtMmVlOTZlOGYyMzNhXkEyXkFqcGdeQXVyMTIyNjIxMDY@._V1_UY209_CR10,0,140,209_AL_.jpg", "hash": "9d5cd9df8e6c0504a6ef23df5985bead"}, {"celebrity_name": "Tobey Maguire", "img_url": "https://m.media-amazon.com/images/M/MV5BMTYwMTI5NTM2OF5BMl5BanBnXkFtZTcwODk3MDQ2Mg@@._V1_UY209_CR3,0,140,209_AL_.jpg", "hash": "113af739c1a9f96627b62daa5d004088"}, {"celebrity_name": "Elizabeth Tulloch", "img_url": "https://m.media-amazon.com/images/M/MV5BNTMyMjlhZjAtOTRhNS00Y2RhLTk0ODUtZjk1NDkxMTBjOTk3XkEyXkFqcGdeQXVyNDU0NDY4MA@@.jpg", "hash": "359abde043cd3713025346138d7b2a58"}, {"celebrity_name": "Halsey", "img_url": "https://m.media-amazon.com/images/M/MV5BNzgxMjk5NjU0Nl5BMl5BanBnXkFtZTgwMDAyOTY4OTE@.jpg", "hash": "705ea7c9e6c8234bb46cc735755ea48d"}, {"celebrity_name": "Taika Waititi", "img_url": "https://m.media-amazon.com/images/M/MV5BMzk4MDIzNjcwNV5BMl5BanBnXkFtZTgwMTIyMjgwNDI@._V1_UY209_CR13,0,140,209_AL_.jpg", "hash": "66e870939ec3e99a3c998ae4bfa4ac06"}, {"celebrity_name": "Brian Cox", "img_url": "https://m.media-amazon.com/images/M/MV5BMTcyNzg4MzIwNl5BMl5BanBnXkFtZTcwNTI1NjYyMQ@@._V1_UY209_CR4,0,140,209_AL_.jpg", "hash": "7936da6d4a5a4fe26ba61ac1ab81648b"}, {"celebrity_name": "Kate Mara", "img_url": "https://m.media-amazon.com/images/M/MV5BMjE5MDY3OTE4MV5BMl5BanBnXkFtZTcwNTA0MDM5OQ@@._V1_UY209_CR60,0,140,209_AL_.jpg", "hash": "9a61c84175a6ec81c45c110f0ed1665c"}, {"celebrity_name": "Katheryn Winnick", "img_url": "https://m.media-amazon.com/images/M/MV5BZWE3NGE3NWUtNDA4NC00ODYyLThmMTgtNjQ4Y2ZkYzdmMmQ5XkEyXkFqcGdeQXVyMTE1MzA3MTI@._V1_UY209_CR87,0,140,209_AL_.jpg", "hash": "26071c7a20938263d720886131173d76"}, {"celebrity_name": "Jacob Elordi", "img_url": "https://m.media-amazon.com/images/M/MV5BNDE5NGRhNzMtZTRlMC00YzY0LWEzYzMtMTU1ZjAyMTBiNDRiXkEyXkFqcGdeQXVyNzAwNTgwOTk@._V1_UY209_CR81,0,140,209_AL_.jpg", "hash": "0a202783fa56335b42115d8f7daa80c6"}, {"celebrity_name": "Brad Pitt", "img_url": "https://m.media-amazon.com/images/M/MV5BMjA1MjE2MTQ2MV5BMl5BanBnXkFtZTcwMjE5MDY0Nw@@.jpg", "hash": "2e2ce69fad46ebde35f37c36ea880fe9"}, {"celebrity_name": "Sofia Black-D'Elia", "img_url": "https://m.media-amazon.com/images/M/MV5BMTY2NjA4MzQ3OV5BMl5BanBnXkFtZTgwMTkzMDc1MzI@.jpg", "hash": "e8a64f312d11dab1bc6478964b5492a5"}, {"celebrity_name": "Carrie-Anne Moss", "img_url": "https://m.media-amazon.com/images/M/MV5BMTYxMjgwNzEwOF5BMl5BanBnXkFtZTcwNTQ0NzI5Ng@@._V1_UY209_CR9,0,140,209_AL_.jpg", "hash": "a8f95b9e2e2a4fe2aeb5d84567ebb193"}, {"celebrity_name": "Skeet Ulrich", "img_url": "https://m.media-amazon.com/images/M/MV5BMTIzMjk5OTAyMF5BMl5BanBnXkFtZTYwMzUxNzA1._V1_UY209_CR4,0,140,209_AL_.jpg", "hash": "4d0af1c021eebce9fd703e1fd503c6c4"}, {"celebrity_name": "MyAnna Buring", "img_url": "https://m.media-amazon.com/images/M/MV5BMjcxNDgzMDE3Ml5BMl5BanBnXkFtZTgwODI2Njc3MDI@.jpg", "hash": "326aaa72e49e4c84a3e87dd11a8cc039"}, {"celebrity_name": "Ricky Gervais", "img_url": "https://m.media-amazon.com/images/M/MV5BMjQzOTEzMTk1M15BMl5BanBnXkFtZTgwODI1Mzc0MDI@.jpg", "hash": "694dc9c1c00042ab1d46d03f5db3234a"}, {"celebrity_name": "Tim McGraw", "img_url": "https://m.media-amazon.com/images/M/MV5BMjcyNTkyOTY4OV5BMl5BanBnXkFtZTcwODI2NzQ5Mg@@.jpg", "hash": "308557865dfca43d9bc81851f3253c0c"}, {"celebrity_name": "Megan Fox", "img_url": "https://m.media-amazon.com/images/M/MV5BMTc5MjgyMzk4NF5BMl5BanBnXkFtZTcwODk2OTM4Mg@@._V1_UY209_CR3,0,140,209_AL_.jpg", "hash": "8ea9d969eb19405fec6093832945a2c1"}, {"celebrity_name": "Lin-Manuel Miranda", "img_url": "https://m.media-amazon.com/images/M/MV5BMTU0MDM2Mzg0OV5BMl5BanBnXkFtZTgwMjA1MDE2MDI@.jpg", "hash": "a98350e0e2b9e041018584ad5b3ea8f5"}, {"celebrity_name": "Minka Kelly", "img_url": "https://m.media-amazon.com/images/M/MV5BMTA1MzcwNTQyNDJeQTJeQWpwZ15BbWU4MDMzMzY0NTgx._V1_UY209_CR3,0,140,209_AL_.jpg", "hash": "991a88300fef23d093664f5ef3a6dc09"}, {"celebrity_name": "Jim Carrey", "img_url": "https://m.media-amazon.com/images/M/MV5BMTQwMjAwNzI0M15BMl5BanBnXkFtZTcwOTY1MTMyOQ@@._V1_UY209_CR15,0,140,209_AL_.jpg", "hash": "0ace5bed27b578afdfca165a81642180"}, {"celebrity_name": "Kenneth Branagh", "img_url": "https://m.media-amazon.com/images/M/MV5BMjI0NTQ4Mjk5Ml5BMl5BanBnXkFtZTcwMDc1NjkzNw@@._V1_UY209_CR3,0,140,209_AL_.jpg", "hash": "cb43bddb711050ade8586728c68be99a"}, {"celebrity_name": "Olivia Wilde", "img_url": "https://m.media-amazon.com/images/M/MV5BMTg5NTc1NzgwOV5BMl5BanBnXkFtZTcwMTcyMjIzMQ@@._V1_UY209_CR13,0,140,209_AL_.jpg", "hash": "a061d8e4d7839afd9e87ebdeef0994d9"}, {"celebrity_name": "Emma Watson", "img_url": "https://m.media-amazon.com/images/M/MV5BMTQ3ODE2NTMxMV5BMl5BanBnXkFtZTgwOTIzOTQzMjE@._V1_UY209_CR14,0,140,209_AL_.jpg", "hash": "01082adcca93901fa26bcf420fda0707"}, {"celebrity_name": "Margot Robbie", "img_url": "https://m.media-amazon.com/images/M/MV5BMTgxNDcwMzU2Nl5BMl5BanBnXkFtZTcwNDc4NzkzOQ@@._V1_UY209_CR8,0,140,209_AL_.jpg", "hash": "4bd5f61a9829041fe6e90f65b0179c4a"}, {"celebrity_name": "Ryan Reynolds", "img_url": "https://m.media-amazon.com/images/M/MV5BOTI3ODk1MTMyNV5BMl5BanBnXkFtZTcwNDEyNTE2Mg@@._V1_UY209_CR5,0,140,209_AL_.jpg", "hash": "34de39db00e5d0d65b74de36f56eab6b"}, {"celebrity_name": "Sarah Snook", "img_url": "https://m.media-amazon.com/images/M/MV5BNDQxYjA0ZWYtNjU3Yi00NTRlLWJhOTUtZTFhYjM2OTVjYmFlXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY209_CR3,0,140,209_AL_.jpg", "hash": "ae3c09c902e5b7933ec668180fa6b484"}, {"celebrity_name": "Izabella Miko", "img_url": "https://m.media-amazon.com/images/M/MV5BMTg0MjU3MjkwMV5BMl5BanBnXkFtZTYwMDk2MzE1.jpg", "hash": "f21ab29179a2d0e85b3df086fe0cdf23"}, {"celebrity_name": "Geena Davis", "img_url": "https://m.media-amazon.com/images/M/MV5BOWU5MGMzMWYtYWQ1Ny00Njk0LTg3NTctZDgxOGUyNDhjNDJhXkEyXkFqcGdeQXVyMDM2NDM2MQ@@.jpg", "hash": "8c4bb7c571a1588009cc3567234a1255"}, {"celebrity_name": "Cynthia Addai-Robinson", "img_url": "https://m.media-amazon.com/images/M/MV5BYjRkMjIwNWItMjA4NS00YWUzLWE1YjQtOWMzZWFmOTZmODlhXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY209_CR8,0,140,209_AL_.jpg", "hash": "de75e735f549a7f28e96237a6c96a029"}, {"celebrity_name": "Emma Stone", "img_url": "https://m.media-amazon.com/images/M/MV5BMjI4NjM1NDkyN15BMl5BanBnXkFtZTgwODgyNTY1MjE@.jpg", "hash": "ad948164030a8980f96192e12f0af884"}, {"celebrity_name": "Harold Ramis", "img_url": "https://m.media-amazon.com/images/M/MV5BMTc5MTAwMzE3NF5BMl5BanBnXkFtZTYwNTg2ODMz.jpg", "hash": "7c374a98006b36490a71da5cae33d2f6"}, {"celebrity_name": "Gal Gadot", "img_url": "https://m.media-amazon.com/images/M/MV5BYThjM2NlOTItYTUzMC00ODE3LTk1MTItM2I3MDViY2U3MThlXkEyXkFqcGdeQXVyMTg4NDI0NDM@._V1_UY209_CR13,0,140,209_AL_.jpg", "hash": "fdc8677f7ddf3f8bd650eabd3c4e4001"}, {"celebrity_name": "Dakota Johnson", "img_url": "https://m.media-amazon.com/images/M/MV5BODE1ODE5MzY5M15BMl5BanBnXkFtZTgwNDg1NDA4NTM@._V1_UY209_CR34,0,140,209_AL_.jpg", "hash": "47d11d20ac09cd46d92dfe46f698cc67"}, {"celebrity_name": "Tanner Buchanan", "img_url": "https://m.media-amazon.com/images/M/MV5BYTY3Y2VmNTktMWIzZi00ZGUwLTg0MzktYWFmYTU2ZGQ5YmViXkEyXkFqcGdeQXVyMTkxNjUyNQ@@.jpg", "hash": "1ca95f92e1bcc7c08d785a6faad9bd07"}, {"celebrity_name": "Robert Patrick", "img_url": "https://m.media-amazon.com/images/M/MV5BMTYzMzg5OTU4M15BMl5BanBnXkFtZTgwNDIzMTQxNjM@.jpg", "hash": "34cdb4607138fc9643f973b178c34048"}, {"celebrity_name": "Mahershala Ali", "img_url": "https://m.media-amazon.com/images/M/MV5BNjQ1MGQ3Y2EtYTgwMS00NTQyLTk1MTUtZGQ3NDQyY2YyM2Q3XkEyXkFqcGdeQXVyMTY5MzAyMDE@._V1_UY209_CR5,0,140,209_AL_.jpg", "hash": "36d43ad1b808b0c62a557567f6280ddb"}, {"celebrity_name": "Courteney Cox", "img_url": "https://m.media-amazon.com/images/M/MV5BMTA4OTczNDExNDNeQTJeQWpwZ15BbWU3MDUyNTIzMTM@._V1_UY209_CR5,0,140,209_AL_.jpg", "hash": "6b8e00c3c65ea653521f36d28927e331"}, {"celebrity_name": "Sandra Bullock", "img_url": "https://m.media-amazon.com/images/M/MV5BMTI5NDY5NjU3NF5BMl5BanBnXkFtZTcwMzQ0MTMyMw@@._V1_UY209_CR1,0,140,209_AL_.jpg", "hash": "a80053ea6a1a7993d22da4da1ed126e4"}, {"celebrity_name": "Julia Jones", "img_url": "https://m.media-amazon.com/images/M/MV5BMzQyNjY0ODg4NV5BMl5BanBnXkFtZTcwNzQ4ODM3OA@@._V1_UY209_CR13,0,140,209_AL_.jpg", "hash": "2253926c5a6012b2abee27952a540fd6"}, {"celebrity_name": "Marisa Tomei", "img_url": "https://m.media-amazon.com/images/M/MV5BMTUwMjA3OTc3N15BMl5BanBnXkFtZTcwNTA1MzY1Mw@@._V1_UY209_CR8,0,140,209_AL_.jpg", "hash": "9537098631e1ce77e6520129191b0a44"}, {"celebrity_name": "Scarlett Johansson", "img_url": "https://m.media-amazon.com/images/M/MV5BMTM3OTUwMDYwNl5BMl5BanBnXkFtZTcwNTUyNzc3Nw@@._V1_UY209_CR16,0,140,209_AL_.jpg", "hash": "299663f4c88cd08ca425abca4a0fb80c"}, {"celebrity_name": "Rose Leslie", "img_url": "https://m.media-amazon.com/images/M/MV5BMjUxMjI4MDEwM15BMl5BanBnXkFtZTgwNzMyODM0MTE@.jpg", "hash": "d985bdc3af0d2a6278e49ca693761357"}, {"celebrity_name": "Karen Gillan", "img_url": "https://m.media-amazon.com/images/M/MV5BMTQwMDQ0NDk1OV5BMl5BanBnXkFtZTcwNDcxOTExNg@@._V1_UY209_CR2,0,140,209_AL_.jpg", "hash": "2612d3ea14117ab364fc5cc4b801bda3"}, {"celebrity_name": "Stephen Root", "img_url": "https://m.media-amazon.com/images/M/MV5BMTQ3MDA3OTA5OF5BMl5BanBnXkFtZTcwMjQ4MDU0NA@@._V1_UY209_CR4,0,140,209_AL_.jpg", "hash": "9dabff558056bf96437310d96e6c8a50"}, {"celebrity_name": "Mary Mouser", "img_url": "https://m.media-amazon.com/images/M/MV5BNDMxNTU4MzgtYzMxOC00NmY2LTg2MzItOTVhMDIwNzQyMzRkXkEyXkFqcGdeQXVyOTIxMjA2MDc@.jpg", "hash": "a016ffeff5191a5c4df9905ae2175edd"}, {"celebrity_name": "Isla Fisher", "img_url": "https://m.media-amazon.com/images/M/MV5BODY3MDQ4MTQ4Nl5BMl5BanBnXkFtZTgwNDU2NzU1MDE@._V1_UY209_CR14,0,140,209_AL_.jpg", "hash": "748d2e43d0e2dd2f15dc9744df318c76"}, {"celebrity_name": "Jennifer Connelly", "img_url": "https://m.media-amazon.com/images/M/MV5BOTczNTgzODYyMF5BMl5BanBnXkFtZTcwNjk4ODk4Mw@@._V1_UY209_CR8,0,140,209_AL_.jpg", "hash": "ccb9eef0574bcb19fef8f4434cd1d76f"}, {"celebrity_name": "Jen Landon", "img_url": "https://m.media-amazon.com/images/M/MV5BMDc2YzI1MDMtODZjNS00YWUxLWI3NjEtM2JmODczNmNlMTg1XkEyXkFqcGdeQXVyMTA2MDIzMDE5.jpg", "hash": "61539378cf0c98c3f0293d81001ecc5f"}, {"celebrity_name": "Faith Hill", "img_url": "https://m.media-amazon.com/images/M/MV5BMTYxNzEzMTgzNF5BMl5BanBnXkFtZTcwNDQ3MTMyMw@@._V1_UY209_CR6,0,140,209_AL_.jpg", "hash": "159c970cded7ca642f7d60732ec3a714"}, {"celebrity_name": "James Nesbitt", "img_url": "https://m.media-amazon.com/images/M/MV5BMTg2NTk3OTA1Nl5BMl5BanBnXkFtZTcwNjg5NzY4Mw@@._V1_UY209_CR2,0,140,209_AL_.jpg", "hash": "bfe17257d0e7ea4a117cacd5a56016ee"}, {"celebrity_name": "Tom Hanks", "img_url": "https://m.media-amazon.com/images/M/MV5BMTQ2MjMwNDA3Nl5BMl5BanBnXkFtZTcwMTA2NDY3NQ@@._V1_UY209_CR2,0,140,209_AL_.jpg", "hash": "e285eb26fb34e1144afd01d149f6d94f"}, {"celebrity_name": "Ashley Jensen", "img_url": "https://m.media-amazon.com/images/M/MV5BMTMzNTUyMjY4M15BMl5BanBnXkFtZTcwMDQ4MDkxNw@@.jpg", "hash": "d20cc23c91535992071fc347c680eff0"}, {"celebrity_name": "Jason Momoa", "img_url": "https://m.media-amazon.com/images/M/MV5BODJlNWQ4ZjUtYjRhNi00NGQ1LWE3YTItYjRmZGI3YzI4YTEyXkEyXkFqcGdeQXVyMTA2MDIzMDE5._V1_UY209_CR87,0,140,209_AL_.jpg", "hash": "abf8e3b0f383a4b40f696bebc8adabff"}, {"celebrity_name": "Lochlyn Munro", "img_url": "https://m.media-amazon.com/images/M/MV5BMTM4NTY0NjAxMV5BMl5BanBnXkFtZTcwNTI2MzM1OQ@@._V1_UY209_CR87,0,140,209_AL_.jpg", "hash": "ad366e1ff210a7c57d53ad9b145ccab6"}, {"celebrity_name": "Taron Egerton", "img_url": "https://m.media-amazon.com/images/M/MV5BMTYzODU2OTI2Nl5BMl5BanBnXkFtZTgwMTUyMTAwMzE@._V1_UY209_CR5,0,140,209_AL_.jpg", "hash": "0359bebdc089cc288956e360c83f698d"}, {"celebrity_name": "Monica Bellucci", "img_url": "https://m.media-amazon.com/images/M/MV5BMTI2MzM5Njk1OF5BMl5BanBnXkFtZTYwMjA5OTgz._V1_UY209_CR3,0,140,209_AL_.jpg", "hash": "69890c627d0dc434285dd2e0173920a7"}, {"celebrity_name": "Hannah Waddingham", "img_url": "https://m.media-amazon.com/images/M/MV5BNjk5ODc5MTU3MF5BMl5BanBnXkFtZTgwOTk2MjI5NDE@.jpg", "hash": "6ce3865537bf480322fd66b639e54764"}, {"celebrity_name": "Nicolas Cage", "img_url": "https://m.media-amazon.com/images/M/MV5BMjUxMjE4MTQxMF5BMl5BanBnXkFtZTcwNzc2MDM1NA@@._V1_UY209_CR6,0,140,209_AL_.jpg", "hash": "14469110d3adac8181be4cc356f930d6"}, {"celebrity_name": "Michael C. Hall", "img_url": "https://m.media-amazon.com/images/M/MV5BNDYwMzkwNjc0Ml5BMl5BanBnXkFtZTcwMDU1NTMzNw@@.jpg", "hash": "8888ecec994fb5131ae9180444d4ed7d"}, {"celebrity_name": "William Zabka", "img_url": "https://m.media-amazon.com/images/M/MV5BMzlkODQ0ODMtYmQ5NS00MWZhLTlkMjAtYTMwYzg5MjNkNmFmXkEyXkFqcGdeQXVyMjUwNzgxNjk@._V1_UY209_CR15,0,140,209_AL_.jpg", "hash": "c03a6a8a5fdde361a861f93990d7df3d"}, {"celebrity_name": "Johnny Depp", "img_url": "https://m.media-amazon.com/images/M/MV5BMTM0ODU5Nzk2OV5BMl5BanBnXkFtZTcwMzI2ODgyNQ@@._V1_UY209_CR3,0,140,209_AL_.jpg", "hash": "ac78041445d0771c72726693487060f7"}, {"celebrity_name": "Natassia Malthe", "img_url": "https://m.media-amazon.com/images/M/MV5BNjczNjk3NzkzNV5BMl5BanBnXkFtZTYwNDI0Nzk2.jpg", "hash": "672b208540bc5e1504c43a300201435a"}, {"celebrity_name": "Jessica Chastain", "img_url": "https://m.media-amazon.com/images/M/MV5BMTU1MDM5NjczOF5BMl5BanBnXkFtZTcwOTY2MDE4OA@@._V1_UY209_CR0,0,140,209_AL_.jpg", "hash": "6986f13ee197f9e6cc6788450b3bad41"}, {"celebrity_name": "Yvonne Strahovski", "img_url": "https://m.media-amazon.com/images/M/MV5BMzI5NDIzNTQ1Nl5BMl5BanBnXkFtZTgwMjQ0Mzc1MTE@._V1_UY209_CR3,0,140,209_AL_.jpg", "hash": "38a6d33af56b917e3ddf7c6d88ead69b"}, {"celebrity_name": "Marsha Thomason", "img_url": "https://m.media-amazon.com/images/M/MV5BMTAwOTQ0OTAxNDdeQTJeQWpwZ15BbWU3MDYwODQ4NTg@.jpg", "hash": "40b063b38068be2021ecdea588be1951"}, {"celebrity_name": "Travis Fimmel", "img_url": "https://m.media-amazon.com/images/M/MV5BNzMzNTcwMTkxN15BMl5BanBnXkFtZTgwMTgwMDE1MzI@.jpg", "hash": "fd526fee181c65d8275d126d474c6d25"}, {"celebrity_name": "Willa Fitzgerald", "img_url": "https://m.media-amazon.com/images/M/MV5BNTk5MDIyMzgzOF5BMl5BanBnXkFtZTgwNTI4MzA3MDE@._V1_UY209_CR11,0,140,209_AL_.jpg", "hash": "50c6b95bedc99b716c1fe552c32a4e28"}, {"celebrity_name": "Alicia Vikander", "img_url": "https://m.media-amazon.com/images/M/MV5BMzg1MzQyYTktN2U3Ni00ZTQ2LThkMjEtODcxY2UyNmM5ZDBhXkEyXkFqcGdeQXVyMTExNzQ3MzAw._V1_UY209_CR29,0,140,209_AL_.jpg", "hash": "3551cf1d9172a8a27f9ac77da0a41432"}, {"celebrity_name": "Rooney Mara", "img_url": "https://m.media-amazon.com/images/M/MV5BMTM2NDE3MDk1OF5BMl5BanBnXkFtZTcwNjI1MDY0Nw@@._V1_UY209_CR2,0,140,209_AL_.jpg", "hash": "3b078efac1c7290fde27f654fe502b7e"}, {"celebrity_name": "Cillian Murphy", "img_url": "https://m.media-amazon.com/images/M/MV5BMTUzMjg1NzIyOV5BMl5BanBnXkFtZTYwMzg2Mjgy._V1_UY209_CR0,0,140,209_AL_.jpg", "hash": "a43746d58f0ca27a2321f10025ad4b2a"}, {"celebrity_name": "Priyanka Chopra Jonas", "img_url": "https://m.media-amazon.com/images/M/MV5BMjAxNzUwNjExOV5BMl5BanBnXkFtZTcwNDUyMTUxNw@@._V1_UY209_CR70,0,140,209_AL_.jpg", "hash": "a8f6f96a47aa9083dab384f4c16ced15"}, {"celebrity_name": "Edi Patterson", "img_url": "https://m.media-amazon.com/images/M/MV5BZDQ4ODc5YTAtMDhiOC00NWM0LWEwY2EtNTI1Y2JjOGZjZGU1XkEyXkFqcGdeQXVyMjQwMDg0Ng@@.jpg", "hash": "8b51b0a56405f5c86455bdc86459b2a8"}, {"celebrity_name": "Barbie Ferreira", "img_url": "https://m.media-amazon.com/images/M/MV5BNzI2Y2E4ODQtYTNiMC00YzJhLWE2N2YtNDljY2M1MjQyMjMwXkEyXkFqcGdeQXVyNzAzNzE5OTM@._V1_UY209_CR8,0,140,209_AL_.jpg", "hash": "be78c15acbbd2ad897db5bd360aaf3a6"}, {"celebrity_name": "Jamie Dornan", "img_url": "https://m.media-amazon.com/images/M/MV5BMjQwMDAzMjAyM15BMl5BanBnXkFtZTgwMjAxMzc0MjE@._V1_UY209_CR12,0,140,209_AL_.jpg", "hash": "7b0e5fd6e71dbf7c7ff4a47d521a4edd"}, {"celebrity_name": "Morena Baccarin", "img_url": "https://m.media-amazon.com/images/M/MV5BNmU5Yjk4OTItMjMzZS00MTYzLWI1ZDktYWM4YWM2NTM2YzMzXkEyXkFqcGdeQXVyMzY2OTA2MzM@._V1_UY209_CR8,0,140,209_AL_.jpg", "hash": "39d72938dd10850b07e65ea45867dfbd"}, {"celebrity_name": "Drea de Matteo", "img_url": "https://m.media-amazon.com/images/M/MV5BMTU0MzE3ODMxMl5BMl5BanBnXkFtZTcwOTk2ODY3Mg@@._V1_UY209_CR3,0,140,209_AL_.jpg", "hash": "bbfaa8b382caeda5df806150a260a36b"}, {"celebrity_name": "Danielle Macdonald", "img_url": "https://m.media-amazon.com/images/M/MV5BODJlNGU1YjctODNlNi00ZDYzLWJmODItZmY1ZWYwN2UzM2U1XkEyXkFqcGdeQXVyMjMwMTkzMDA@._V1_UY209_CR18,0,140,209_AL_.jpg", "hash": "69193dea73b69921630e6996465ae7d3"}, {"celebrity_name": "Laura Marano", "img_url": "https://m.media-amazon.com/images/M/MV5BYjZjZWIzNjktYmYxMy00YzE4LThlZGItZTI2MTNmMjY1ODQzXkEyXkFqcGdeQXVyMjIxMTM5NDk@._V1_UY209_CR56,0,140,209_AL_.jpg", "hash": "fa4eb0ceaf921231481b869811b6e835"}, {"celebrity_name": "Anna Shaffer", "img_url": "https://m.media-amazon.com/images/M/MV5BYjA2ODZhNDYtMTRiMC00NDRkLTk3NDAtMzkyYTZhOTgxZjJhXkEyXkFqcGdeQXVyMTkxNjUyNQ@@.jpg", "hash": "47660db7f84356e7d44e5e4b3768b323"}, {"celebrity_name": "Will Smith", "img_url": "https://m.media-amazon.com/images/M/MV5BNTczMzk1MjU1MV5BMl5BanBnXkFtZTcwNDk2MzAyMg@@._V1_UY209_CR2,0,140,209_AL_.jpg", "hash": "be94a140a9fda192648c99bbdc3d46ee"}, {"celebrity_name": "Benjamin Walker", "img_url": "https://m.media-amazon.com/images/M/MV5BMjAxOTI2NzQ3NF5BMl5BanBnXkFtZTgwMTgzMTY5ODE@._V1_UY209_CR44,0,140,209_AL_.jpg", "hash": "14fbf4a06b2383433d9c5d6f485a12bc"}, {"celebrity_name": "Paul Thomas Anderson", "img_url": "https://m.media-amazon.com/images/M/MV5BMTQwNjc5NjY2NV5BMl5BanBnXkFtZTcwNDIxMzg1MQ@@.jpg", "hash": "29e79f5af00b61cc2fdfd7c39ec036ae"}, {"celebrity_name": "Mary Elizabeth Winstead", "img_url": "https://m.media-amazon.com/images/M/MV5BMGNhZDVjM2MtMGQ2Mi00ZjRmLWJkZDUtYmMzOWZjMWFmNGUxXkEyXkFqcGdeQXVyMTkxNjUyNQ@@._V1_UY209_CR2,0,140,209_AL_.jpg", "hash": "bd9ac03ef765e786221a519594576f4f"}, {"celebrity_name": "Walton Goggins", "img_url": "https://m.media-amazon.com/images/M/MV5BYzYyNmUwMmItYzE4YS00ZTQxLWJiNjUtNzA0OGIzZGYzNDk2XkEyXkFqcGdeQXVyNDg4OTQzNjg@.jpg", "hash": "1f24065899215787073a0ac1fe1c06c5"}, {"celebrity_name": "Jasmin Savoy Brown", "img_url": "https://m.media-amazon.com/images/M/MV5BMDlhODM4NTItODZlNi00MTA1LThkZmMtZDVkMTM1ZWZjMTMzXkEyXkFqcGdeQXVyNDc3MjUxODA@._V1_UY209_CR4,0,140,209_AL_.jpg", "hash": "68faaeb1f29a04ec1b2a6076564bf884"}, {"celebrity_name": "Kathryn Hahn", "img_url": "https://m.media-amazon.com/images/M/MV5BMjE1OTcxNDczMl5BMl5BanBnXkFtZTcwMDA1NDcyMQ@@._V1_UY209_CR10,0,140,209_AL_.jpg", "hash": "7f79a8421595ca139c3e757b4a85b760"}, {"celebrity_name": "Clint Eastwood", "img_url": "https://m.media-amazon.com/images/M/MV5BMTg3MDc0MjY0OV5BMl5BanBnXkFtZTcwNzU1MDAxOA@@._V1_UY209_CR7,0,140,209_AL_.jpg", "hash": "81e6915bde0e5a054762bbca68e41fd5"}, {"celebrity_name": "Dwayne Johnson", "img_url": "https://m.media-amazon.com/images/M/MV5BMTkyNDQ3NzAxM15BMl5BanBnXkFtZTgwODIwMTQ0NTE@.jpg", "hash": "17a086c77a531d4e91cfffbf54e3300d"}, {"celebrity_name": "Jason Bateman", "img_url": "https://m.media-amazon.com/images/M/MV5BMTMwOTQ0MDUyNF5BMl5BanBnXkFtZTcwNTQ1MzY1Mw@@._V1_UY209_CR12,0,140,209_AL_.jpg", "hash": "2e0adfad84316f13fdba3300099ccca1"}, {"celebrity_name": "Sebastian Stan", "img_url": "https://m.media-amazon.com/images/M/MV5BNTk2OGU4NzktODhhOC00Nzc2LWIyNzYtOWViMjljZGFiNTMxXkEyXkFqcGdeQXVyMTE1NTQwOTk@._V1_UY209_CR10,0,140,209_AL_.jpg", "hash": "58b19dd01d20786ebd4b2b2bb68aa352"}, {"celebrity_name": "Margaret Qualley", "img_url": "https://m.media-amazon.com/images/M/MV5BYWZmMDFlMDYtYzk3My00YTg1LTllZWUtYzY2Y2QyNjk2NTZmXkEyXkFqcGdeQXVyMzcxMTAwMDM@._V1_UY209_CR52,0,140,209_AL_.jpg", "hash": "e370fd9f72c86c9c7c193a11d5220528"}, {"celebrity_name": "Kathryn Hunter", "img_url": "https://m.media-amazon.com/images/M/MV5BMjAyNDQxMDgwMl5BMl5BanBnXkFtZTgwNDM3MjI2MjE@._V1_UY209_CR116,0,140,209_AL_.jpg", "hash": "3d34035379293e16230f56c4717d49d0"}, {"celebrity_name": "Nora Arnezeder", "img_url": "https://m.media-amazon.com/images/M/MV5BY2U1ODE1NTMtNzRmMS00YjgxLTg0YTMtOGRmNGU2OTJlMjM3XkEyXkFqcGdeQXVyMjQwMDg0Ng@@.jpg", "hash": "20972458f40a1829f28f5af6f23350c6"}, {"celebrity_name": "Hannah John-Kamen", "img_url": "https://m.media-amazon.com/images/M/MV5BZGMwMmNmNWItZWI4Mi00OWY5LThjZmUtMjg2NDcxZDljYjYyXkEyXkFqcGdeQXVyMDM2NDM2MQ@@.jpg", "hash": "5428c7c9cb877d59a02c44032c06f034"}, {"celebrity_name": "Dagmara Dominczyk", "img_url": "https://m.media-amazon.com/images/M/MV5BMTIzOTMzMTg5NV5BMl5BanBnXkFtZTYwODIzMDEz._V1_UY209_CR13,0,140,209_AL_.jpg", "hash": "34a47f0233be9d228163e66c03edbb0f"}, {"celebrity_name": "Jon Bernthal", "img_url": "https://m.media-amazon.com/images/M/MV5BMTcwNzA5MDg0OV5BMl5BanBnXkFtZTcwMTU2NjE0Nw@@._V1_UY209_CR6,0,140,209_AL_.jpg", "hash": "770d82ecc489627e383281cf9ce0b13e"}, {"celebrity_name": "Kathleen Robertson", "img_url": "https://m.media-amazon.com/images/M/MV5BMTU1ODUyNzI3Nl5BMl5BanBnXkFtZTgwNjEyNzMxMDE@._V1_UY209_CR34,0,140,209_AL_.jpg", "hash": "71d72993ee9526c92b1f3e9f458901cd"}, {"celebrity_name": "Kim Cattrall", "img_url": "https://m.media-amazon.com/images/M/MV5BMTU4NjMyMjAyMV5BMl5BanBnXkFtZTcwMDk1ODQ5MQ@@._V1_UY209_CR0,0,140,209_AL_.jpg", "hash": "d0599dffe83d6ec83f94c45376f8e7b5"}, {"celebrity_name": "Sophia Bush", "img_url": "https://m.media-amazon.com/images/M/MV5BODI2MzM0MTkzM15BMl5BanBnXkFtZTgwMjQxMzgwNTM@._V1_UY209_CR10,0,140,209_AL_.jpg", "hash": "5f28ed198689784aec2db84d01495e24"}, {"celebrity_name": "Rose McIver", "img_url": "https://m.media-amazon.com/images/M/MV5BOTAzZWZjZjUtYmYxMi00MmYwLWFlOGMtYjNiMTlhZGVhMjM1XkEyXkFqcGdeQXVyNTc3Njg0MTY@.jpg", "hash": "c5bed60e9841bf9e054e263adc225277"}, {"celebrity_name": "Thomasin McKenzie", "img_url": "https://m.media-amazon.com/images/M/MV5BOWRlYTk0YjAtMDNkNy00ZDlmLTk4NzktOWJiYWFmNzcyY2Y0XkEyXkFqcGdeQXVyOTE0NjgwMjY@._V1_UY209_CR2,0,140,209_AL_.jpg", "hash": "03dac09ca550e0ec6dacd7dea5327e20"}, {"celebrity_name": "Shohreh Aghdashloo", "img_url": "https://m.media-amazon.com/images/M/MV5BZDI0M2Q1NzYtYzIxNy00MWE4LTg4NDgtOWRhZDdkYTAxZTBhXkEyXkFqcGdeQXVyNTY3MzA5MzA@._V1_UY209_CR6,0,140,209_AL_.jpg", "hash": "b514bf828a65e9bd4abd68e64d1908d5"}, {"celebrity_name": "Hero Fiennes Tiffin", "img_url": "https://m.media-amazon.com/images/M/MV5BMjI3MzkyMjE2M15BMl5BanBnXkFtZTgwNzIzODU0NzM@._V1_UY209_CR13,0,140,209_AL_.jpg", "hash": "1546afb1922f7a91affddf1663906155"}, {"celebrity_name": "Jenna Fischer", "img_url": "https://m.media-amazon.com/images/M/MV5BMTMyOTYzODQ5MF5BMl5BanBnXkFtZTcwMjE3MDgzMQ@@._V1_UY209_CR13,0,140,209_AL_.jpg", "hash": "67fa4e39f41721bf1d4d28082ae74e96"}, {"celebrity_name": "Natalie Portman", "img_url": "https://m.media-amazon.com/images/M/MV5BYzU0ZGRhZWItMGJlNy00YzlkLWIzOWYtNDA2NzlhMDg3YjMwXkEyXkFqcGdeQXVyMDM2NDM2MQ@@.jpg", "hash": "04b5fb50edd2f3d1ceeff0e31b7686d1"}, {"celebrity_name": "Matt Damon", "img_url": "https://m.media-amazon.com/images/M/MV5BMTM0NzYzNDgxMl5BMl5BanBnXkFtZTcwMDg2MTMyMw@@._V1_UY209_CR8,0,140,209_AL_.jpg", "hash": "4917cf89e56b4a1cbb29ef390e951559"}, {"celebrity_name": "Elizabeth Olsen", "img_url": "https://m.media-amazon.com/images/M/MV5BMjEzMjA0ODk1OF5BMl5BanBnXkFtZTcwMTA4ODM3OQ@@._V1_UY209_CR4,0,140,209_AL_.jpg", "hash": "0786a410fb4d9348d1667bd39a94caed"}, {"celebrity_name": "Caitriona Balfe", "img_url": "https://m.media-amazon.com/images/M/MV5BZTM4ZDBhYWMtZmQ0Ny00YjI0LWFhMTEtM2IwNmZlZGQwYzJhXkEyXkFqcGdeQXVyMjA2Nzk2MDc@._V1_UY209_CR6,0,140,209_AL_.jpg", "hash": "a65138bdaeb82bd99a27156e5bf26a07"}, {"celebrity_name": "Bryce Dallas Howard", "img_url": "https://m.media-amazon.com/images/M/MV5BNzExZDkyNWItMDYzNS00MGVlLTllZTctMjYyZGE1MmY0MThhXkEyXkFqcGdeQXVyMDA4NzMyOA@@._V1_UY209_CR13,0,140,209_AL_.jpg", "hash": "a39e77811490e0856828f9588cd54f5d"}, {"celebrity_name": "Ridley Scott", "img_url": "https://m.media-amazon.com/images/M/MV5BMGJkOGM5OWEtNDYxMy00Njg4LWExNjAtY2ZlNWNlNzVhNDk4XkEyXkFqcGdeQXVyNDkzNTM2ODg@.jpg", "hash": "bd4615ab4a20962dcfb1b080388513e7"}, {"celebrity_name": "Ethan Hawke", "img_url": "https://m.media-amazon.com/images/M/MV5BMTk4NDMxMTI0MF5BMl5BanBnXkFtZTYwMjE3ODE0._V1_UY209_CR4,0,140,209_AL_.jpg", "hash": "467736f24123a4997ce538339f8926bb"}, {"celebrity_name": "Emilia Clarke", "img_url": "https://m.media-amazon.com/images/M/MV5BNjg3OTg4MDczMl5BMl5BanBnXkFtZTgwODc0NzUwNjE@.jpg", "hash": "f7d0e82a233869ae5e8a01508ab7e5cc"}, {"celebrity_name": "Bradley Cooper", "img_url": "https://m.media-amazon.com/images/M/MV5BMjM0OTIyMzY1M15BMl5BanBnXkFtZTgwMTg0OTE0NzE@.jpg", "hash": "48e2bb4c8aa051f9a0c19fb98af0edc8"}, {"celebrity_name": "Olivia Colman", "img_url": "https://m.media-amazon.com/images/M/MV5BMTY4MzU2ODIzNl5BMl5BanBnXkFtZTgwMTM2OTA1NzM@.jpg", "hash": "d1b645def0f6e9ace525e5f7e8e87729"}, {"celebrity_name": "Chris Evans", "img_url": "https://m.media-amazon.com/images/M/MV5BMTU2NTg1OTQzMF5BMl5BanBnXkFtZTcwNjIyMjkyMg@@._V1_UY209_CR4,0,140,209_AL_.jpg", "hash": "e97db07e13b2aee1f38e98f8ba0ad0de"}, {"celebrity_name": "Adam Driver", "img_url": "https://m.media-amazon.com/images/M/MV5BOWViYjUzOWMtMzRkZi00MjNkLTk4M2ItMTVkMDg5MzE2ZDYyXkEyXkFqcGdeQXVyODQwNjM3NDA@._V1_UY209_CR29,0,140,209_AL_.jpg", "hash": "3d538a205557e6220f2fbb75a967fbbf"}, {"celebrity_name": "James Gunn", "img_url": "https://m.media-amazon.com/images/M/MV5BMTYxMDgzMjA5OV5BMl5BanBnXkFtZTcwMzMwMTUxNw@@._V1_UY209_CR8,0,140,209_AL_.jpg", "hash": "94265b3b0872296750c50e75b1173c20"}, {"celebrity_name": "Eric Dane", "img_url": "https://m.media-amazon.com/images/M/MV5BMTk3NDE1ODczMV5BMl5BanBnXkFtZTcwMzE2MDU1Mw@@._V1_UY209_CR16,0,140,209_AL_.jpg", "hash": "6c419608ad7253b919fc706909a1bd53"}, {"celebrity_name": "Daniel Craig", "img_url": "https://m.media-amazon.com/images/M/MV5BMjEzMjk4NDU4MF5BMl5BanBnXkFtZTcwMDMyNjQzMg@@._V1_UY209_CR0,0,140,209_AL_.jpg", "hash": "03d322eecf49e70fbed8c42f505850b2"}, {"celebrity_name": "Jeremy Strong", "img_url": "https://m.media-amazon.com/images/M/MV5BYjM4M2M5MjAtMTg1MC00MjczLWI5NmQtZTI0MjJiODMyYTZlXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY209_CR5,0,140,209_AL_.jpg", "hash": "b273cc29e43529d3cc83a67575678df1"}, {"celebrity_name": "Karl Urban", "img_url": "https://m.media-amazon.com/images/M/MV5BMjA5NzY5OTY0Ml5BMl5BanBnXkFtZTgwMzcwNjY0MTI@._V1_UY209_CR67,0,140,209_AL_.jpg", "hash": "733107802c87d822daeba3efc8b7d2b2"}, {"celebrity_name": "Zoë Kravitz", "img_url": "https://m.media-amazon.com/images/M/MV5BMWJiYzFjYWQtNWEwMS00ODQ0LWI5NDktMTNkOTcwOWVjNjk5XkEyXkFqcGdeQXVyNjk2NTA3MTc@._V1_UY209_CR69,0,140,209_AL_.jpg", "hash": "7aa8784e8d94f44b435773f80d51556b"}, {"celebrity_name": "Kieran Culkin", "img_url": "https://m.media-amazon.com/images/M/MV5BYzZkNzYyNTYtMDY2ZS00YmI4LWI5YzctZjBiN2FkY2NkNWMyXkEyXkFqcGdeQXVyMTkxNjUyNQ@@.jpg", "hash": "85087f34faf34e25c885aab94fc00911"}, {"celebrity_name": "Emily Osment", "img_url": "https://m.media-amazon.com/images/M/MV5BZTZkM2Q4ZWYtZmUxMy00YWViLWI5NjctZjcyYzk2Y2VkODgwXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY209_CR33,0,140,209_AL_.jpg", "hash": "cbaf1b05a7c10c4bc3e94bcfdbb44100"}, {"celebrity_name": "Timothy Olyphant", "img_url": "https://m.media-amazon.com/images/M/MV5BMTc2NzY0OTA2Ml5BMl5BanBnXkFtZTYwNDYzODgz._V1_UY209_CR3,0,140,209_AL_.jpg", "hash": "0109ce552f2f7e8037674418f1ecfb31"}, {"celebrity_name": "Joss Whedon", "img_url": "https://m.media-amazon.com/images/M/MV5BMTg5MzQ0MDA4MF5BMl5BanBnXkFtZTcwNzUwOTk4OQ@@._V1_UY209_CR9,0,140,209_AL_.jpg", "hash": "fc11b874bc5730bf320f56d225e8f7fc"}, {"celebrity_name": "John Krasinski", "img_url": "https://m.media-amazon.com/images/M/MV5BMTc3MzY3MjQ3OV5BMl5BanBnXkFtZTcwODI3NjQxMw@@._V1_UY209_CR5,0,140,209_AL_.jpg", "hash": "80e1e80b7144810265e685b739e8d2a1"}, {"celebrity_name": "Mandeep Dhillon", "img_url": "https://m.media-amazon.com/images/M/MV5BNDAwNjg5M2UtNWFhMS00MDUzLThhODItNzE0MTc1ZDJkODNkXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_UY209_CR69,0,140,209_AL_.jpg", "hash": "2ab4b57b9ea858ef415701817927cc30"}, {"celebrity_name": "Tye Sheridan", "img_url": "https://m.media-amazon.com/images/M/MV5BOTJjODlmNjAtNjE3Ny00NzIwLTkwMjItOWY1MzM4ZDM1ZTM5XkEyXkFqcGdeQXVyNzczNzg0ODc@.jpg", "hash": "41f4c9300ecf1f515e718a27a2d18ec8"}, {"celebrity_name": "Laura Linney", "img_url": "https://m.media-amazon.com/images/M/MV5BMTMyMDc3Mzc2M15BMl5BanBnXkFtZTcwMjc5OTcyMg@@._V1_UY209_CR5,0,140,209_AL_.jpg", "hash": "13cfd08f5162db017085c21167c9be15"}, {"celebrity_name": "Sam Elliott", "img_url": "https://m.media-amazon.com/images/M/MV5BMTU0NTk4NDgzMl5BMl5BanBnXkFtZTYwNjU5Nzc1.jpg", "hash": "a31cb465aef779005a83b2f5f0254426"}, {"celebrity_name": "May Calamawy", "img_url": "https://m.media-amazon.com/images/M/MV5BYWViYWU1MjQtZmYwMy00ZjUyLTkyYzgtMmZhMmUwNDU0ZTI4XkEyXkFqcGdeQXVyNDAzNDk0MTQ@._V1_UY209_CR34,0,140,209_AL_.jpg", "hash": "04403debee7e3117f383e21a1586e52d"}, {"celebrity_name": "Jon Favreau", "img_url": "https://m.media-amazon.com/images/M/MV5BNjcwNzg4MjktNDNlMC00M2U1LWJmMjgtZTVkMmI4MDI2MTVmXkEyXkFqcGdeQXVyMjI4MDI0NTM@._V1_UY209_CR8,0,140,209_AL_.jpg", "hash": "eaf7c4e52c2b630e0798614de47a3ae5"}, {"celebrity_name": "Haley Bennett", "img_url": "https://m.media-amazon.com/images/M/MV5BZWEyOTUzNzgtZmQ2My00NTg4LTgyNGYtNzQ5MGYwMjY3OGM1XkEyXkFqcGdeQXVyNjA0OTkxNjQ@.jpg", "hash": "66f4a036b6932368e2b344f5b0b0ab7a"}, {"celebrity_name": "Wes Anderson", "img_url": "https://m.media-amazon.com/images/M/MV5BMTY1MjgzODIwNF5BMl5BanBnXkFtZTcwNTM2NzExMw@@._V1_UY209_CR7,0,140,209_AL_.jpg", "hash": "4c1b169d3e6d89ec64cfcb65d4c432ef"}, {"celebrity_name": "Ralph Macchio", "img_url": "https://m.media-amazon.com/images/M/MV5BMjExMjk0NTA5MF5BMl5BanBnXkFtZTcwMjM4MzU1Mw@@._V1_UY209_CR3,0,140,209_AL_.jpg", "hash": "188c1b91d440fa91c993b6f799f25363"}, {"celebrity_name": "Matthew McConaughey", "img_url": "https://m.media-amazon.com/images/M/MV5BMTg0MDc3ODUwOV5BMl5BanBnXkFtZTcwMTk2NjY4Nw@@.jpg", "hash": "bbb83f4729c96817d140253fe005f3bc"}, {"celebrity_name": "Annabelle Wallis", "img_url": "https://m.media-amazon.com/images/M/MV5BMjA2MjU2NjE1OV5BMl5BanBnXkFtZTgwNTMyMTAzMjI@._V1_UY209_CR92,0,140,209_AL_.jpg", "hash": "fc34aefea20732a338c5f98016e9db79"}, {"celebrity_name": "Amy Adams", "img_url": "https://m.media-amazon.com/images/M/MV5BMTg2NTk2MTgxMV5BMl5BanBnXkFtZTgwNjcxMjAzMTI@.jpg", "hash": "a05773b112d5d40608356f7963506dc9"}, {"celebrity_name": "Tony Cavalero", "img_url": "https://m.media-amazon.com/images/M/MV5BOTc3Mjk0MTMtMTAzOS00MTk1LWI1ZTctZmZiZWZhZGQxNDE5XkEyXkFqcGdeQXVyMzcxMjYxNTc@._V1_UY209_CR87,0,140,209_AL_.jpg", "hash": "feba8aab39ca4491b66f2d6014a82614"}, {"celebrity_name": "Marley Shelton", "img_url": "https://m.media-amazon.com/images/M/MV5BMTY1NzU0MDM5NF5BMl5BanBnXkFtZTcwODk3MDY3Mg@@._V1_UY209_CR2,0,140,209_AL_.jpg", "hash": "47779ad0f4cb2f17f8f365f900ccec4c"}, {"celebrity_name": "Elodie Yung", "img_url": "https://m.media-amazon.com/images/M/MV5BNjMzOTg4MDM3NF5BMl5BanBnXkFtZTgwMTUzMjM4NDM@._V1_UY209_CR4,0,140,209_AL_.jpg", "hash": "f073e56a72ec1951744d4cfaf60a74ba"}, {"celebrity_name": "Kaitlyn Dever", "img_url": "https://m.media-amazon.com/images/M/MV5BZDcyZTNjM2ItM2UyMC00YjdkLTk3MmEtZDk2Y2NiMWQ3NWY2XkEyXkFqcGdeQXVyMTk5MzgwMDM@._V1_UY209_CR2,0,140,209_AL_.jpg", "hash": "39e658f51b65f39736d48697332e276b"}, {"celebrity_name": "Selena Gomez", "img_url": "https://m.media-amazon.com/images/M/MV5BMjAwNTE2MDMyMl5BMl5BanBnXkFtZTgwMjAyODM3MTI@._V1_UY209_CR8,0,140,209_AL_.jpg", "hash": "d3d9252411d5de1082d8102047a950af"}, {"celebrity_name": "Bruce Willis", "img_url": "https://m.media-amazon.com/images/M/MV5BMjA0MjMzMTE5OF5BMl5BanBnXkFtZTcwMzQ2ODE3Mw@@._V1_UY209_CR19,0,140,209_AL_.jpg", "hash": "2503c049ff9751e70687a522f245aacc"}, {"celebrity_name": "Adam McKay", "img_url": "https://m.media-amazon.com/images/M/MV5BZmQ2ZDNkMGYtOWUzNi00N2Q3LTk1MDItODFlNDJkMTZkMjFmXkEyXkFqcGdeQXVyMjMxNzg4Mjk@._V1_UY209_CR8,0,140,209_AL_.jpg", "hash": "3537b7c29827328c979e7e2c13483b80"}, {"celebrity_name": "Karina Lombard", "img_url": "https://m.media-amazon.com/images/M/MV5BMTQzMDc3NjY5Ml5BMl5BanBnXkFtZTYwNTUzNzcy.jpg", "hash": "2d6ad183b5d8f8a3056fd6334789b6ff"}, {"celebrity_name": "Devin Kelley", "img_url": "https://m.media-amazon.com/images/M/MV5BMDlkM2FkZjgtY2RlNy00MjcyLTk0Y2ItNmUxMGE3YmNhNTYxXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY209_CR87,0,140,209_AL_.jpg", "hash": "a428d6ad2dac96d70e2ae0eac0cb9721"}, {"celebrity_name": "Gemma Arterton", "img_url": "https://m.media-amazon.com/images/M/MV5BOTAwNTMwMzE5OF5BMl5BanBnXkFtZTgwMjYwNzI2MjE@.jpg", "hash": "d1f56ca251d2d1957199ff0fd35b4e44"}, {"celebrity_name": "Christian Bale", "img_url": "https://m.media-amazon.com/images/M/MV5BMTkxMzk4MjQ4MF5BMl5BanBnXkFtZTcwMzExODQxOA@@.jpg", "hash": "e1c0db0c2a4f78deca623203370b0cb6"}, {"celebrity_name": "Julie Benz", "img_url": "https://m.media-amazon.com/images/M/MV5BNDkwNWJkM2EtMWJmMi00ODUwLWIxMGYtZjBlMzEyOTQxMzhlXkEyXkFqcGdeQXVyMjMwNTM1OQ@@._V1_UY209_CR17,0,140,209_AL_.jpg", "hash": "fcc6136dfa7184a541a854901dbc3d35"}, {"celebrity_name": "Robert Pattinson", "img_url": "https://m.media-amazon.com/images/M/MV5BNzk0MDQ5OTUxMV5BMl5BanBnXkFtZTcwMDM5ODk5Mg@@._V1_UY209_CR8,0,140,209_AL_.jpg", "hash": "ba6ea01360846ee8b756724ccd714617"}, {"celebrity_name": "Mel Gibson", "img_url": "https://m.media-amazon.com/images/M/MV5BNTUzOTMwNTM0OV5BMl5BanBnXkFtZTcwNDQwMTUxMw@@._V1_UY209_CR6,0,140,209_AL_.jpg", "hash": "0c217fdaecf0a99aace9904894f668c6"}, {"celebrity_name": "Danielle Brooks", "img_url": "https://m.media-amazon.com/images/M/MV5BYTFlNGE4MTItMDQxNS00M2IwLThiMzQtMjdhZmY2ZGU4ZDRiXkEyXkFqcGdeQXVyMzcxOTgwMjQ@._V1_UY209_CR13,0,140,209_AL_.jpg", "hash": "e425ba09baf3d8f51fb90aa066c71b09"}, {"celebrity_name": "Kelly Marie Tran", "img_url": "https://m.media-amazon.com/images/M/MV5BZTQ3OWYyYjktY2JjOC00ODAzLTgxYTItY2NlYjA1ZWVjYjVhXkEyXkFqcGdeQXVyMjY3NzQ2Mzc@._V1_UY209_CR75,0,140,209_AL_.jpg", "hash": "0207f394535c79b3c6477cff7b43294e"}, {"celebrity_name": "Wes Bentley", "img_url": "https://m.media-amazon.com/images/M/MV5BOTgyOTY5OTA5OF5BMl5BanBnXkFtZTcwNzM1MjM1Nw@@._V1_UY209_CR0,0,140,209_AL_.jpg", "hash": "4ee69770b82f9b46d833514c30c8d6df"}, {"celebrity_name": "Nicole Kidman", "img_url": "https://m.media-amazon.com/images/M/MV5BMTk1MjM5NDg4MF5BMl5BanBnXkFtZTcwNDg1OTQ4Nw@@._V1_UY209_CR7,0,140,209_AL_.jpg", "hash": "761584c464127fade61bffc57b6b1f77"}, {"celebrity_name": "Stana Katic", "img_url": "https://m.media-amazon.com/images/M/MV5BMGE2ZTIzMDEtNmYwYi00Njc4LWFiNzctMGIyYmRhMjNhMTk1XkEyXkFqcGdeQXVyMjAwNDk5Njk@._V1_UY209_CR26,0,140,209_AL_.jpg", "hash": "43be45697786227fbaa0f4a0af318a54"}, {"celebrity_name": "Jensen Ackles", "img_url": "https://m.media-amazon.com/images/M/MV5BMTcxMDk3NTgzNl5BMl5BanBnXkFtZTcwMTUzNzY3OQ@@._V1_UY209_CR8,0,140,209_AL_.jpg", "hash": "b70ec72e3227f035cc6356a896076be7"}, {"celebrity_name": "Connie Nielsen", "img_url": "https://m.media-amazon.com/images/M/MV5BYzZiYTQ4YTAtMzRkMi00ZDZlLWFkZWItNGI2ZTIyODRiYTc4XkEyXkFqcGdeQXVyMjUzMjc2MjE@._V1_UY209_CR8,0,140,209_AL_.jpg", "hash": "c4b39089ed5cfba73b84218ce805af0a"}, {"celebrity_name": "Lee Pace", "img_url": "https://m.media-amazon.com/images/M/MV5BZmEzNDA3MDktZDdjMS00YTNjLTg1ZmUtMWIxZGNlMzY3OGU5XkEyXkFqcGdeQXVyMTExNzQ3MzAw._V1_UY209_CR15,0,140,209_AL_.jpg", "hash": "3a41fee9376d8dad9f18497e43855a9b"}, {"celebrity_name": "Jason Isaacs", "img_url": "https://m.media-amazon.com/images/M/MV5BMTc1NTI5MzE2OF5BMl5BanBnXkFtZTgwODYyNjM4MTE@._V1_UY209_CR3,0,140,209_AL_.jpg", "hash": "c5a05cd89779d39ef80a6798ead73e44"}, {"celebrity_name": "Lori Petty", "img_url": "https://m.media-amazon.com/images/M/MV5BMjQ3NjI0ODc4OV5BMl5BanBnXkFtZTcwOTkyMjkyMQ@@._V1_UY209_CR31,0,140,209_AL_.jpg", "hash": "fd5d8ba793e620b5d2a823ce1b24c1d5"}, {"celebrity_name": "Melissa Roxburgh", "img_url": "https://m.media-amazon.com/images/M/MV5BNWJlZDk2YWMtNjQwZi00MTQwLWFjYjMtMWZjNzI0MDUzY2E3XkEyXkFqcGdeQXVyMjU0NjE0NDI@.jpg", "hash": "134ea2f74a6f988dc7b92c0b9af37214"}, {"celebrity_name": "Chloé Zhao", "img_url": "https://m.media-amazon.com/images/M/MV5BMWZlMjc3M2MtMDFlYy00OWIwLTkxMTUtOWYzNGU5ZmQ1MzgwXkEyXkFqcGdeQXVyMTk2ODc0MjY@.jpg", "hash": "40c7e4e06769ec000022c775793ca7b1"}, {"celebrity_name": "Skyler Gisondo", "img_url": "https://m.media-amazon.com/images/M/MV5BNTRiZGJhMDQtNzg3Mi00MmRjLTk0MjQtMDdiNzE4NjNhYmYwXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY209_CR34,0,140,209_AL_.jpg", "hash": "ec6a11f66e6a07ff581813e1147bc380"}, {"celebrity_name": "Quentin Tarantino", "img_url": "https://m.media-amazon.com/images/M/MV5BMTgyMjI3ODA3Nl5BMl5BanBnXkFtZTcwNzY2MDYxOQ@@.jpg", "hash": "69912976b5fda8d55a0ae518370f5ee3"}, {"celebrity_name": "Robert Downey Jr.", "img_url": "https://m.media-amazon.com/images/M/MV5BNzg1MTUyNDYxOF5BMl5BanBnXkFtZTgwNTQ4MTE2MjE@.jpg", "hash": "c57e2a9652d207f8bb0ff4a835b90f9d"}, {"celebrity_name": "Yvonne Zima", "img_url": "https://m.media-amazon.com/images/M/MV5BMTkxMTcxMTcyMl5BMl5BanBnXkFtZTcwOTc1MjM0OQ@@._V1_UY209_CR1,0,140,209_AL_.jpg", "hash": "df1fac0a25f7bd01f1067ce6f2ca2407"}, {"celebrity_name": "Helena Bonham Carter", "img_url": "https://m.media-amazon.com/images/M/MV5BMTUzMzUzMDg5MV5BMl5BanBnXkFtZTcwMDA5NDMwNA@@._V1_UY209_CR3,0,140,209_AL_.jpg", "hash": "f76e6de3d2befe28a56f8db2836949e6"}, {"celebrity_name": "Elle Fanning", "img_url": "https://m.media-amazon.com/images/M/MV5BOTM3ODNjNTYtNjBhOC00ZTNkLTg4YjAtMzU3M2EyMDhkM2EyXkEyXkFqcGdeQXVyMTk2ODc0MjY@.jpg", "hash": "9c3ca0356297c61d4524aa977cae8329"}, {"celebrity_name": "Jared Leto", "img_url": "https://m.media-amazon.com/images/M/MV5BMTczMjUwNDUzMF5BMl5BanBnXkFtZTgwNDA4OTAzMTE@.jpg", "hash": "c24685e5f31502f286a287b5c6c8545c"}, {"celebrity_name": "Awkwafina", "img_url": "https://m.media-amazon.com/images/M/MV5BMTU0NTUwNjkyN15BMl5BanBnXkFtZTgwMjM0NzEzMTI@._V1_UY209_CR5,0,140,209_AL_.jpg", "hash": "d5f66f5c0bc58fb3640be5633d457860"}, {"celebrity_name": "Alex Hassell", "img_url": "https://m.media-amazon.com/images/M/MV5BMTFiMmUwZDgtMzcyZC00ZjIwLTgyMTUtMDk4NzU1Mjk4YjkyXkEyXkFqcGdeQXVyNDI2OTYwNzE@.jpg", "hash": "851e270db756df5db719b64b9ca97903"}, {"celebrity_name": "Charlotte Ross", "img_url": "https://m.media-amazon.com/images/M/MV5BMTQ1ODQyNjkwMF5BMl5BanBnXkFtZTgwNTI4MzQyNzE@.jpg", "hash": "f798de3d5ea21c5780547bc9d0899e4c"}, {"celebrity_name": "Parker Posey", "img_url": "https://m.media-amazon.com/images/M/MV5BMTIzNzAwMDE4MF5BMl5BanBnXkFtZTYwNjE4MDQ3._V1_UY209_CR8,0,140,209_AL_.jpg", "hash": "d56f5bb56392db060ffd4dcfab7dde6a"}, {"celebrity_name": "Alison Brie", "img_url": "https://m.media-amazon.com/images/M/MV5BMjJkNDg5ZDctM2RlZS00NjFmLTkxZjktMWE5NGQzMDg4NDFhXkEyXkFqcGdeQXVyMTMwMDM1OTQ@._V1_UY209_CR6,0,140,209_AL_.jpg", "hash": "c6c6c685dea29006dc51a7734a5ab8de"}, {"celebrity_name": "Elizabeth Debicki", "img_url": "https://m.media-amazon.com/images/M/MV5BMWRiNzczYzMtOGE1Yi00Njg0LWFkNTUtYzE3NmVkZDZkMjg5XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY209_CR14,0,140,209_AL_.jpg", "hash": "97b5ab4b364da6bb713924d400eadd1e"}, {"celebrity_name": "Emily Blunt", "img_url": "https://m.media-amazon.com/images/M/MV5BMTUxNDY4MTMzM15BMl5BanBnXkFtZTcwMjg5NzM2Ng@@.jpg", "hash": "267fb6f872f862d25fc7e9dad3f01a46"}, {"celebrity_name": "Clancy Brown", "img_url": "https://m.media-amazon.com/images/M/MV5BMTUxODY3NjAzMF5BMl5BanBnXkFtZTcwMTQ5MjYwNg@@._V1_UY209_CR2,0,140,209_AL_.jpg", "hash": "f5347c931a2103414d28cdd5692b9955"}, {"celebrity_name": "Charlie Cox", "img_url": "https://m.media-amazon.com/images/M/MV5BMjA0Mzg5MTU3MV5BMl5BanBnXkFtZTgwOTUxMTQ5NzE@._V1_UY209_CR95,0,140,209_AL_.jpg", "hash": "497fd573e0c8d14c2851adecaa70ea7d"}, {"celebrity_name": "Kristen Bell", "img_url": "https://m.media-amazon.com/images/M/MV5BMjA1Njc0MTUzN15BMl5BanBnXkFtZTgwNTg1MjEwNDI@.jpg", "hash": "a47499aa3229fa39b20681442c0a9abb"}, {"celebrity_name": "Zazie Beetz", "img_url": "https://m.media-amazon.com/images/M/MV5BNGQwOTQzYjQtZjlmYi00MWYwLTg0YzEtOTlhYmYzNDcyMDM4XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY209_CR24,0,140,209_AL_.jpg", "hash": "978e1688c95d7786ab3e6e4d30ab0c06"}, {"celebrity_name": "Jeremy Renner", "img_url": "https://m.media-amazon.com/images/M/MV5BOTk2NDc2ODgzMF5BMl5BanBnXkFtZTcwMTMzOTQ4Nw@@.jpg", "hash": "03488b4ef01292cc16ccf3f3b5c630f1"}, {"celebrity_name": "Charlie Hunnam", "img_url": "https://m.media-amazon.com/images/M/MV5BMjE5NjE5Mzk2MV5BMl5BanBnXkFtZTcwODI5MDE1Ng@@._V1_UY209_CR4,0,140,209_AL_.jpg", "hash": "42c8a0e03270af356c0fc3c830980a65"}, {"celebrity_name": "Peter Sarsgaard", "img_url": "https://m.media-amazon.com/images/M/MV5BMjE0Mjg0NzE2Nl5BMl5BanBnXkFtZTcwMDE1MTkxMw@@._V1_UY209_CR10,0,140,209_AL_.jpg", "hash": "d8fe232c2e5c5cb082aee8e6da88ceb1"}, {"celebrity_name": "Alan Ritchson", "img_url": "https://m.media-amazon.com/images/M/MV5BMGI4Y2QzZWEtYmYwMC00MTc1LWI1ZjEtYjMzNzA4MDQ2Yjk0XkEyXkFqcGdeQXVyNzY1NTEzMw@@._V1_UY209_CR87,0,140,209_AL_.jpg", "hash": "c85c6dcd0cbda00e7adf4324b95e66f0"}, {"celebrity_name": "Anna Kendrick", "img_url": "https://m.media-amazon.com/images/M/MV5BMjIzOTA0OTQyN15BMl5BanBnXkFtZTcwMjE1OTIwMw@@._V1_UY209_CR4,0,140,209_AL_.jpg", "hash": "e90ee34f78435c0c4de29550773822d6"}, {"celebrity_name": "Diane Lane", "img_url": "https://m.media-amazon.com/images/M/MV5BNDIxNWNhZGYtYzgyYi00YTc1LTg5NjItYTA1ZjMyYmFmZDliXkEyXkFqcGdeQXVyMTA2MDIzMDE5._V1_UY209_CR86,0,140,209_AL_.jpg", "hash": "665a9bdf16250e383e554d5ae7c21e09"}, {"celebrity_name": "Sofia Hublitz", "img_url": "https://m.media-amazon.com/images/M/MV5BZTU2ZTQ4YTQtNTg4NS00Mjk5LTgxODAtZmU4NTFmOWUxMzY4XkEyXkFqcGdeQXVyMjU1NTEwMzI@._V1_UY209_CR52,0,140,209_AL_.jpg", "hash": "54af0f56ffe6612692863499a8b4db25"}, {"celebrity_name": "Emilie Ullerup", "img_url": "https://m.media-amazon.com/images/M/MV5BN2QzZGM1MzItOGNkOC00NThjLWJkMGEtMmU4NzgxZGE4ODBkXkEyXkFqcGdeQXVyMTEzNjA2NzM@._V1_UY209_CR115,0,140,209_AL_.jpg", "hash": "ea8389a95af59fffe725263a0bb93bd8"}, {"celebrity_name": "Pedro Pascal", "img_url": "https://m.media-amazon.com/images/M/MV5BYzQ5Yzg1NzktMDcxNC00ZDc1LWJlMjEtNTg2ZjRlOTk4ZDNjXkEyXkFqcGdeQXVyODk4OTc3MTY@._V1_UY209_CR4,0,140,209_AL_.jpg", "hash": "e7c0fc20efd5833152748c0d1ab7bb37"}, {"celebrity_name": "Christopher Nolan", "img_url": "https://m.media-amazon.com/images/M/MV5BNjE3NDQyOTYyMV5BMl5BanBnXkFtZTcwODcyODU2Mw@@._V1_UY209_CR5,0,140,209_AL_.jpg", "hash": "f6f7d2dc16f257bfefada9ef794a4947"}, {"celebrity_name": "Dawn Olivieri", "img_url": "https://m.media-amazon.com/images/M/MV5BODc0ZTdmNDMtN2I4MS00MzdlLTgxNTItNmRhNWMzMDQ5YjMzXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY209_CR14,0,140,209_AL_.jpg", "hash": "6306cd7a79632d2b986a82f76f654613"}, {"celebrity_name": "Jake Gyllenhaal", "img_url": "https://m.media-amazon.com/images/M/MV5BNjA0MTU2NDY3MF5BMl5BanBnXkFtZTgwNDU4ODkzMzE@.jpg", "hash": "e1b672e21a39084c19b7e112507a71db"}, {"celebrity_name": "Xolo Maridueña", "img_url": "https://m.media-amazon.com/images/M/MV5BZDA0NmUxYWItZWUzOC00OWExLThhNmEtZmFlODMxMWQxYTJjXkEyXkFqcGdeQXVyMzIwMzUzNjU@.jpg", "hash": "c0056da323704bf26a80e77cc0372b8f"}, {"celebrity_name": "Dylan Minnette", "img_url": "https://m.media-amazon.com/images/M/MV5BNTk0ZmNkMWEtNzI0Yy00ZTAzLThiNWMtZWMwMDkzZmJjZmU3XkEyXkFqcGdeQXVyNTYxNDQ4NQ@@.jpg", "hash": "1fd126bfbcbc7bd9d4aa3cce04a96dfd"}, {"celebrity_name": "Vanessa Kirby", "img_url": "https://m.media-amazon.com/images/M/MV5BYzUzNjkwMjMtODRiNi00ZTliLWE3Y2ItMDJmZmFmNjg1YTMyXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY209_CR1,0,140,209_AL_.jpg", "hash": "ff62221c347cb3c82cae61392110bedc"}, {"celebrity_name": "Josephine Langford", "img_url": "https://m.media-amazon.com/images/M/MV5BN2MxMGRmYTItYjliNi00YTYxLTkyMGEtMzNmMmMyNjgzZTJhXkEyXkFqcGdeQXVyNTI0NDA1NTE@._V1_UY209_CR14,0,140,209_AL_.jpg", "hash": "819458786cb184ee1f0f6d8ef7d83068"}, {"celebrity_name": "Millie Bobby Brown", "img_url": "https://m.media-amazon.com/images/M/MV5BMjA5NzA0NzQzMF5BMl5BanBnXkFtZTgwMTQxNjUzNjM@.jpg", "hash": "b8575004125983cc858e64150eb2db65"}, {"celebrity_name": "Dakota Fanning", "img_url": "https://m.media-amazon.com/images/M/MV5BMjAwNjM3NjY5MF5BMl5BanBnXkFtZTcwMjM4NTYwOQ@@._V1_UY209_CR0,0,140,209_AL_.jpg", "hash": "40ab41126b6bc70af0937b2ae7b86eb1"}, {"celebrity_name": "Gina Carano", "img_url": "https://m.media-amazon.com/images/M/MV5BODBlMWE0NjctY2EwNC00ZTljLTk4NzQtODM4NDNkZjk2ZGRlXkEyXkFqcGdeQXVyMTk0NDU0OTc@._V1_UY209_CR23,0,140,209_AL_.jpg", "hash": "c19ed5d89e823dad0bb615880b25fefc"}, {"celebrity_name": "Ginnifer Goodwin", "img_url": "https://m.media-amazon.com/images/M/MV5BY2NmODMxNzctYzA3NS00NzFiLTliYWYtMzMzNDlmM2NkMWQxXkEyXkFqcGdeQXVyMTU1MDQ2NTM@.jpg", "hash": "d196f5149253f186dc68d5c6772f0844"}, {"celebrity_name": "Harry Melling", "img_url": "https://m.media-amazon.com/images/M/MV5BZjQ3OGE3MGUtZmViOC00N2M2LTlmNmMtMmZiZDUwYTcyMzUxXkEyXkFqcGdeQXVyMjQwMDg0Ng@@.jpg", "hash": "dfd32a90cffe35b1f204387b33e72b5c"}, {"celebrity_name": "Lucas Bravo", "img_url": "https://m.media-amazon.com/images/M/MV5BNDFjZjM3NTYtOTAxMi00MzA2LTk4OTktMjk0ZTgwNjExZWJmXkEyXkFqcGdeQXVyOTYyNjkyMDQ@.jpg", "hash": "13dab0ff9753cfeca57d9e5a0458810d"}, {"celebrity_name": "Linda Cardellini", "img_url": "https://m.media-amazon.com/images/M/MV5BMTQ2MDM4MTM2NF5BMl5BanBnXkFtZTgwMTM4MjYyMDE@._V1_UY209_CR5,0,140,209_AL_.jpg", "hash": "5f63c3cbfcbffa3c03f4440abc77cb40"}, {"celebrity_name": "Kristen Stewart", "img_url": "https://m.media-amazon.com/images/M/MV5BYTJlOGE3ZjEtZDg4OS00MGJlLTgzY2QtYzg3OWE2NmZmYmE1XkEyXkFqcGdeQXVyMTI2Nzk2ODk3._V1_UY209_CR27,0,140,209_AL_.jpg", "hash": "9c00255e5775d8c6e36e92cd742d5d75"}, {"celebrity_name": "Rosario Dawson", "img_url": "https://m.media-amazon.com/images/M/MV5BNjlhN2YzMDYtOTcxYi00YWIwLTkwNTItNDNlMWY2ZDNkNzA5XkEyXkFqcGdeQXVyMTE1MTYxNDAw._V1_UY209_CR13,0,140,209_AL_.jpg", "hash": "dffbf9b29e5549f1461d5091000c712e"}, {"celebrity_name": "Brian Tyree Henry", "img_url": "https://m.media-amazon.com/images/M/MV5BNDUyMzE0ODY5Ml5BMl5BanBnXkFtZTgwOTc1NTkxMzI@.jpg", "hash": "973209c726a9680389d932773a9dcc81"}, {"celebrity_name": "Rachel McAdams", "img_url": "https://m.media-amazon.com/images/M/MV5BMTY5ODcxMDU4NV5BMl5BanBnXkFtZTcwMjAzNjQyNQ@@._V1_UY209_CR2,0,140,209_AL_.jpg", "hash": "b1c770a89bac553d88b1468e28b67422"}, {"celebrity_name": "Lana Wachowski", "img_url": "https://m.media-amazon.com/images/M/MV5BMjEzMTc2MDQ5OV5BMl5BanBnXkFtZTcwNjkzNDY0OA@@.jpg", "hash": "6ca78c4d8973ec8d4b354a2f766d6f40"}, {"celebrity_name": "Janet McTeer", "img_url": "https://m.media-amazon.com/images/M/MV5BNzk5MzQ3MDQxOF5BMl5BanBnXkFtZTcwOTU4OTI2Mg@@.jpg", "hash": "4a5ad79690eebb0c79235619e9779692"}, {"celebrity_name": "Ashley Johnson", "img_url": "https://m.media-amazon.com/images/M/MV5BOTk5Njc3NzgxOV5BMl5BanBnXkFtZTgwMzgyMjIzNzE@._V1_UY209_CR86,0,140,209_AL_.jpg", "hash": "30149125cdbddc73579d95d0dc8f84b0"}, {"celebrity_name": "Elizabeth Banks", "img_url": "https://m.media-amazon.com/images/M/MV5BMjEzMTcxNDU3NV5BMl5BanBnXkFtZTcwOTE0MzEzNw@@._V1_UY209_CR15,0,140,209_AL_.jpg", "hash": "42778a84001845d7d16596b7f10f092d"}, {"celebrity_name": "Jennifer Aniston", "img_url": "https://m.media-amazon.com/images/M/MV5BNjk1MjIxNjUxNF5BMl5BanBnXkFtZTcwODk2NzM4Mg@@._V1_UY209_CR3,0,140,209_AL_.jpg", "hash": "42cd09c71cec7cbaed64330d4a8cd449"}, {"celebrity_name": "Amber Heard", "img_url": "https://m.media-amazon.com/images/M/MV5BMjA4NDkyODA3M15BMl5BanBnXkFtZTgwMzUzMjYzNzM@._V1_UY209_CR34,0,140,209_AL_.jpg", "hash": "4e3fbc78daf616601e3125d0082516f8"}, {"celebrity_name": "Nina Dobrev", "img_url": "https://m.media-amazon.com/images/M/MV5BMzliNzA0OTktMTE3Ny00OWY2LTllY2ItY2UwZmI2OGRmYTI2XkEyXkFqcGdeQXVyMTM5NDMzMjY@.jpg", "hash": "e1b381eb4190ffa2742abae33db5b1a2"}, {"celebrity_name": "Rebecca Hall", "img_url": "https://m.media-amazon.com/images/M/MV5BNjkzODU4MTQ4OV5BMl5BanBnXkFtZTcwNDU0MTA4NA@@._V1_UY209_CR8,0,140,209_AL_.jpg", "hash": "e93c5350a40808f52cfc6894fdb677e5"}, {"celebrity_name": "Eva Habermann", "img_url": "https://m.media-amazon.com/images/M/MV5BNWU1MzZjZmYtYzkyOC00OGQ2LWI1ZWYtMzdkODgzNGYzNjU4XkEyXkFqcGdeQXVyMjM1OTk0NDQ@.jpg", "hash": "44025658ca024714ede43202c81d6e50"}, {"celebrity_name": "Rachel Shenton", "img_url": "https://m.media-amazon.com/images/M/MV5BMzM2NTJlNzAtZTc4MS00NDM2LWFiM2QtYjhhYzkxNDg4ZWM3XkEyXkFqcGdeQXVyMTE5OTQ1NTg@._V1_UY209_CR1,0,140,209_AL_.jpg", "hash": "ac7f93d704b0af28aaa7be91c079eda9"}, {"celebrity_name": "Piper Perabo", "img_url": "https://m.media-amazon.com/images/M/MV5BMGEwY2E4MzEtNjVhNy00ZTUyLWE4YmUtODIxNzU2NGRmNDUzXkEyXkFqcGdeQXVyMTMxNTAxODk@._V1_UY209_CR34,0,140,209_AL_.jpg", "hash": "5aa4e5afbbeadb7fc2f019aa8d41b247"}, {"celebrity_name": "Angie Cepeda", "img_url": "https://m.media-amazon.com/images/M/MV5BNGI5ZmE2NTgtOGRjNy00Y2UyLTk0OTUtOWZiNWYxZmNhY2FiXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY209_CR117,0,140,209_AL_.jpg", "hash": "0dfaf19f1fe943d450aea4c80ebddeb6"}, {"celebrity_name": "Alan Tudyk", "img_url": "https://m.media-amazon.com/images/M/MV5BMjE0MzEwNDUxNV5BMl5BanBnXkFtZTcwNTE1MDAzOQ@@._V1_UY209_CR1,0,140,209_AL_.jpg", "hash": "393f134ec33af419846b09bdaf5ee63a"}, {"celebrity_name": "Willem Dafoe", "img_url": "https://m.media-amazon.com/images/M/MV5BOWU4MTI2OTctODQ1ZS00MGM1LWJkM2EtODE3MGNkNmIyZDEwXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY209_CR13,0,140,209_AL_.jpg", "hash": "a51a38d0e1561f03a0a6b6b50dbd2c24"}, {"celebrity_name": "Caitlin FitzGerald", "img_url": "https://m.media-amazon.com/images/M/MV5BMTY2NDQwNjAzOV5BMl5BanBnXkFtZTgwMDAxNTU5MDE@._V1_UY209_CR4,0,140,209_AL_.jpg", "hash": "05350fe81c368ae6c110adacf6e17177"}, {"celebrity_name": "Shailene Woodley", "img_url": "https://m.media-amazon.com/images/M/MV5BYmI4YzcwNDUtZDcyNS00Njk2LTk5OGQtN2VkZjdmMTk3NTRlXkEyXkFqcGdeQXVyMzAzMzk5NDg@._V1_UY209_CR34,0,140,209_AL_.jpg", "hash": "485f185b59e8feb69e3a5e0cfd054a95"}, {"celebrity_name": "Eddie Izzard", "img_url": "https://m.media-amazon.com/images/M/MV5BMjY2MmQ5ODAtNWM4Zi00YWUxLThhYjktMDczN2NjNGUxNzQ2XkEyXkFqcGdeQXVyMjI4MDI0NTM@.jpg", "hash": "a8a72b2d2bd6c62e9db7fa8a00ebcf10"}, {"celebrity_name": "Elisabeth Shue", "img_url": "https://m.media-amazon.com/images/M/MV5BOWFkZTIxN2ItODhlOC00MDMwLWEyYTEtZWMxNWQ2MzU3ZjZmXkEyXkFqcGdeQXVyNjk1MjYyNTA@._V1_UY209_CR34,0,140,209_AL_.jpg", "hash": "5c408c24e86793cee9396e2696c0e9ee"}, {"celebrity_name": "Martin Kove", "img_url": "https://m.media-amazon.com/images/M/MV5BMWU3NjIwMmEtYmVhMC00NDRlLTlmYTktOTk4NmIxYmNkOWY1XkEyXkFqcGdeQXVyMzI5NDcxNzI@.jpg", "hash": "69bee7ecc06fda920e9d23cf63ca5450"}, {"celebrity_name": "Mena Massoud", "img_url": "https://m.media-amazon.com/images/M/MV5BOTAzYWNiMWYtOTk2Zi00MGU4LWE1NjItNDJkMGYxMTc3M2Y2XkEyXkFqcGdeQXVyMjc2MTIzNjg@.jpg", "hash": "94803d21c549ebcc63c5cc525fc280f7"}, {"celebrity_name": "Lisa Bonet", "img_url": "https://m.media-amazon.com/images/M/MV5BMzIyNzQ0Nzg1NV5BMl5BanBnXkFtZTcwNTI4NTE5Ng@@._V1_UY209_CR8,0,140,209_AL_.jpg", "hash": "a53a447bc9f84b05e124988f331ff2a7"}, {"celebrity_name": "Mia Goth", "img_url": "https://m.media-amazon.com/images/M/MV5BYmFiZDViOTgtNDc5Ni00MGYzLThiY2ItM2QxZjIxNTNjNjczXkEyXkFqcGdeQXVyODU3MzI2MDM@._V1_UY209_CR24,0,140,209_AL_.jpg", "hash": "e01a9670edf40701da1946e93cfbf2cc"}, {"celebrity_name": "Adassa", "img_url": "https://m.media-amazon.com/images/M/MV5BZjdmZjM3ODMtNzczOS00NzUzLWE1YWYtNWI0ZDZiYjA4YzgyXkEyXkFqcGdeQXVyMTM0Mzk4ODE5._V1_UY209_CR34,0,140,209_AL_.jpg", "hash": "955b27837084bc15d25a1fe9165ef81d"}, {"celebrity_name": "Charlize Theron", "img_url": "https://m.media-amazon.com/images/M/MV5BMTk5Mzc4ODU0Ml5BMl5BanBnXkFtZTcwNjU1NTI0Mw@@._V1_UY209_CR8,0,140,209_AL_.jpg", "hash": "2d62d746d99f9d692cb085fb1c6b80ad"}, {"celebrity_name": "Jonathan Groff", "img_url": "https://m.media-amazon.com/images/M/MV5BMTUzMDM1NzkxN15BMl5BanBnXkFtZTgwOTg0MzMwNDI@._V1_UY209_CR8,0,140,209_AL_.jpg", "hash": "097eff52b5b0aa3e7b8e129ff6642938"}, {"celebrity_name": "Michael Keaton", "img_url": "https://m.media-amazon.com/images/M/MV5BZmNiZmMzN2MtOTNkMy00YjA1LTg4NzktMWI4Njg1NzI3ODAyXkEyXkFqcGdeQXVyNzg5MzIyOA@@.jpg", "hash": "94a347f8c5e43a271bd2c16a02184d25"}, {"celebrity_name": "Will Poulter", "img_url": "https://m.media-amazon.com/images/M/MV5BNGM5Y2IxNmYtODg5Zi00YjZhLThkZDUtMGE1ODc4N2MyZjAzXkEyXkFqcGdeQXVyMTExNzQzMDE0._V1_UY209_CR58,0,140,209_AL_.jpg", "hash": "e88727a1bcd5b2b345a4e536976dfd55"}, {"celebrity_name": "Lily Rabe", "img_url": "https://m.media-amazon.com/images/M/MV5BMTcyMDIxNDAxMV5BMl5BanBnXkFtZTgwMjgwOTI3ODE@.jpg", "hash": "5b2c2a4bf3bcee18a11522a0be14ec77"}, {"celebrity_name": "Rebel Wilson", "img_url": "https://m.media-amazon.com/images/M/MV5BYjJhYTdhZmMtZmRhOS00YjJiLThkYjItMjljNzhhNjVmNjQwXkEyXkFqcGdeQXVyMTQzMjYyODY@._V1_UY209_CR90,0,140,209_AL_.jpg", "hash": "32e77bd1831c5668abcc8c3fdbc70f74"}, {"celebrity_name": "Kodi Smit-McPhee", "img_url": "https://m.media-amazon.com/images/M/MV5BOTE4ODU4NzY5NV5BMl5BanBnXkFtZTgwOTIwNTk5MDE@.jpg", "hash": "5110d707e6c0b2a6c602a6b7fe5fb1f9"}, {"celebrity_name": "Martin Donovan", "img_url": "https://m.media-amazon.com/images/M/MV5BNWIzNTAyZTktZmYzMC00MmQ1LWFhOTItYmZhZGViMWYwNzdjXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY209_CR1,0,140,209_AL_.jpg", "hash": "769cae22f3487388179c1c8df0e0b693"}, {"celebrity_name": "Brian Hull", "img_url": "https://m.media-amazon.com/images/M/MV5BMGNjMDkxYWEtNjA3MS00ZGQ3LWE3Y2MtYzIxZjVhNTM3YjkyXkEyXkFqcGdeQXVyMTAyMzc4NDI3.jpg", "hash": "2dd4339076061e1008c3fc5575a1df7b"}, {"celebrity_name": "Bridget Everett", "img_url": "https://m.media-amazon.com/images/M/MV5BMTk2NjY4NjczMV5BMl5BanBnXkFtZTgwMTI5MDg1NjE@._V1_UY209_CR2,0,140,209_AL_.jpg", "hash": "9f526f1230cc09b3dc47cab8e8eb991c"}, {"celebrity_name": "Steve Carell", "img_url": "https://m.media-amazon.com/images/M/MV5BMjMyOTM2OTk1Ml5BMl5BanBnXkFtZTgwMTI3MzkyNjM@.jpg", "hash": "9348accef5e748571af63f57b3050685"}, {"celebrity_name": "Katee Sackhoff", "img_url": "https://m.media-amazon.com/images/M/MV5BMTc4MTAxMDMxMV5BMl5BanBnXkFtZTgwMTYxNjE5MDI@._V1_UY209_CR8,0,140,209_AL_.jpg", "hash": "5dd7d7fb9cbfc545a697e161688a12c5"}, {"celebrity_name": "Birgitte Hjort Sørensen", "img_url": "https://m.media-amazon.com/images/M/MV5BMTkzNTgwNzQ3MV5BMl5BanBnXkFtZTgwMzAyNDc2MDI@.jpg", "hash": "7c619bfeadd690b6ba5e2bc845e0a0c8"}, {"celebrity_name": "Nicholas Hoult", "img_url": "https://m.media-amazon.com/images/M/MV5BMTUxMTYxNzMzNF5BMl5BanBnXkFtZTcwMTU0NTcxOQ@@._V1_UY209_CR3,0,140,209_AL_.jpg", "hash": "b6e3f18276cc4c07cc36bd8731740b33"}, {"celebrity_name": "Matthew Macfadyen", "img_url": "https://m.media-amazon.com/images/M/MV5BMjQ1ODY2ODA5MV5BMl5BanBnXkFtZTgwNDA3MzkxNzM@._V1_UY209_CR10,0,140,209_AL_.jpg", "hash": "a38277fd36eff60046b51aaaab253744"}, {"celebrity_name": "Elliot Page", "img_url": "https://m.media-amazon.com/images/M/MV5BYWY0NzFmYjAtYzMwNC00ODc3LWI2ZWEtOTU3YTM0Y2ZiNTM5XkEyXkFqcGdeQXVyMDA4NzMyOA@@._V1_UY209_CR8,0,140,209_AL_.jpg", "hash": "d8d01bbe942a441d6f9ed03d8367db86"}, {"celebrity_name": "Eliza Coupe", "img_url": "https://m.media-amazon.com/images/M/MV5BMjQ1MDg4MDYzMF5BMl5BanBnXkFtZTgwODUxNDg3MzI@._V1_UY209_CR87,0,140,209_AL_.jpg", "hash": "0eb2fd84fb4a2af15cbf8d4a3ebde519"}, {"celebrity_name": "David Tennant", "img_url": "https://m.media-amazon.com/images/M/MV5BMTEzOTA4NTAzOTReQTJeQWpwZ15BbWU4MDg1ODc4NzEx._V1_UY209_CR2,0,140,209_AL_.jpg", "hash": "64130bfa00073829da000ce23f4d5572"}, {"celebrity_name": "Leslie Grace", "img_url": "https://m.media-amazon.com/images/M/MV5BYTM3OWZhNTUtMzFmYy00NWZmLWJiYTYtNDNlMjIxOTJjMDI3XkEyXkFqcGdeQXVyMTA2MDY0MTE2.jpg", "hash": "fcdb5dbda91211550079419cc0bc7911"}, {"celebrity_name": "Mark Wahlberg", "img_url": "https://m.media-amazon.com/images/M/MV5BMTU0MTQ4OTMyMV5BMl5BanBnXkFtZTcwMTQxOTY1NA@@._V1_UY209_CR10,0,140,209_AL_.jpg", "hash": "de95dd3e4087836a9e27e0bf3f4dc91b"}, {"celebrity_name": "Liv Hewson", "img_url": "https://m.media-amazon.com/images/M/MV5BMDE1YjE1ZTMtYjgwNS00ODQyLWIzNDctZGE4NDllMDMyOGFiL2ltYWdlXkEyXkFqcGdeQXVyNTgwNDU1NjY@._V1_UY209_CR13,0,140,209_AL_.jpg", "hash": "9b3d08ea6e07d159e020ed516cbb6eb7"}, {"celebrity_name": "Rachael Harris", "img_url": "https://m.media-amazon.com/images/M/MV5BMDE0NzRhMGMtMjNkYy00YjMxLTk2ZGUtNjkxODU1NmI0ZWY0XkEyXkFqcGdeQXVyNDk4NzYxOA@@._V1_UY209_CR87,0,140,209_AL_.jpg", "hash": "3feba4b5b20b6cacfb6280417ca786e5"}, {"celebrity_name": "Evangeline Lilly", "img_url": "https://m.media-amazon.com/images/M/MV5BMTc2MDMzODU0OV5BMl5BanBnXkFtZTgwODIwOTAxMzI@._V1_UY209_CR21,0,140,209_AL_.jpg", "hash": "cfc72a3b96835923002c89ce685e07e7"}, {"celebrity_name": "George Clooney", "img_url": "https://m.media-amazon.com/images/M/MV5BMjEyMTEyOTQ0MV5BMl5BanBnXkFtZTcwNzU3NTMzNw@@._V1_UY209_CR7,0,140,209_AL_.jpg", "hash": "6934033519f87f478a67d35b0587f371"}, {"celebrity_name": "Yan-Kay Crystal Lowe", "img_url": "https://m.media-amazon.com/images/M/MV5BNjlkZTIzMjItMjU0ZS00MDczLWFjNTMtOWVjN2YyY2Q1YzAyXkEyXkFqcGdeQXVyMzY4MzA1MDI@.jpg", "hash": "ff653c1c1afd2cc6a6c434b59d0180cc"}, {"celebrity_name": "Eva Green", "img_url": "https://m.media-amazon.com/images/M/MV5BMTQ0MDA2ODE2Ml5BMl5BanBnXkFtZTcwMjI0Nzc3Nw@@.jpg", "hash": "dd2b0c18003804653c467161226a4a92"}, {"celebrity_name": "Anna Torv", "img_url": "https://m.media-amazon.com/images/M/MV5BMzQ0NDg0MjQ3NV5BMl5BanBnXkFtZTgwOTI5OTAwODE@._V1_UY209_CR8,0,140,209_AL_.jpg", "hash": "bbc9203ff4763c21a4511beb75d99fd5"}, {"celebrity_name": "John Posey", "img_url": "https://m.media-amazon.com/images/M/MV5BYmQ1OTA4ZDEtNzhjNy00OWIxLWI5Y2UtMzczMDIxMmM4ZGFjXkEyXkFqcGdeQXVyMTU4NjQ1Mw@@.jpg", "hash": "f9cb31fa58988d42e7d57ec87e77de99"}, {"celebrity_name": "Maggie Q", "img_url": "https://m.media-amazon.com/images/M/MV5BMTU3MTQyMDIyNl5BMl5BanBnXkFtZTcwNTMzODAzMQ@@._V1_UY209_CR14,0,140,209_AL_.jpg", "hash": "1ef88cc726584465d77992f662a38b3f"}, {"celebrity_name": "Alanna Ubach", "img_url": "https://m.media-amazon.com/images/M/MV5BNDE5YmJhZTAtN2RiYi00ZmFiLThiMmQtZjgxNzdlNjg0MzZhXkEyXkFqcGdeQXVyMjQwMDg0Ng@@.jpg", "hash": "52fa2210717ca3a62e01891261505794"}, {"celebrity_name": "Joel Kinnaman", "img_url": "https://m.media-amazon.com/images/M/MV5BNGIwMDVkNjktMzM3MC00ZmZmLTg3ZDYtZGEzZjU5NDI3ZTkyXkEyXkFqcGdeQXVyNTcxNDk1MA@@.jpg", "hash": "cbf1ed96834495ff96594e4eaa7b0d74"}, {"celebrity_name": "Frank Grillo", "img_url": "https://m.media-amazon.com/images/M/MV5BNDEyMjk5NDM1M15BMl5BanBnXkFtZTgwOTAyMDE2MjE@._V1_UY209_CR66,0,140,209_AL_.jpg", "hash": "06690e7863461fde6b65c27128dac666"}, {"celebrity_name": "Georgina Haig", "img_url": "https://m.media-amazon.com/images/M/MV5BMTA1OTgzNjI4MzleQTJeQWpwZ15BbWU3MDgxMDQ0OTM@._V1_UY209_CR3,0,140,209_AL_.jpg", "hash": "941eb759841388b9dd1da1f103b00765"}, {"celebrity_name": "Kyle Gallner", "img_url": "https://m.media-amazon.com/images/M/MV5BZDU5ZDIxZTctMmU4Zi00MmEzLTk5ZWUtN2ZlYTRjZDhiYTdjXkEyXkFqcGdeQXVyNDUxNjE3MA@@._V1_UY209_CR13,0,140,209_AL_.jpg", "hash": "8cf3f3b599e5e61f46ee92c1fcfabf6c"}, {"celebrity_name": "Nicholas Braun", "img_url": "https://m.media-amazon.com/images/M/MV5BMzBiMzFmYTItY2IxZC00ZjhlLTgxMDAtOWU1ODZkNDBjMGQ3XkEyXkFqcGdeQXVyMTkxNjUyNQ@@.jpg", "hash": "494e6f40b5994f4ab746122a86bb7f0e"}, {"celebrity_name": "Rachel Zegler", "img_url": "https://m.media-amazon.com/images/M/MV5BMjQyNzg3MDQ2OF5BMl5BanBnXkFtZTgwMDAzNjcxNzM@._V1_UY209_CR34,0,140,209_AL_.jpg", "hash": "4e6b54c24b95924dac2d75037239c900"}, {"celebrity_name": "Kate Winslet", "img_url": "https://m.media-amazon.com/images/M/MV5BODgzMzM2NTE0Ml5BMl5BanBnXkFtZTcwMTcyMTkyOQ@@.jpg", "hash": "780d39aa7dc32c136e67126a15a069db"}, {"celebrity_name": "Jonah Hill", "img_url": "https://m.media-amazon.com/images/M/MV5BMTUyNDU0NzAwNl5BMl5BanBnXkFtZTcwMzQxMzIzNw@@._V1_UY209_CR19,0,140,209_AL_.jpg", "hash": "5025306a6f344d357c0f5d2946f68418"}, {"celebrity_name": "Paul Rudd", "img_url": "https://m.media-amazon.com/images/M/MV5BMTY4NTEwNDg1MV5BMl5BanBnXkFtZTgwODMwMDA0ODE@._V1_UY209_CR13,0,140,209_AL_.jpg", "hash": "c5b8ebf089b4be21ae13947a821846d2"}, {"celebrity_name": "Zoe Saldana", "img_url": "https://m.media-amazon.com/images/M/MV5BMTM2MjIwOTc0Nl5BMl5BanBnXkFtZTcwNzQ5ODM1Mw@@.jpg", "hash": "da2fb1b751e23e61631b6ca7608c99e1"}, {"celebrity_name": "Brie Larson", "img_url": "https://m.media-amazon.com/images/M/MV5BMjExODkxODU3NF5BMl5BanBnXkFtZTgwNTM0MTk3NjE@._V1_UY209_CR5,0,140,209_AL_.jpg", "hash": "b7b075b058855237b952f7884bd78e4b"}, {"celebrity_name": "Michelle Monaghan", "img_url": "https://m.media-amazon.com/images/M/MV5BNzEwYTdjNjYtZDk4NC00YzFmLTlkZTQtNTQyZTg3YmIxYWIxL2ltYWdlXkEyXkFqcGdeQXVyNzg5MzIyOA@@._V1_UY209_CR13,0,140,209_AL_.jpg", "hash": "d0745ac9b5cb92cbb882dd4bd9f7eb62"}, {"celebrity_name": "Alia Shawkat", "img_url": "https://m.media-amazon.com/images/M/MV5BNzliZjM0ZWMtNWM5Zi00ZGQyLWE5Y2YtNDMxMThjYTNkNGZkXkEyXkFqcGdeQXVyMTc0MTIxOQ@@._V1_UY209_CR8,0,140,209_AL_.jpg", "hash": "e1a37c01f44218245d066d4b3fec18cc"}, {"celebrity_name": "Matt Berry", "img_url": "https://m.media-amazon.com/images/M/MV5BMTgzMjQ0NTc5Nl5BMl5BanBnXkFtZTcwMDc0MDYwOA@@._V1_UY209_CR0,0,140,209_AL_.jpg", "hash": "6ec84d9c19378d3748c473750f520501"}, {"celebrity_name": "Bella Thorne", "img_url": "https://m.media-amazon.com/images/M/MV5BOWVmMThmYTctMDcxYi00Yzk5LTlhZDgtYzAyMWU3NDllNDIyXkEyXkFqcGdeQXVyMzI4OTE3Nzk@._V1_UY209_CR69,0,140,209_AL_.jpg", "hash": "25e70e9e6ab27a974309e2dd77d39451"}, {"celebrity_name": "Julia Stiles", "img_url": "https://m.media-amazon.com/images/M/MV5BMTgxNjUxNDk3MF5BMl5BanBnXkFtZTcwMzM0NjA0NA@@.jpg", "hash": "9527a6ef9db8a04152e6a96f26c9fbb3"}, {"celebrity_name": "Jamie Clayton", "img_url": "https://m.media-amazon.com/images/M/MV5BNWRlZGY2NTAtYmU5OS00ZWJkLTlmMDItYmY5ZDJjNDEwOTc4XkEyXkFqcGdeQXVyMTAyMDk3MTUx._V1_UY209_CR25,0,140,209_AL_.jpg", "hash": "43679b6e8d0e33d05e90a36ee3c322f0"}, {"celebrity_name": "Trystan Gravelle", "img_url": "https://m.media-amazon.com/images/M/MV5BMTU1NDQxODkwMF5BMl5BanBnXkFtZTgwMTkxOTYxNTM@._V1_UY209_CR116,0,140,209_AL_.jpg", "hash": "f1c4f3d5aa8763464ce1d56d9d3d21e0"}, {"celebrity_name": "Sofia Boutella", "img_url": "https://m.media-amazon.com/images/M/MV5BMzU4ODM4MTQzMl5BMl5BanBnXkFtZTgwNTk5NzkxNTM@._V1_UY209_CR3,0,140,209_AL_.jpg", "hash": "4b7a76c185cef626882093819338deb7"}, {"celebrity_name": "Keira Knightley", "img_url": "https://m.media-amazon.com/images/M/MV5BMTYwNDM0NDA3M15BMl5BanBnXkFtZTcwNTkzMjQ3OA@@._V1_UY209_CR4,0,140,209_AL_.jpg", "hash": "489c3a106db276857801c901a4e8c7b8"}, {"celebrity_name": "Alexander Dreymon", "img_url": "https://m.media-amazon.com/images/M/MV5BMmIzMjc5Y2ItNTIyZi00YTEzLWI4NDAtODQ0MzBiNTZmMDMxXkEyXkFqcGdeQXVyMjQwMzc1MzI@._V1_UY209_CR13,0,140,209_AL_.jpg", "hash": "7b24bd6566659258b1ef5a940f3b643e"}, {"celebrity_name": "Vanessa Hudgens", "img_url": "https://m.media-amazon.com/images/M/MV5BZGY4NGU0NjgtNjc0Mi00OTk3LWFmMzktNjY4M2JlMDkzOTFkXkEyXkFqcGdeQXVyMTExNzQ3MzAw._V1_UY209_CR8,0,140,209_AL_.jpg", "hash": "c4a2c5b0077057138a4f25f82f30ee4c"}, {"celebrity_name": "Evan Peters", "img_url": "https://m.media-amazon.com/images/M/MV5BMjA2NDg2ODYwMV5BMl5BanBnXkFtZTgwNTE4MzQyNzE@._V1_UY209_CR0,0,140,209_AL_.jpg", "hash": "61db28ea71d5f0ee3551fc124090ff1b"}, {"celebrity_name": "Daniel Day-Lewis", "img_url": "https://m.media-amazon.com/images/M/MV5BMjE2NDY2NDc1Ml5BMl5BanBnXkFtZTcwNjAyMjkwOQ@@._V1_UY209_CR9,0,140,209_AL_.jpg", "hash": "a6af683800c6e4099cdb40ddd5d74071"}, {"celebrity_name": "Lacey Chabert", "img_url": "https://m.media-amazon.com/images/M/MV5BMTU1Nzc3NzAwMl5BMl5BanBnXkFtZTcwNzY1ODk0Mg@@.jpg", "hash": "9b01a27e2aad0019b92f7ffdc847aa7c"}, {"celebrity_name": "Ralph Fiennes", "img_url": "https://m.media-amazon.com/images/M/MV5BMzc5MjE1NDgyN15BMl5BanBnXkFtZTcwNzg2ODgwNA@@._V1_UY209_CR10,0,140,209_AL_.jpg", "hash": "91af55669162e881d00ae003a3bbb5a3"}, {"celebrity_name": "Robert Rodriguez", "img_url": "https://m.media-amazon.com/images/M/MV5BMTc0NDg4ODAwNF5BMl5BanBnXkFtZTgwMTIxNTA0MjE@.jpg", "hash": "219cdd4add3cc28511a7967c133bf4b9"}, {"celebrity_name": "Liev Schreiber", "img_url": "https://m.media-amazon.com/images/M/MV5BMjM5NjI1NzA1Ml5BMl5BanBnXkFtZTgwNDc0ODM3ODE@._V1_UY209_CR10,0,140,209_AL_.jpg", "hash": "3216c2c688e552e2544cfca529be0b11"}, {"celebrity_name": "Steven Spielberg", "img_url": "https://m.media-amazon.com/images/M/MV5BMTY1NjAzNzE1MV5BMl5BanBnXkFtZTYwNTk0ODc0.jpg", "hash": "e8e6669568b3a1e7b6909dff539f7a88"}, {"celebrity_name": "Guillermo del Toro", "img_url": "https://m.media-amazon.com/images/M/MV5BOTUzNTYwNjE0N15BMl5BanBnXkFtZTcwMjc0ODM1Mw@@._V1_UY209_CR13,0,140,209_AL_.jpg", "hash": "03fd45c1566946e94eaafe57cad4ecba"}, {"celebrity_name": "Leonie Benesch", "img_url": "https://m.media-amazon.com/images/M/MV5BOGE1ZTk1ZmYtOTBiMi00MWE5LWEzNjktMjY3OWExYTFkZDhkXkEyXkFqcGdeQXVyNjM3MjM3OTI@._V1_UY209_CR87,0,140,209_AL_.jpg", "hash": "f70e76227a5e0ebb42d954e1402b3b27"}, {"celebrity_name": "María Cecilia Botero", "img_url": "https://m.media-amazon.com/images/M/MV5BMDdlMDhmNTYtM2Q3Zi00ZDQ5LWFhZjgtZDg1OGExOTczYWY5XkEyXkFqcGdeQXVyMTM0NDU2NTIz._V1_UY209_CR34,0,140,209_AL_.jpg", "hash": "eec593f1d71a8aa054452158ddb4198d"}, {"celebrity_name": "Andy Samberg", "img_url": "https://m.media-amazon.com/images/M/MV5BNDg3NDk3ODI0Ml5BMl5BanBnXkFtZTgwOTE3MTE4NTM@._V1_UY209_CR5,0,140,209_AL_.jpg", "hash": "147a10c298e1e6c2260fde6fa5c719fa"}, {"celebrity_name": "Annie Potts", "img_url": "https://m.media-amazon.com/images/M/MV5BMjA0NjkyMDIzMF5BMl5BanBnXkFtZTcwNjc2NTUyMQ@@._V1_UY209_CR8,0,140,209_AL_.jpg", "hash": "c0c7dc2b5bd3613812bad59f804dab38"}, {"celebrity_name": "Aaron Taylor-Johnson", "img_url": "https://m.media-amazon.com/images/M/MV5BMzE5MzI0MzY2OF5BMl5BanBnXkFtZTgwODE3MTk4MTE@._V1_UY209_CR9,0,140,209_AL_.jpg", "hash": "4949929e37f3feeae4afeab2f835338f"}, {"celebrity_name": "Vera Farmiga", "img_url": "https://m.media-amazon.com/images/M/MV5BMjIwNTU3NDUyMl5BMl5BanBnXkFtZTgwODEwODg5NDE@._V1_UY209_CR87,0,140,209_AL_.jpg", "hash": "dd91d705ec3821dad8b327f7e52beb30"}, {"celebrity_name": "Lindsay Duncan", "img_url": "https://m.media-amazon.com/images/M/MV5BMTYwNTkxOTQzMV5BMl5BanBnXkFtZTcwODQ3ODIyOA@@.jpg", "hash": "3bef80a53ee33d8a49847daed0ddea0a"}, {"celebrity_name": "Jennifer Love Hewitt", "img_url": "https://m.media-amazon.com/images/M/MV5BNjIyNzI0MTAyOV5BMl5BanBnXkFtZTcwMDM3MTUwNw@@._V1_UY209_CR87,0,140,209_AL_.jpg", "hash": "bcea571154e3d8100caae2d46926799b"}, {"celebrity_name": "Guy Ritchie", "img_url": "https://m.media-amazon.com/images/M/MV5BMTM2NDkxMTcxMl5BMl5BanBnXkFtZTcwNTMyNjI5MQ@@._V1_UY209_CR6,0,140,209_AL_.jpg", "hash": "29d94f4d5d967bee395f081415d323a6"}, {"celebrity_name": "Anne Hathaway", "img_url": "https://m.media-amazon.com/images/M/MV5BMTRhNzQ3NGMtZmQ1Mi00ZTViLTk3OTgtOTk0YzE2YTgwMmFjXkEyXkFqcGdeQXVyNzg5MzIyOA@@._V1_UY209_CR14,0,140,209_AL_.jpg", "hash": "2715361fbdfd390af027a083452a01e3"}, {"celebrity_name": "Logan Lerman", "img_url": "https://m.media-amazon.com/images/M/MV5BODcyMTE4MTU0Ml5BMl5BanBnXkFtZTgwMjg2ODE5MDI@._V1_UY209_CR87,0,140,209_AL_.jpg", "hash": "23455af8c2de25b1042f3c994a028250"}, {"celebrity_name": "Shelley Fabares", "img_url": "https://m.media-amazon.com/images/M/MV5BMTM5ODY4Nzc2M15BMl5BanBnXkFtZTYwMDI3ODU2.jpg", "hash": "fd045a2256ffb1acdf49c7591f5a4667"}, {"celebrity_name": "Gerard Butler", "img_url": "https://m.media-amazon.com/images/M/MV5BMjE4NDMwMzc4Ml5BMl5BanBnXkFtZTcwMDg4Nzg4Mg@@._V1_UY209_CR4,0,140,209_AL_.jpg", "hash": "849d09e9e68168e51f5b74c28c993b4c"}, {"celebrity_name": "Wendy Moniz", "img_url": "https://m.media-amazon.com/images/M/MV5BNDM0NjJjNjgtNTRlNi00MjJmLTlkOTMtZWRmMTc4NDI2NDIyXkEyXkFqcGdeQXVyODA4MDY0MDk@._V1_UY209_CR86,0,140,209_AL_.jpg", "hash": "0b5a1b62d72d365a034c260930de1666"}, {"celebrity_name": "Sidney Poitier", "img_url": "https://m.media-amazon.com/images/M/MV5BMTQ0OTE3MzQ2Nl5BMl5BanBnXkFtZTcwMDc2MDc1NA@@.jpg", "hash": "b3cfd46327442bcafcb15bf3b726f4ab"}, {"celebrity_name": "Mecia Simson", "img_url": "https://m.media-amazon.com/images/M/MV5BNTcyZTAyZjQtODM5Yy00MDNmLWI1NDYtZTk4NjQ1MWUwNWRlXkEyXkFqcGdeQXVyNTI2MzExOTg@._V1_UY209_CR0,0,140,209_AL_.jpg", "hash": "c5ceed6657e0b4349bdba51c9f4f65df"}, {"celebrity_name": "Natalie Dormer", "img_url": "https://m.media-amazon.com/images/M/MV5BNjM4NjQwMzE1Ml5BMl5BanBnXkFtZTgwNjg5MTM0NzE@.jpg", "hash": "2837bbc3e6215110f3eb1feb8825a428"}, {"celebrity_name": "Peter Mullan", "img_url": "https://m.media-amazon.com/images/M/MV5BMTA2NDUxMjIzNzVeQTJeQWpwZ15BbWU2MDU0MTk3NA@@.jpg", "hash": "67b0e5a66d4439f4ac48e955ee792ab0"}, {"celebrity_name": "Jennifer Carpenter", "img_url": "https://m.media-amazon.com/images/M/MV5BMTA3Mzk2NTk0MDReQTJeQWpwZ15BbWU3MDQ1MDQyNzY@.jpg", "hash": "57da5c1840924ffa482f2199b24d2089"}, {"celebrity_name": "Lucy Hale", "img_url": "https://m.media-amazon.com/images/M/MV5BNDI0NWMwYzUtMTc0MS00ZTc2LTk5ZjYtY2U3MTZlMjVlZTRmXkEyXkFqcGdeQXVyMTc4ODc3MQ@@._V1_UY209_CR13,0,140,209_AL_.jpg", "hash": "a299cac03c8e7091d2b42516edbc8958"}, {"celebrity_name": "Graham McTavish", "img_url": "https://m.media-amazon.com/images/M/MV5BMjk5MzQ4NzQwN15BMl5BanBnXkFtZTgwNTMwMTg4NTM@._V1_UY209_CR9,0,140,209_AL_.jpg", "hash": "0ac1e14eb726e01d3b4091662c50bb36"}, {"celebrity_name": "Jason Statham", "img_url": "https://m.media-amazon.com/images/M/MV5BMTkxMzk2MDkwOV5BMl5BanBnXkFtZTcwMDAxODQwMg@@.jpg", "hash": "90de231c444b66d0a64726447ebebde1"}, {"celebrity_name": "Gary Oldman", "img_url": "https://m.media-amazon.com/images/M/MV5BMTc3NTM4MzQ5MV5BMl5BanBnXkFtZTcwOTE4MDczNw@@._V1_UY209_CR1,0,140,209_AL_.jpg", "hash": "55efeb143a6c813b776bab5d58ae3747"}, {"celebrity_name": "David Arquette", "img_url": "https://m.media-amazon.com/images/M/MV5BMjEzODYyNjg3NV5BMl5BanBnXkFtZTcwMzYwOTgyNg@@._V1_UY209_CR10,0,140,209_AL_.jpg", "hash": "25ded69570eeb2066dd211dc77dbda39"}, {"celebrity_name": "Hardy Krüger", "img_url": "https://m.media-amazon.com/images/M/MV5BOGQzM2EzYjYtOTViMy00ZDVjLTk4ZWEtYTRkZDdkZjBkMjE3XkEyXkFqcGdeQXVyMzI5NDcxNzI@.jpg", "hash": "bee47793f1f64232ded6161a262cb9f3"}, {"celebrity_name": "Gillian Anderson", "img_url": "https://m.media-amazon.com/images/M/MV5BMmRjNWQwMDQtMWNjZS00ZTUzLTkwODEtMTU5YjRlZmJiMTVkXkEyXkFqcGdeQXVyMTEzNjc3MDQ5._V1_UY209_CR13,0,140,209_AL_.jpg", "hash": "cbe084879495c094f2152e08942a24c7"}, {"celebrity_name": "Kaley Cuoco", "img_url": "https://m.media-amazon.com/images/M/MV5BMjYyYmNlZTMtM2RlZC00YTlhLTk5YzItZTQ4OTA3Y2FkNzFlXkEyXkFqcGdeQXVyOTAzMjY1OTY@._V1_UY209_CR8,0,140,209_AL_.jpg", "hash": "f1063ecf169fb878d62cf1bae83f0e92"}, {"celebrity_name": "Bea Arthur", "img_url": "https://m.media-amazon.com/images/M/MV5BOTkzNDg0ODg4MF5BMl5BanBnXkFtZTYwNDEwOTEz._V1_UY209_CR12,0,140,209_AL_.jpg", "hash": "3fb2b89e72a2433c907b4253f4742341"}, {"celebrity_name": "Zachary Levi", "img_url": "https://m.media-amazon.com/images/M/MV5BMTU5NjEwOTgwMF5BMl5BanBnXkFtZTgwOTEzMDk1NTM@.jpg", "hash": "4a3c31a3164f11a0d88e602c4db16152"}, {"celebrity_name": "Liam Neeson", "img_url": "https://m.media-amazon.com/images/M/MV5BMjA1MTQ3NzU1MV5BMl5BanBnXkFtZTgwMDE3Mjg0MzE@._V1_UY209_CR35,0,140,209_AL_.jpg", "hash": "056f0f71c72d0754904d6352a3f06fa0"}, {"celebrity_name": "Martin Scorsese", "img_url": "https://m.media-amazon.com/images/M/MV5BMTcyNDA4Nzk3N15BMl5BanBnXkFtZTcwNDYzMjMxMw@@.jpg", "hash": "52c345309e7d4459dc41c694a2b475db"}, {"celebrity_name": "Arielle Kebbel", "img_url": "https://m.media-amazon.com/images/M/MV5BZWRiZDY2ZWYtMDZkYS00MzFhLWJkOWQtYjhkYjQxOTRiNTIyXkEyXkFqcGdeQXVyMjU3OTMyODI@.jpg", "hash": "aa110e9842c903bcc6ebd8bfd9322532"}, {"celebrity_name": "Michael Stuhlbarg", "img_url": "https://m.media-amazon.com/images/M/MV5BNjdjNTlhZjUtODA0MC00Mjc3LWExNmMtZDc5ZmI0ZmNlZWZmXkEyXkFqcGdeQXVyMjQwMDg0Ng@@.jpg", "hash": "8586e0e27c05096eede931be01eb2472"}, {"celebrity_name": "Maddie Ziegler", "img_url": "https://m.media-amazon.com/images/M/MV5BNGZiOTk0ODItYmRiMS00Mzg5LWFmZjUtYWVmZmNiODE0ZDIzXkEyXkFqcGdeQXVyNjk1MjYyNTA@._V1_UY209_CR32,0,140,209_AL_.jpg", "hash": "c2dcc5de963b8bf2c29512ca4c90e071"}, {"celebrity_name": "Carla Gugino", "img_url": "https://m.media-amazon.com/images/M/MV5BNzQyNTgzOTI2OF5BMl5BanBnXkFtZTgwNTMyMDk0NjE@.jpg", "hash": "3abf49d6e2b05dc90083753d50921957"}, {"celebrity_name": "Claire Foy", "img_url": "https://m.media-amazon.com/images/M/MV5BNTI5OTMwNzM4NV5BMl5BanBnXkFtZTcwNDY1NjkyNA@@._V1_UY209_CR5,0,140,209_AL_.jpg", "hash": "75380eeabbb869ef544b3cdf116cc588"}, {"celebrity_name": "Mads Mikkelsen", "img_url": "https://m.media-amazon.com/images/M/MV5BMTcyMTU5MzgxMF5BMl5BanBnXkFtZTYwMDI0NjI1.jpg", "hash": "36c5f105dbda021085af29ba8bc25b31"}, {"celebrity_name": "Kate Beckinsale", "img_url": "https://m.media-amazon.com/images/M/MV5BMTM3MzY2MDYwOF5BMl5BanBnXkFtZTcwODQ3MDA0Nw@@.jpg", "hash": "866f9c05741911f68bad4b04dfdbbcb8"}, {"celebrity_name": "Philippine Leroy-Beaulieu", "img_url": "https://m.media-amazon.com/images/M/MV5BYTkzOGJlYjctMzZjYy00NTQ3LTg2ZGMtY2ZiOTk4ZDczNjE3XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY209_CR34,0,140,209_AL_.jpg", "hash": "b036357612a41b1685d75619e58a719e"}, {"celebrity_name": "Robert De Niro", "img_url": "https://m.media-amazon.com/images/M/MV5BMjAwNDU3MzcyOV5BMl5BanBnXkFtZTcwMjc0MTIxMw@@._V1_UY209_CR9,0,140,209_AL_.jpg", "hash": "8954ca8694646a88dc6134440f12fe96"}, {"celebrity_name": "Tori Kelly", "img_url": "https://m.media-amazon.com/images/M/MV5BMzYyMzYyODIwOV5BMl5BanBnXkFtZTgwMDM0NDM3NTE@.jpg", "hash": "763d7ca2601e12c94096a716ac8e3c84"}, {"celebrity_name": "Dan Stevens", "img_url": "https://m.media-amazon.com/images/M/MV5BMTY0NTY5OTI2MF5BMl5BanBnXkFtZTgwNDkzMzIxMzE@._V1_UY209_CR5,0,140,209_AL_.jpg", "hash": "3b11038b5d7759c72cea8b43365e0d74"}, {"celebrity_name": "Sylvester Stallone", "img_url": "https://m.media-amazon.com/images/M/MV5BMTQwMTk3NDU2OV5BMl5BanBnXkFtZTcwNTA3MTI0Mw@@._V1_UY209_CR5,0,140,209_AL_.jpg", "hash": "a0a06928df0a5a2400ef462c2ae19f63"}, {"celebrity_name": "Becca Tobin", "img_url": "https://m.media-amazon.com/images/M/MV5BODllZGNhMTQtMDNjYy00YjUyLTg4Y2QtODA5NGYxNDdiMDVkL2ltYWdlXkEyXkFqcGdeQXVyNjk4NDI4ODY@._V1_UY209_CR34,0,140,209_AL_.jpg", "hash": "1e9cfa15f5b8db1f098bec2ea6ae1fe6"}, {"celebrity_name": "Jo Hartley", "img_url": "https://m.media-amazon.com/images/M/MV5BMTNmNjcyMGEtYTA3Ni00NzZiLTkxMWMtMGU1OGUzZGQ4OGY4XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY209_CR34,0,140,209_AL_.jpg", "hash": "49a844e9d1479d2c1ddb696f46267c56"}, {"celebrity_name": "Hayley Atwell", "img_url": "https://m.media-amazon.com/images/M/MV5BZmRhZWVjZWMtMzUwZi00OTI3LThiMzAtY2VmMjU5YjQ0YjVjXkEyXkFqcGdeQXVyODMzMTM1MDc@._V1_UY209_CR11,0,140,209_AL_.jpg", "hash": "8f5609c907c46583d574d76b0e958f23"}, {"celebrity_name": "Mika Abdalla", "img_url": "https://m.media-amazon.com/images/M/MV5BODExM2YzMjktNjM1OC00YzliLWI5ZjYtYTZjMGY1MTFiNTJmXkEyXkFqcGdeQXVyMTk3NTcwNDM@.jpg", "hash": "02e665f6f0faf07798ee107fb8c05881"}, {"celebrity_name": "Tony Way", "img_url": "https://m.media-amazon.com/images/M/MV5BNzUzYzg5NGUtOWE5Zi00Y2MwLTg2YzQtMDZlOWE1NDZjZmFkXkEyXkFqcGdeQXVyMjk3NTUyOTc@._V1_UY209_CR34,0,140,209_AL_.jpg", "hash": "54a2ee0ed35d59291bc7c046c6f6c64a"}, {"celebrity_name": "Tatiana Maslany", "img_url": "https://m.media-amazon.com/images/M/MV5BNzg5NjE4NDgzMl5BMl5BanBnXkFtZTgwNzk5OTQwMjE@._V1_UY209_CR87,0,140,209_AL_.jpg", "hash": "5f8336b5b24d79e73288d226d5756c0f"}, {"celebrity_name": "Rachel Brosnahan", "img_url": "https://m.media-amazon.com/images/M/MV5BZjQ0OWQyZjQtZDllOC00MDRlLTlhNTktNjMxM2RlYTQzN2ViXkEyXkFqcGdeQXVyMTg1NTk0NTI@.jpg", "hash": "e4364df384d4d0166efaaadf2c1e391a"}, {"celebrity_name": "Joel Coen", "img_url": "https://m.media-amazon.com/images/M/MV5BMTg3MjgwMzUzOF5BMl5BanBnXkFtZTcwODM5Nzk4MQ@@.jpg", "hash": "8dc2ee3094fb6d5c105372790d2ad791"}, {"celebrity_name": "Javier Bardem", "img_url": "https://m.media-amazon.com/images/M/MV5BMTY1NTc4NTYzMF5BMl5BanBnXkFtZTcwNDIwOTY1NA@@.jpg", "hash": "c1c9389d36d5357631f83b0b4d695cd2"}, {"celebrity_name": "Eliza Dushku", "img_url": "https://m.media-amazon.com/images/M/MV5BMjEyNjM1OTc4MF5BMl5BanBnXkFtZTcwNDAzNzAzNA@@._V1_UY209_CR54,0,140,209_AL_.jpg", "hash": "64b7f84982860cfe7c79942265b0f63c"}, {"celebrity_name": "Lizzy Caplan", "img_url": "https://m.media-amazon.com/images/M/MV5BMjA1MDgxNDU0Nl5BMl5BanBnXkFtZTgwNjk4NTgwMTE@._V1_UY209_CR13,0,140,209_AL_.jpg", "hash": "9bca09e3eaaea907fa4566760a0d9b51"}, {"celebrity_name": "April Bowlby", "img_url": "https://m.media-amazon.com/images/M/MV5BZTgyNzY5YzgtMjNmOS00ZWMzLWE4ZGMtOWM4ODUzYjM2YzQzL2ltYWdlXkEyXkFqcGdeQXVyOTgzNjIwMQ@@.jpg", "hash": "1649b963d612465416581f87ae266117"}, {"celebrity_name": "Bailee Madison", "img_url": "https://m.media-amazon.com/images/M/MV5BZmNjMzg5YjYtMWNmNy00ZGY1LWE3MGMtOTBhYWY0ZmY1MGE3XkEyXkFqcGdeQXVyMTAwNjAwODg@._V1_UY209_CR12,0,140,209_AL_.jpg", "hash": "d353ea20700f7ea1856eafad139d4487"}, {"celebrity_name": "Reese Witherspoon", "img_url": "https://m.media-amazon.com/images/M/MV5BYTdlMzNkODUtZTA2My00NzJhLTkwMjAtMzk4MWQ0MDQzMGNiXkEyXkFqcGdeQXVyNDY1Njg3OA@@._V1_UY209_CR34,0,140,209_AL_.jpg", "hash": "bc9839583b3153ea727f137da87429ec"}, {"celebrity_name": "Bobby Cannavale", "img_url": "https://m.media-amazon.com/images/M/MV5BMTU0NzM3MzQ4Ml5BMl5BanBnXkFtZTgwOTg2MjY4ODE@._V1_UY209_CR115,0,140,209_AL_.jpg", "hash": "f064c6ad707ca405215b81373f1d96d1"}, {"celebrity_name": "Adrianne Palicki", "img_url": "https://m.media-amazon.com/images/M/MV5BMTQ4MjM4OTA2OF5BMl5BanBnXkFtZTcwNDM3NzIzOQ@@.jpg", "hash": "030d43e84901a5205f218d9190e80d23"}, {"celebrity_name": "Deborah Ann Woll", "img_url": "https://m.media-amazon.com/images/M/MV5BMjE2NjA4NzYyMV5BMl5BanBnXkFtZTcwODEwNjQyMw@@._V1_UY209_CR18,0,140,209_AL_.jpg", "hash": "50229784219ca62e50127b1c4d797f70"}, {"celebrity_name": "Chris Hemsworth", "img_url": "https://m.media-amazon.com/images/M/MV5BOTU2MTI0NTIyNV5BMl5BanBnXkFtZTcwMTA4Nzc3OA@@.jpg", "hash": "bdda8991f496ec6ece19431b0d44d3b1"}, {"celebrity_name": "Alice Eve", "img_url": "https://m.media-amazon.com/images/M/MV5BOTM5NzI1NTMwN15BMl5BanBnXkFtZTcwOTQ0NjExNw@@.jpg", "hash": "de75f77d9f3157efe0badee10586fbe2"}, {"celebrity_name": "Ryan Gosling", "img_url": "https://m.media-amazon.com/images/M/MV5BMTQzMjkwNTQ2OF5BMl5BanBnXkFtZTgwNTQ4MTQ4MTE@._V1_UY209_CR12,0,140,209_AL_.jpg", "hash": "fba0ce4efd80023928d2a6c989b72bf9"}, {"celebrity_name": "Erin Sanders", "img_url": "https://m.media-amazon.com/images/M/MV5BNzkwMjBhYjUtZWRkYi00ZmE3LTk5N2YtOGY3YzhhN2ZiZDNlXkEyXkFqcGdeQXVyMzM5OTQ2OQ@@.jpg", "hash": "46bf5d8f3ac2faea327879fc1fe3c572"}, {"celebrity_name": "Maggie Smith", "img_url": "https://m.media-amazon.com/images/M/MV5BMjA4NzYxNjc5Ml5BMl5BanBnXkFtZTYwMTMzOTg1._V1_UY209_CR0,0,140,209_AL_.jpg", "hash": "e0b01e76199d609ef9cf09623c986658"}, {"celebrity_name": "Rachel Weisz", "img_url": "https://m.media-amazon.com/images/M/MV5BMTQ4MzM1MDAwMV5BMl5BanBnXkFtZTcwNTU4NzQwMw@@._V1_UY209_CR3,0,140,209_AL_.jpg", "hash": "87d77c157e94b1e9549a07785869ed18"}, {"celebrity_name": "Daniella Pineda", "img_url": "https://m.media-amazon.com/images/M/MV5BZGNhYTBlYzYtYWE1My00OWFlLThjZWItOTgxMDRiOTc3YTg0XkEyXkFqcGdeQXVyMjI3NjE3MzI@._V1_UY209_CR12,0,140,209_AL_.jpg", "hash": "f545052aa2a0f31dfd9e588166192824"}, {"celebrity_name": "Penelope Wilton", "img_url": "https://m.media-amazon.com/images/M/MV5BMzEwMjk3MDkwN15BMl5BanBnXkFtZTcwNjU5OTczNw@@.jpg", "hash": "ba28a5db4639d5139a1f01598af77f22"}, {"celebrity_name": "Samara Weaving", "img_url": "https://m.media-amazon.com/images/M/MV5BMTU1Njc2NTc3OV5BMl5BanBnXkFtZTgwMzUyNjU5NDM@._V1_UY209_CR87,0,140,209_AL_.jpg", "hash": "14945fe4d64f3a03b26f91d6cca0e077"}, {"celebrity_name": "Jean Louisa Kelly", "img_url": "https://m.media-amazon.com/images/M/MV5BYjA2NTIxODEtZDBjYy00OWY3LTg0MzgtOWI5Yzc3MDkwOWRiXkEyXkFqcGdeQXVyMjQ5MjIzNTk@.jpg", "hash": "b030fa1c2bb608ea5c531a3c25256517"}, {"celebrity_name": "Nicole Ari Parker", "img_url": "https://m.media-amazon.com/images/M/MV5BMTgyNDAyNDE1N15BMl5BanBnXkFtZTcwNjk3ODgyMQ@@.jpg", "hash": "bf33bb829ead4b093ef3d4e2ac9260d5"}, {"celebrity_name": "AnnaSophia Robb", "img_url": "https://m.media-amazon.com/images/M/MV5BMjA0ODUwYWQtOTlkZC00Mzk0LWE2ZDUtNzMyYWYzYjhjNWFiXkEyXkFqcGdeQXVyNjQ3NDAwOTA@.jpg", "hash": "56b2b3e42593c48af41a96bdb0e46b41"}, {"celebrity_name": "Machine Gun Kelly", "img_url": "https://m.media-amazon.com/images/M/MV5BMGRkMGY4YzctMjZkOC00MWM4LTliNjMtNDRmMDQ4ZWNlNTk2XkEyXkFqcGdeQXVyMTkxNjUyNQ@@._V1_UY209_CR87,0,140,209_AL_.jpg", "hash": "5977e8f65ee30188de3f66ac8e886575"}, {"celebrity_name": "Paget Brewster", "img_url": "https://m.media-amazon.com/images/M/MV5BZWU3OGQ4MmUtMDNjNi00MTIwLWE3MzctZjg1ZmZiZjVmYWVlXkEyXkFqcGdeQXVyMDcxMzQ4NA@@._V1_UY209_CR8,0,140,209_AL_.jpg", "hash": "dc2a7e9dcfd613e0fd32a98c9f1bdae6"}, {"celebrity_name": "Jason Sudeikis", "img_url": "https://m.media-amazon.com/images/M/MV5BMjE3NTE4Nzg3Ml5BMl5BanBnXkFtZTgwODc5OTUxMTI@.jpg", "hash": "336203e3b3863e5f485e491f15164b83"}, {"celebrity_name": "Jacob Bertrand", "img_url": "https://m.media-amazon.com/images/M/MV5BOTZhOGYzNzUtYWQ3Mi00OGY3LWE0ODctNjg2ZjllYzM4NThmXkEyXkFqcGdeQXVyMjQwMDg0Ng@@.jpg", "hash": "207d8ac57e258c09d27c9986adeab91d"}, {"celebrity_name": "Tawny Cypress", "img_url": "https://m.media-amazon.com/images/M/MV5BMTUzOTU5NjQzM15BMl5BanBnXkFtZTYwMjE4NzI0._V1_UY209_CR8,0,140,209_AL_.jpg", "hash": "2bad9ee215568bddf36b5ff304fa9d93"}, {"celebrity_name": "Milana Vayntrub", "img_url": "https://m.media-amazon.com/images/M/MV5BY2NjZTIwNzUtZWU1Ny00ZGEwLTljZjAtOWRhMjRkYTU1NDk5XkEyXkFqcGdeQXVyMTU0MjI3OTE@._V1_UY209_CR14,0,140,209_AL_.jpg", "hash": "811f7ab1e1ff53b1577f57357f2729d6"}, {"celebrity_name": "Jamie Chung", "img_url": "https://m.media-amazon.com/images/M/MV5BMGVkYmU0MTktN2EyNS00MDRhLWI4MmItNGVhZmJhMGY2MjljXkEyXkFqcGdeQXVyMTI0MjAwMjg@._V1_UY209_CR87,0,140,209_AL_.jpg", "hash": "39f52403e5ea263ae079b1aabcd18663"}, {"celebrity_name": "Lucien Laviscount", "img_url": "https://m.media-amazon.com/images/M/MV5BMjA4NjkwODEyNl5BMl5BanBnXkFtZTgwMzA5MTYxNjM@.jpg", "hash": "1ca328c99ada5861099f4162772ad1e9"}]}